{
    "/pmrgcauk": {
        "PMRpro": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2013-11-06",
                "age": "N/A",
                "gender": "Female",
                "country": "Italy",
                "ethnicity": "N/A"
            },
            "bio": "I've had PMR for over 15 years - so I think I'm entitled to regard myself as a pro especially since I have a background of a lifetime of medical research and allied work (I'm not a medic though)! I had 5 years untreated and have had heading for 10 years on pred with a variety of ups and downs on the way to 12mg/day at present. I've experienced a selection of different medical systems as well as probably reading more textbooks and publications about PMR (in particular) and GCA than most GPs have on the way."
        },
        "DorsetLady": {
            "tags": [
                "Osteoarthritis",
                "Paracetamol",
                "Knee Replacement",
                "Hip Replacement",
                "Joint replacement",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisolone",
                "Ageing well",
                "Women's health"
            ],
            "demographics": {
                "joined": "2012-11-04",
                "age": "77",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "GCA diagnosed April 2012 (age 65).  Remission September 2016. Hanging around hoping to help others as I was helped early days.\n\nMis-diagnosed for 18 months  between October 2010-April 2012 -  original problems pains in shoulders/biceps. Because ESR was deemed satisfactory GCA/PMR discounted by GP. Diagnosed as frozen shoulder, and any resultant head/neck pains attributed to that. Worsening fatigue was attributed to age and caring for husband. No Pred taken therefore.\n\nCorrect diagnosis from Ophthalmologist in A&E after irrevocable sight loss in right eye following 4 days of sight disturbances, specifically blurriness in right eye - started at bottom of eye moving over rest of eye until no sight remaining.\n\nReadings at diagnosis  – ESR 58, CRP 26.2. \nStarted 80mg Pred.  Took 4 and half years to get to zero; total time of GCA 6 years approximately. \nExpected side effects from Pred, slightly raised BP levels, slightly raised glaucoma levels (no action required for either).\nSteroid induced (?) cataract on remaining eye successfully replaced October 2014 when at 6mg. Initial weight gain, lost at lower levels, and more significantly once off the steroids. \n\nWidowed in 2013 (on 46th Wedding Anniversary) which although not ideal in its timing fortunately did not seem to affect my recovery, no flares of GCA, although ESR was raised mainly due to excess stress over previous few months. Late hubby in HM Forces, I worked for MOD for 30 years. Two children, four grandchildren.\n\nFinally getting my life back post GCA and enjoying it to the best of my ability. Been to New Zealand three times to see daughter and family - 2014, 2017, 2024. Hope to make more in future.\n\nJuly 2018 had total knee replacement (left);  January 2019 total hip replacement (right); February 2020 total shoulder replacement (left). Not blaming steroids, had OA before GCA, and unfortunately a family trait on maternal side.\n\nLady in banner is Freyja, Viking Goddess.\n\nAs name suggests, I live in Dorset!  But perhaps I should be renamed Titanium Lady 🤣😂🤣\n\nMore info  - see the FAQ under GCA  Members Experiences - DorsetLady’s Story"
        },
        "SheffieldJane": {
            "tags": [
                "Arthritis",
                "Graves' disease",
                "Levothyroxine",
                "Osteoarthritis",
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisolone",
                "Tocilizumab",
                "Prediabetes",
                "Diabetes diet",
                "Exercise",
                "Cervical spondylosis",
                "Physiotherapy",
                "High blood pressure (hypertension)",
                "Doxazosin",
                "Atenolol / Bendroflumethiazide",
                "Cortisol level test"
            ],
            "demographics": {
                "joined": "2016-07-18",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I am based in the U.K. I was diagnosed with GCA /LVV in April 2020 after having PMR since early 2016. I had got down to 3 mgs Prednisalone and PMR seemed to be in remission. I was diagnosed by means of Ultrasound Scan and a new headache. I am currently on 10 mgs of Prednisalone and Tocilizumab weekly injections.\nMy other conditions include Cervical Spondylosis, Graves Disease and Osteoarthritis.\nMy professional background includes HR Management, Equality and Diversity Policies, Person Centred Counselling. Specialisms, Disability, Victims of Crime, Domestic Violence, Dementia ( cared for mum).\nMarried with 3 Adult children and 4 grandchildren. All living in Australia except for son who lives with us."
        },
        "HeronNS": {
            "tags": [
                "Osteoarthritis",
                "Glucosamine",
                "Polymyalgia rheumatica",
                "Prednisone",
                "Sarcoidosis",
                "Hydrocortisone topical",
                "Cardiovascular disease (CVD)",
                "Investigational Treatment"
            ],
            "demographics": {
                "joined": "2015-08-24",
                "age": "N/A",
                "gender": "Female",
                "country": "Canada",
                "ethnicity": "N/A"
            },
            "bio": "Hi, I live in Nova Scotia, Canada.  Diagnosed with polymyalgia rheumatica in June 2015, after more than a year of increasing pain.  Medical complications include subsequent discovery that I have what they call \"low bone mass\" although exercise, diet and supplements are improving that, and recently learned that sarcoidosis (discovered through biopsy when I was in my mid-thirties) may also have some relevance to my life today.  Have been at about 2 mg prednisone for about two years (writing this 2019) after initial start dose of 15 mg.  Update October '19 appear to be successfully approaching 1 mg.  Have had to slow down DSNS taper by doing each taper twice.  \nMarch 2020 tapering to zero, Zero is \"new dose\".  :)\nJune 2020 at zero pred.  \nMy PMR journey has been bookended by injuries to my right knee.  In 2014 I sustained a tibial plateau fracture.  A couple of months after returning to work I developed fullblown PMR symptoms although I was not diagnosed until 2015.  And I have just, 31/5/20, fallen (tripped over an object in my home, my stupidity) and smashed the knee down as hard as I could.  Nothing broken but hurt enough to need a brace for a couple of weeks.   As I'm retired now I won't be overdoing things too soon this time.  :)\nActually the other knee is the bad one, after an apparently minor twist.  May be headed to eventual knee replacement but I think the problem rests with treating it as though it was osteoarthritis when it was really a damaged ligament or tendon.  gradually healing now that I've changed my behaviour.  Much of info in my blog.  https://anhaga1.com/\nZero pred lasted a month, the final week of which brought return of PMR pain, which pred sorted.  Now back at 2 mg. :(\nEnd of January 2021, unprecedented flare preceded by dramatic rise in CRP.  Up to 10 mg, and in process of quick step down to about 5 mg.   Which has not worked so far (mid-Feb).\nSept 2021 at around 4 mg pred, to my chagrin.  However knee injuries have subsided and I can take proper walks again, good for the mental outlook!\nWill this saga ever end?  Interestingly I found after my Shingrix shot at end of July I found it easier to taper for a while.  I have recently had the second, five and a half months after the first, and am feeling pretty good.  Tapering to 2.5.  Another thing which happened was my doctor sent me for morning cortisol test and result (about 60 hours after last pred dose) was right in the middle of the normal range.  And CRP is lowest it's ever been, first time I was told it was normal (3 point something).  Did the adjuvant in Shingrix help?  Footnote to vaccines:  had Moderna as second booster and since then have been very comfortably at 2.5 mg pred and tapering to 2.  Very slow progress, but progress neverthless.  PfizerX3   had been pretty much non-events, but Moderna, unexpectedly, hit me much like Shingrix.  \nApril 2023. Had Pfizer \"Spring dose\" a couple of weeks ago. Hardly even aware where the shot went in. Current pred dose 1.5 seems okay so far. I would have preferred a non-mRNA vaccine this time but Novavax only option and it's incredibly inconvenient to access.  Did not want Moderna again. I suppose there's no connection really, but it seems a bit more than coincidence that inconsequential heart symptoms quite rapidly became concerning a short while after first Moderna booster.  I didn't think to make the connection until after having Moderna bivalent. Now at glacial pace I've been undergoing various tests and there's a referral to a cardiologist. This all got underway last June (2022) and in December I got diagnosis of aortic regurgitation, later slightly glossed by my GP when he said no one part of my heart seems worse than any other. I have a \"tired\" heart. So not willing to stress it any more than is good for it.  2024 not seen specialist yet. GP has referred me to someone else. (Note: 2nd Jan '25, no cardiologist visit yet. GP re-referred me to different specialist, but even that was seven months ago)\nMay be at zero pred, time will tell. Writing this mid May 2024 and have not taken pred since Feb 1st. But broke my wrist about ten days ago so not sure what will happen next. PMR developed after a (much less serious) tibial plateau fracture. \nEnd of November, 2024, PMR still in remission. But....\nI'm actually taking pred again in what I hope will be a successful way to deal with what appears to be sarcoid patches on my skin. The good part is since I started (5 mg, now 4, to continue reducing) no new patches have appeared, and it's a lot easier to take a pill than smear on ineffective too-weak hydrocortisone ointment.  The bad part is the said too-weak ointment still needs to be used on what I have, and those patches still exist though very slowly fading.  I really hope I won't need to ask for a prescription ointment, and I am tapering more slowly than instructed because I don't want to open the door again. \nIt was accidental that I realized what this skin thing was, because it had bothered me off and on for many years, it would come and go, usually with the help of a prescription ointment then followed up with a good skin cream, but it was not a problem all those years I was on pred!  Never any diagnosis given, just treated as an idiopathic rash.  (Sarcoidosis was diagnosed through biopsy of a lymph node when I was about 35, although I never thought I had any symptoms.)  It reappeared about two months after achieving pred zero, although somewhat timidly at first and started as very sensitive skin when I was on my final taper to half a mg and then off. I remembered it was when at that very same dose in 2020, just before an unsuccessful first fling with zero, that I was cutting all the labels out of my clothes! \n2 Jan, '25, starting a new pred protocol, 5 mg until skin cleared up completely, then a slow taper, hopefully back to 2 mg. Dr provided me with what should be generous enough prescription refills. (PMR remains quiescent!)"
        },
        "piglette": {
            "tags": [
                "Arthritis",
                "Polymyalgia rheumatica",
                "Steroids"
            ],
            "demographics": {
                "joined": "2014-03-01",
                "age": "N/A",
                "gender": "Woman",
                "country": "N/A",
                "ethnicity": "Other ethnic group"
            },
            "bio": "Hi! I'm piglette"
        },
        "SnazzyD": {
            "tags": [
                "Fibromyalgia",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2017-03-21",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed with GCA in 2017 aged 54 out of the blue and was started on 60mg Pred. I was a nurse and manager of a cancer support centre, mum to two young adults with live-in elderly relative, I was fit and active . I had also got over breast cancer surgery, radio therapy and chemo in 2004.  Life as I knew it just stopped over 48 hours and I never made it back to work which broke my heart but I’m learning a different way. It’s been a long process of reassessing, healing and self discovery. Feb 2020 I was on 0.5mg. Came off Pred Aug 2020. The after effects are muscle loss and tendiopathy which is being worked on with specific exercises. I also have lifelong cyclical neutropaenia (not connected to GCA or PMR) meaning my neutrophil count drops every three weeks possibly also autoimmune but they don’t know.  \nI have been off Pred since Aug 2020 and my recovery has continued rather than ending with the Pred. My energy and adrenal function were slow to return and a few times I had to take a rescue dose of Pred for adrenal crisis. During this time however, I had Covid 8 times. I came off Pred during long Covid the first time. The 4th time July 2022 took 7 months of feeling really low physically for 7 months. None of these caused a flare of GCA. It has taken until April 2023 to feel like my muscles have started to repair after Pred for 3.5 years. This was a depressing surprise that muscle resilience didn’t bounce back and that it is a long term project. Unrealistic expectations from medical messaging didn’t help."
        },
        "Blearyeyed": {
            "tags": [
                "Pain",
                "Physiotherapy",
                "Paracetamol",
                "Tramadol",
                "Gabapentin",
                "Hydrotherapy",
                "Cetirizine",
                "Cyclizine",
                "Musculoskeletal manipulations",
                "Indomethacin",
                "Midodrine",
                "Fibromyalgia",
                "Amitriptyline",
                "Pregabalin",
                "Cognitive behavioural therapy (CBT)",
                "Irritable bowel syndrome (IBS)",
                "Buscopan",
                "Lactulose",
                "Turmeric extract",
                "Migraine",
                "Tachycardia",
                "Propranolol",
                "Sumatriptan",
                "Ivabradine",
                "Trigeminal neuralgia",
                "Magnesium",
                "Uveitis",
                "Prednisone",
                "Fluorometholone",
                "VitA-POS eye",
                "Skin or nail infections",
                "Fucidin cream",
                "Ehlers-Danlos syndromes",
                "Naproxen",
                "Occupational therapy",
                "Vitamin K2",
                "Collagen",
                "Postural Orthostatic Tachycardia Syndrome (PoTS)",
                "Chronic migraine",
                "Men's health",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2018-04-20",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Years of struggle for a diagnosis for all of my symptoms and flare ups meant I didn't have a full picture of my chronic health issues until my 50th year.\nI am now trying to walk the medical minefield of discovering how to get the best treatment I can for the varied and uncommon conditions I have while coping with the lack of knowledge in the Healthcare System for my conditions.\nTwenty five years on from my conditions impacting on daily life .... Time is ticking ,  I have now been diagnosed with Ehlers Danlos Syndrome (Classic Like), Chronic Dysautonomia (in the form of SNRT and POTs ) , Tachycardia, Atrial Fibrillation, Recurrent cardiac and cerebral vasospasms have decided to develop off the back of this Autonomic Dysfunction , Fibromyalgia, IBS -C and gastrointestinal dysmotility, Functional Vitamin B12 Deficiency Anaemia and Folate Deficiency with Neurological complications came next  which provoked checks and diagnosis of Pancreatic Enzyme Insufficiency and Familial HyperCholesteroleimia, Chronic Pain , Fatigue , Full Chronic Migraine Spectrum and Cluster Headaches and Eye issues along with a syndrome for every letter of the alphabet triggered by the above ( if you will let me have queasy for Q) and as an artist I cannot afford to be Blearyeyed.\n\nOpen for all the advice and support I can get , and willing to give any help I can to fellow sufferers on the long and stressful road to diagnosis and coping with getting the best out of each day with the ,\"New Normal\" of Chronic illness.\nGood luck to all and let's laugh , cry and work together for a better way to good health. Love Auntie Bee"
        },
        "MrsNails": {
            "tags": [
                "Breast cancer",
                "Chemotherapy",
                "Zoledronic acid",
                "Angina",
                "Carmil XL",
                "Polymyalgia rheumatica",
                "Methotrexate",
                "Prednisolone",
                "Skin cancer",
                "Cardiovascular disease (CVD)",
                "High blood pressure (hypertension)",
                "Losartan",
                "Indapamide"
            ],
            "demographics": {
                "joined": "2020-05-29",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I’m MrsNails, previous long time Member, Ambassador & Moderator.\nLong Term PMR Sufferer, diagnosed February 2012 although l had symptoms since October 2011 following Shoulder Surgery. \n\nAm currently on 12.5mg  Prednisolone & 25mg Injected Methotrexate for PMR\n\nI lost 25lbs in weight in 5months in Lockdown 2020, almost at my Target Weight (3lbs to go) as Type Two Diabetes was threatening!.....\n\nI am now seeing the benefits of the increase in Methotrexate & am able to start reducing the Prednisolone (again)\n\nI developed Angina in January 2020 & have now had a Cardiac CT & take a Slow Release Mononitrate daily with a GTN Spray as required."
        },
        "jinasc": {
            "tags": [
                "Atrial fibrillation",
                "Dilzem",
                "Arrhythmia",
                "Amiodarone",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2012-09-03",
                "age": "86",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "GCA Feb 2007  Remission: Last.1mg on 31 Dec 2011- 2020 still  in remission and counting. \n\nFounder (1 of the 25) of PMR GCAuk. Ex-Chair and  founder (1 of 2) PMR&GCAuk North East Support."
        },
        "Longtimer": {
            "tags": [
                "Fibromyalgia",
                "Duloxetine",
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2017-10-06",
                "age": "N/A",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "White / Caucasian"
            },
            "bio": "I was diagnosed with Polymyalgia about the same week as my 60th birthday....2011\nRheumatologist said drop quickly using this chart, and you will be off steroids in two years...I battled to follow her way and changed to another Rheumatologist in same hospital, he was pretty much the same...in fact worse.  I now do things myself as regards lowering pred, and doctor prescribes for me.....I react quite badly to all meds....so it has been a struggle from the start....\nHave excellent Rheumatologist at long last.2021..(10 years)\nI have now had a Pet/CT (May 2021) scan showed no LVV or PM R inflammation.....was at 5 mg for the scan.  . Have gone back to 7 mg.....so now going to have cortisol blood test to see if adrenals are capable of working......still have severe fatigue....tingling feet, weakness in legs....balance problems.\nVery big struggle now at 7 mg, tried lowering to 6.5mg, no energy to even get out of chair....\nFirst cortisol reading was 92, so have adrenal suporession, have red steroid card and wear a bracelet stating adrenal pro blems, in case of collapse.  \nNow having second cortisol test to see if any change....\nSurprising results....reading now 166......so going in the right direction...very pleased with that....Will try lowering in a few weeks after Christmas....\nHad another cortisol test in late June, this time dropped to 124, no explanation for this.....\nD exa scan not good either....already know I have Osteoporosis, but spine reading 10 % worse........I\nNow lowering very slowly on 6 mg....."
        },
        "Constance13": {
            "tags": [
                "Rheumatoid arthritis",
                "Polymyalgia rheumatica",
                "fitness"
            ],
            "demographics": {
                "joined": "2014-11-19",
                "age": "85",
                "gender": "Female",
                "country": "Germany",
                "ethnicity": "N/A"
            },
            "bio": "Constance.   28.07.1939\nI have lived in Germany for 48 years.\nIn 2012 I suddenly became very stiff, unusual pains, difficulty in walking, couldn't climb stairs, etc.  Then one day I couldn't move my arms up to comb my hair.  Time for a doctor, I thought!\nDr said \"I know what it is but we must wait for blood test results\".  (ESR 87, CRP 35). Diagnosis Polymyalgia Rheumatica.  I laughed - never heard of it!  Was given Pred (30mg) - all pain gone within six hours.  Wow (I thought) if you have to have an illness this is the one - one tablet and all pain and discomfort gone!  Didn't think that for long!!!\nOver the next few months ESR & CRP kept rising and rising.  Eventually rose to ESR 132, CRP 100.  Nobody knew what was happening - I was still on Pred.  I eventually collapsed and was hospitalised for 12 days.\nAll this was 7 years ago.  Ups and downs since then.  Now on 4mg.  PMR has been very aggressive.  Recently told I would probably have to stay on Pred for life.\nAge has caught up on me -  Seronegative Polyarthritis , Gout, GERD - among other things.  \nLife is good though, pain and discomfort manageable.  Easy to deal with this pesky illness because of all the help I have received from HU.  This is a wonderful forum.\nxxxxxx"
        },
        "Yellowbluebell": {
            "tags": [
                "Ankylosing spondylitis",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2018-09-13",
                "age": "61",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I am a 58 year old wife, mum and nanny.  I have 2 grown up and married girls  and an 9 year old grandson and a one year old granddaughter.   \nI gave up work as a barrister in 2010 to look after  my husband who broke his back as a fireman.   My first love has always been mental health law and I took a break from the courts and became the head of a NHS legal team for a mental health trust for 7 years but returned  to being a barrister specialising in mental health cases.  I have returned to working  a few days a week but I choose his much I do.\n\nI was diagnosed with pmr in oct 2018 after probably suffering from it for 2 years at least.  I only started tapering in late feb but being allowed by rheumy and gp to do it at my own pace.  \n\nI have been making and selling quilts since giving up work and although I now  seem to work more than before I  still enjoy quilting even when tired!!"
        },
        "tangocharlie": {
            "tags": [
                "Osteoporosis",
                "Polymyalgia rheumatica",
                "Methotrexate",
                "Prednisolone",
                "Hydroxychloroquine",
                "Leflunomide",
                "Depo-Medrol",
                "healthyeating",
                "weightloss"
            ],
            "demographics": {
                "joined": "2015-04-26",
                "age": "64",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Live in Leeds, England.  Diagnosed PMR in 2012 at age of 51 but probably had it at least a year before that.  Recently added spinal fractures to my list of woes which they are saying is due to steroids, but I'm not convinced. It's been a bumpy PMR journey and I've had a few setbacks such as rheumatologists saying I was too young to have PMR, which is when luckily I found this forum as he was so wrong.  Still have it in 2025, 13+ years later which is another debunk of the 'it burns itself out in 2 years myth' doctors trot out.  As well as being on a high dose of steroids I'm now trialling Hydroxychloraquine whch seems to be helping. Before that tried Methotrexate injections which I reacted badly to, Leflunomide which was ineffective and also Sulfasalazine. Had depo-medrone steroid injections as an alternative to Pred for a few years with mixed success (probably) due to inexperienced rheumatologist.  Also had adrenal problems several times.  Used to volunteer on PMRGCAuk Helpline and still help run PMRGCAuk's Yorkshire support group.  My personal mission having had such a hard time is to improve our care and treatment and support others with PMR/LVV/GCA and now also want ot spread the word about lookingafter your bones before it's too late"
        },
        "Telian": {
            "tags": [
                "Breast cancer",
                "Radiotherapy",
                "Oral chemotherapy",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2017-10-21",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "74 year old female diagnosed with GCA in March 2014 via positive ultrasound, had negative TAB. Breast cancer in August 2014 and PMR in November 2016.\nTapered slowly throughout due to withdrawal symptoms from first taper.   Got down to 3mg in September 2018 and couldn’t get lower.  Went through adrenal recovery for 8 months - not nice.   Following big house move and husband seriously ill had a flare December 2019 -  increased pred to 10mg then 15mg then 20mg.   After 6 weeks tapered to 15mg then 10mg with minimal withdrawals- now stuck on 8mg. Adrenal resurgence seems to be on the verge again. September 2021, managed to get to 7.5mg Adrenals making  a comeback with vengeance.  Adrenal symptoms lasted 8 months again.  Rheumie says it’s possible can happen earlier 2nd time around! March 2023 and nearly at 6.5mg."
        },
        "Kendrew": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Propranolol",
                "Alendronic acid",
                "Atorvastatin",
                "Calcium / Vitamin D3",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2020-07-05",
                "age": "67",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was a 61yr old woman when diagnosed in MAY 2019. Started my working life as a nurse at 'Jimmys' in Leeds. Later, I did my B.Ed in special needs at Hull  and have spent the rest of my life working in the Early Years Foundation Stage of education. \nI've felt pretty much alone in muddling my way through this condition up to press and have been very unwell from side effects of steroids more than the actual condition.  I started off on 40mg prednisolone and I'm now down to 2.5mg. God willing, I'll be off the steroids by the end of the year. Having been off work for 15mths, I'm now hoping to return to my job as a nursery teaching assistant in Sept. It's been an incredibly scary journey but somehow I've found ways to get through the worst days and the awful symptoms & side effects of the steroids,  and discovered strategies that have helped me. If I can help anyone by sharing this information,  I'd be very glad to.\nOCT 2020- How naive was I?? Since writing the above paragraph I've definitely re-educated myself about this condition....with a little....no actually,  a lot!.....of help from more informed people on here! Biggest lessons learned....PMR usually 'active' much longer than you're told or want to believe. It's not a race to get off pred as quickly as possible...and respect both the condition and the medication because patience is the key! I'm currently back up to 7.5mg and doing things much more slowly!! I'm also back at work, in school and I'm being VERY careful to pace myself, but not always easy to judge it correctly,  so had a few blips....but so far, so good. Hope this alerts 'newbies' to be aware of some of the inaccurate advice medical professionals may give you!\nNOV 2020:- I've had a whole half term back in school with my 26 nursery class children,  and how joyful and therapeutic it's been. However,  the flipside of this is that the increase in physical activity has meant an increase in my steroid dose. What began as 2.5mg in Sep has now increased to 12.5mgt now! It was inevitable and expected but a 2nd lockdown has resulted in me being told to stay home for 4wks! Another knock back, but hey ho.....what doesn't kill you, makes you stronger!\nAPRIL 2021- Still not back at work. Currently on 10mg pred. Initially I was 'staying safe' as higher dose of steroids put me back into immuno-compromised category..... the higher dose also then made me feel unwell again, causing head pain, fatigue and the other usual suspects! \nI'm about to begin a 3rd and final attempt to return to work at the end of May but I do have concerns and reservations as I don't want to lose all the improvements in my health that have been gained only because I've not been working!!\nWatch this space!\nMAY 2021- With a very heavy heart, I've had to make the most difficult decision to give up working and I'm applying for medical retirement.  I simply can't work and stay well. Feel so sad but know it's for the best.\nOCT 2021- I'm now officially medically retired as of 2wks ago. I've had my 'goodbye assembly' at school and was incredibly emotional. The Head, the children and the parents, all said such kind things. \nI'm slowly beginning to adjust to life at home and feeling more positive and motivated to explore what the next chapter of my life may have in store for me! I'm able to focus completely on my own health & well-being now and I'm already feeling some benefits. It's been a challenging transition for me to manage but I'm looking forward to 'covid-safer' times when I'll be able to go into nursery again as a regular volunteer helper. There's much to look forward to as a new door opens. \nAPRIL 2022- Well, covid is still ever present and affecting many of the choices I make regarding where I go and who I see. Sadly, I've not felt it safe enough to go into school yet, particularly as covid just seems to be repeatedly infecting my colleagues over & over again! I'm definitely feeling more settled though with regard to being medically retired, and much more accepting of the situation now that I'm realising what a positive impact its having on my health.....knowing I can now choose what my day will entail based on how I'm feeling has removed all the pressure and stress that a demanding job working with a Nursery class of 24 under 5's can produce. If I'm awake all night (as often happens) I no longer fret about needing to get to sleep because I've to be up at 6.30am for work. If I have a bad day when I'm feeling particularly fatigued, achey or just generally unwell, I can rest for as long as necessary and not be anxious about having to ring in sick!!\nJust knowing I can now focus completely on my own health & well-being has facilitated a definite improvement on both my physical well-being and my mental well-being.  Don't misunderstand me....I still experience challenging days but now I have the time to manage them more effectively and make better choices.\nBack in Jan, I developed a severe case of Urticaria....an unpleasant itchy skin rash that manifested with raised, angry patches of hives all over my arms, chest, trunk, thighs & legs. It appeared completely out of the blue and my new (and very knowledgeable & sympathetic) GP explained that this happens as a result of an allergic reaction to something...I've yet to discover what!! To my complete horror,  I was advised to increase my steroids from the 6mg I was currently on up to 30mg!.... the antihistamines alone weren't improving things. However  within 3wks I was back down at 6mg and together with 2 types of high strength prescription antihistamines the rash began to diminish.  It took at least 6wks for my skin to fully recover and now I make sure I pay as much attention to my skin-health as my overall health. \nI'm about to taper from 5½mg of pred to 5mg in the next week and at the moment  my health is fairly stable and constant. I truly believe this is down to not working anymore, having hugely reduced stress levels and directing my focus onto 'looking after me'!!\nMAY 2022 - Today is 11th May and after a long 3yrs I've finally made it into school again! With no covid infections currently evident and a lovely Nursery garden for outdoor teaching I decided there would not be a better time to make a return to the Nursery class that's been such a big part of my life for the best part of 15yrs! I did not return as a teacher though....I returned as a volunteer helper! It was so joyful and upifting. I felt I was exactly where I was meant to be. .....and the best part was that I had none of those pressures, responsibilities or stressors that would normally accompany my job. The children were such good therapy  and I truly loved and embraced getting to know them all. How privileged, lucky and blessed am I to have had today!\nI definitely intend to go in every week when possible and although I'm definitely tired now, I feel as long as I have a few days afterwards to rest and chill, there's no reason why I can't volunteer again. \nPMR can sometimes feel cruel...even brutal at times but today has been another little triumph and re-affirmed my belief that many good things are still possible ....you just have to trust in the process.\nWatch this space to see how I get on!\nJuly 2022 - Well, I made it into school for 4wks before 2 of the Nursery staff tested positive for covid...again!! This meant I had to temporarily refrain from going in till all clear, but with the summer break upon us, this won't  be till Sept now. \nI've had a wonderful holiday in Devon and I'm now beginning my next taper from 5mg down to 4.5mg. (I've been stable on 5mg for approx 7wks.)\nDec 22 - My health has had a few minor 'glitches' which fortunately have been resolved fairly easily and I'm now on 4mg of prednisolone and feeling pretty good most of the time. \nApproximately 6wks ago though I had another covid booster.  It was the Pfizer 'combo' one and although I suffered no obvious, immediate adverse affects (as I had with my previous Moderna one) I noticed that over the following 2wks my palpitations were beginning to re-emerge.  I have always had a history of ectopic beats which although uncomfortable & alarming at times, are actually harmless.  A beta blocker (propranolol) brought them back under control after the steroids seemed to trigger them off again and up till this most recent booster, everything had been ok. They gradually became worse and this time made me feel more unwell.... breathless on exertion and more  fatigue than usual.  Blood tests ruled out anaemia, diabetes and thyroid as possible causes and also heart failure. \nThey have significantly improved but I'm still seeing my cardiologist to rule out anything else.\nOn a more positive note...I'm now going into nursery class every week as a volunteer helper and it's bringing me such joy.\nMARCH 2023.\nJust had my 6monthly rheumatology appointment with Dr. Fiona Coath and all is good. My blood tests are ALL within normal parameters for the second time in a row and she's happy with my tapering regime. All the hard work ensuring I have a healthy diet and regular (appropriate) exercise seems to be paying off. \nI've missed approximately 4wks of helping out in nursery class again, as covid and flu are sweeping through the school. Hope to be back after Easter now.\nI'm currently on 3½mgs and about to start next ½mg taper from 3½mgs to 3mgs. Fingers crossed."
        },
        "123-go": {
            "tags": [
                "Vasculitis"
            ],
            "demographics": {
                "joined": "2020-06-09",
                "age": "81",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed in February 2018 with Polymyalgia Rheumatica. My symptoms reduced dramatically two or three days after I began an initial dose of 15mg Prednisolone with gradual tapering. After a relapse in December 2018 my dose returned to 15mg. gradually  tapering until November 2019 when I developed double vision. This was corrected with a fresnel prism fitted to my glasses and again a return to 15mg. The double vision has improved and I'm currently taking 5mg Pred but regular clinic checks/consultations have been postponed due to the current pandemic.\n\nNow April 2021 and I'm on 2.5mg Pred  plus 10mg Leflunomide after being diagnosed with asymptomatic large vessel vasculitis ( aortitis). There was a blip at this time when I was seen by a rheumatology research fellow whose management plan stated I should move on from 2.5mg pred daily to 2.5mg on alternate days for one month then 2.5mg every third day. I wrote to the department expressing my concern at this plan and it was changed to a rather more acceptable plan of 2mg daily for one month then 2mg and 1mg (alternate days)/for a further month when the tapering plan became 2mg/1mg/1mg on a three day cycle. \n\nAt my review in April’22 with a locum rheumatologist his answer to my reporting tingling and numbness in toes was to diagnose “widespread osteoarthritis including osteoarthritis of hand, feet and knee”. He said I “may feel better by proper shoes and shoe support  with a referral to a podiatrist for biochemical support” if need be. All this was by looking at my hands and feet. He said my PMR had “gone” and I should stop taking Prednisolone. I was appalled but I didn’t waste my breath in any discussion: however,  I couldn’t leave without telling someone about this experience and followed that up with a letter to the specialist nurse and eventually another review with a competent rheumatologist who continued with pred tapering and disregarded ‘‘widespread osteoarthritis “. I continue to walk several times a week for an hour+ each time and garden, knit, sew, and occasional craft work with no pain in feet, knees or hands. \n\nHow time flies! It is now October 2023 and after a fairly uneventful 2+ years I am tapering very slowly to 0.5mg prednisolone daily. I have to admit that I’m a little uneasy about taking the final step to zero and ‘letting go’ of my friend prednisolone.  \nThe aortitis was followed up with a second PET-CT in January this year which showed there had been no increase in any aortic dilation and a subsequent echocardiogram showed the aortic root was of normal size and the arch and ascending aorta appear to have normal dimensions.\nI was therefore considered to be ‘stable’. 😂😂 and continue with 10mg Leflunomide daily.\n\nMarch 2024. After 6 years on Prednisolone I have tapered to zero. I took my last 0.5mg at the end of January but will remain on 10mg Leflunomide daily for ‘a while’."
        },
        "Jackoh": {
            "tags": [
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2014-11-12",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Started with symptoms of aching arms , unable to fasten bra and difficulty turning head to drive. This suddenly developed to flu type symptoms,  feeling exhausted and very unwell after a short walk.  Doctor diagnosed PMR and did blood tests. These were quite unremarkable- ESR 18 CRP -1 As ESR though slightly above average was started on 15 mg of steroids. Wonderful result with no problems tapering until 11 mg. Felt exhausted on 11 mg and when trying to taper to 10mg - a lot of pain so tried 10 and a half. Pain gradually got worse and went up to 14 mg. At 14 mg caught a bad cold and GCA symptoms ( boring type pains of a hot rod  in side of head) started. GP stated that I hadn’t got GCA but went up to 21 mg before these pains subsided. Saw Dr Hughes privately who diagnosed cranial\nGCA. Have had a real problem reducing , Dr Hughes introduced lefludomide but this did not seem to help tapering. After peripheral neuropathy in legs ( 2019 ) I stopped lefludomide and started reducing without. At present (2020) trying to reduce from 11 and a half to 11 mg ( second time) Now in August 2023 I have been reducing very very slowly and at present am doing a very very slow reduction from 6.5 to 6.0. I have not been taking any steroid sparers."
        },
        "Pixix": {
            "tags": [
                "Fibromyalgia",
                "Gabapentin",
                "Amitriptyline",
                "Arthritis",
                "Steroid injections",
                "Osteoarthritis",
                "Pain Killer",
                "Sciatica",
                "Bursitis",
                "Joint hypermobility syndrome",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Raynaud's phenomenon",
                "Essential tremor",
                "Tramadol",
                "Weight loss"
            ],
            "demographics": {
                "joined": "2019-10-23",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed December 2019, & now still tapering! I was diagnosed one week later with prediabetes. Already suffer from fibromyalgia, 15 years. Have some residual car crash injuries as well. Have lung weakness, prone to chest infections & am allergic to a lot of things. My Prediabetes was steroid induced & now reversed through keto diet. Osteoarthritis has worsened, and spread to toes, thumbs, hands! In the latest year or so I’ve added Raynaud’s phenomenon, Essential Tremor, Sciatica, Trochanteric Bursitis, Vertigo & Hypermobility to my little ‘collection’!"
        },
        "Bcol": {
            "tags": [
                "Osteoarthritis",
                "Physiotherapy",
                "Co-codamol",
                "total knee replacement",
                "Steroid injections",
                "Arthroscopy",
                "Joint fusion",
                "Sciatica",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Omeprazole",
                "Carpal tunnel syndrome",
                "Steroids"
            ],
            "demographics": {
                "joined": "2020-07-04",
                "age": "75",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi There. Osteoarthritis in the 1980's which became really bad in both knees in the 90’s when I really struggled with work, I was a teacher and, on my feet, pretty much all day and at times found it extremely hard just getting joints to work even to get out of bed. As I was relatively young, I had a real struggle to get the NHS to even think about joint replacement, they weren't really interested unless you were in your 70's. Physio and tablets is all that was on offer initially.  Full replacement in 1999, brilliant. Ill health retirement in 2001. OA in knees, feet, and hands but relatively under control. PMR in June 2020, which was a bit of a poo, pain so bad I ended up at the walk (in my case carry) in centre for the night. The doc there missed it, thought it was an OA flare which did not make sense to me, but was feeling too befuddled to query it. My own doctors picked it up the following week. I had no idea what PMR was at that point. Started on 15mg/day, quickly moved to 30mg/day for 5 days, then 25mg/day for 5 days, 20mg/day for two weeks. Did lots of research, found this incredible site. Now starting long tapers. Half way through the taper from 7mg to 6mg (June 2021) and at the moment all going well – plenty of time for that to change of course. \nUpdate 11/08/2021\nCarpal Tunnel Syndrome deciding to be grumpy so chat with doc and Pred back up to 10mg, from 5mg, for three weeks, then usual (for me) 5 week (minimum) taper down again in hopes that it will bring it under control again without the need for surgery.\nUpdate 31/08/2022\nIn reality things are going well. Still using my modified DL .5mg five-week taper, longer if necessary. Had a query DVT in January, sent to hospital, had full check but nothing to worry about. I had an extremely painless right leg at the beginning of April 2022 where I had excruciating pain down my thigh, knee and shin. My shin felt like the shin bone was split down the middle with both halves rubbing against each other. Virtually unable to walk. PMR ruled out by myself and Doctor and referred onto an Orthopaedic specialist. Rested for about three weeks- no walks – No definitive result from the various doctors and pain etc eventually disappeared. Walking back to normal. Two funny instances with right leg this year and still, sometimes, it doesn’t seem to do, straight away, what my brain tells it to. We will see if anything else transpires.\nWent back to 5mg from 3.5mg end of May/June for two months and now in second week of 4.5mg to 4.0mg\nI keep a spreadsheet diary of medication taken and in stock, makes ordering easy, and record BP daily and weight and Blood Sugar levels weekly. I also note anything that is relevant – covid tests etc. I send a copy of the diary to the doc whenever I order Pred or Omeprazole. Not actually seen a doctor since the hospital incident but they are always there for telephone consultations which are usually the same or following day. She/he organises blood tests and a DEXA scan when requested and supplies the prescription for the Pred I tell her I need. Not sure any of that is, in reality right, but she is happy to leave me to it and it does make my life easy. She always tells me to ring at any time if necessary.\nManaging to walk the bowwows again and generally manage to get around 5 - 6 or so miles done most mornings, either flat or a bit hilly depending on how I and they feel.\nNo formal medical education other than paediatric first aider, indoors and outdoors for many years.\nLiving in the North West of England, Rochdale/Wardle area of Greater Manchester.\n\nUpdate 01/2023\nMRI scan showed significant problems with my lower back, hence the problems mentioned earlier with leg and back pain.\n\nThe scan shows he has sciatica with neuropathic pain and if the pain persists, please refer to Salford Royal\t\t\t\t\t\t\t\t                                                  MRI Spine Lumbar and Sacral:\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nL5-S1: The disc is severely dehydrated significant bulge or protrusion. The left half of the disc appears more narrowed than the rest. This results in moderate-severe left existing foramen stenosis.\tThe exiting left L5 nerve root is impaired. Both facet joints show moderate-severe osteoarthritis\t\t\t\t\t\t\t\t\t  \nL4-L5: Severe bilateral facet joint arthritis is noted associated with subtle degenerative spondylolistheses. The right lateral recess is moderately narrowed due to hypertrophic facets and mild disc bulge. This could cause some irritation of the transiting right LS nerve root.\t  \nL3-L4: The facet joints show moderate-severe osteoarthritis associated with some degree of marrow oedema. The disc shows a mild annular bulge. No convincing nerve impingement is evident.\t\t\t\t\t\t\t\t\t\t\t       \nL 1-L2 and L2-L3 disc levels appear satisfactory for age.\t\t\t\t\t   \nNo acute bony injury or concerning marrow pathology.\t\t\t\t\t  \nThe scan shows he has sciatica with neuropathic pain and if the pain persists, please refer to Salford Royal\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nUpdate 14/10/2024\n\nTapered slowly down and now been on zero Pred since the 1st September 2024 and so far all going well on the PMNR side. \n\nCTS is not so good and having significant problems with both wrists/fingers. Pain and lack of feeling in hands and fingertips makes completing certain day to day tasks difficult. Been on waiting list for surgery in both wrists since January 2024.\n\nThe back/leg problem only appears at times so fortunately I do not have to cope with it all the time.\n\nUpdate January 2025\nTook my last Pred in September 2024 and so far no problems regarding my PMR. still early days but it's looking hopeful that's it's gone for the time being. \nCTS is a different matter, still awaiting surgery and hands and wrists not in a good place regarding pain, which can go right up the arm, and the lack of feeling in fingers which can/does make doing things \"interesting\"."
        },
        "Grammy80": {
            "tags": [
                "Asthma",
                "Inhalers",
                "Lupus",
                "Medication monitoring",
                "Vasculitis",
                "Speech Therapy",
                "Epilepsy",
                "Prednisone",
                "Keppra",
                "Actemra",
                "Lung disease",
                "Breo Ellipta",
                "Parkinson's disease",
                "Carbidopa / Levodopa",
                "Kidney disease",
                "Polymyalgia rheumatica",
                "Cellulitis",
                "Diverticular disease and diverticulitis",
                "Antibiotics",
                "Temporal arteritis (giant cell arteritis)",
                "Steroids",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2019-12-14",
                "age": "84",
                "gender": "Woman",
                "country": "United States",
                "ethnicity": "White"
            },
            "bio": "I'm an 84-year-old gal who lives in Indiana, USA, with family in Indiana and Nova Scotia. I had lived alone in Maine for four years since 2016. In August 2019, I was diagnosed with GCA and left blind in my left eye. I was misdiagnosed initially, or that probably wouldn't have happened.\nIn 2020, I experienced a few flares that affected my right eye.  At that point, I had to decide and truly could not be by myself anymore.  At that time, I returned to Indiana and was sharing a home with my husband.  It has relieved me from all stress regarding driving to appointments to meet my most basic needs, like eating healthier and not being afraid of being alone and falling again.  He is happy to have the company. We have been married for 40+ years, and there have been a few separations.  He is 81, I am 84...we are a couple of OLD friends.  Here is to the future, whatever it may hold for however long~!!  I also have epilepsy and the steroids can water down seizure meds, seizure-free for 48 years.\nFebruary 16, 2023: I'm now down to 3.5 mg of prednisone and thrilled with that.  I'm beginning to think my adrenal glands are kicking in.  I have more energy, although I will have to work on strengthening it through the winter.  I've been pretty sedentary but I'm delighted to think my GCA may be quiet.   Shhhhhhh!     Onward and downward....slowly.\nI got down to 1 mg plus TCZ and then things flew apart.  I experienced a bowel perforation, escaped a colostomy, and then had quite a flare.  I'm presently taking 20 mg and hope to get back on my TCZ in a week.  My right eye is a bit blurry, but I'm hoping it is the excessive prednisone I was given when I had the flare: 500 mg IV for three days and then 60 mg tablets.  It is quite a ride.....but it will settle down, I'm sure when it is darn good and ready.\nWow, that bowel perforation was the fall of 2023...and until I reread my bio....I didn't recall how many times I flared and took 60mg.  The memory can be kind.\nJune 2024....I got to zero, not that -0- was a goal of mine, I just wanted quality of life.  After one month, at the end of July 2024, the headache started and got worse; though I could chew, the pain in the jaw joint was pretty intense, and I had shooting pains through my blind eye.  We went to the emergency room, and I received 500 mg IV of Prednisolone, but it was kept overnight.  The pain had lessened (A CLUE), but when the rheumy came in the AM, he sent me home with a script for 60mg per day, only to be taken if the pain came back. It was back with a vengeance in 36 hours.  I saw the rheumy two days later and he cut it to 5mg and wanted the neuro-ophthalmologist to see my eye on a dosage of less than 60mg so that nothing would be masked.  I saw him in two days and he immediately ordered 1250 mg IV infusions for the next three days.  I had lost some peripheral vision in my right eye.  After the infusions, I've been taking 60 mg a day...spacey.  I've seen both doctors since and am continuing on 60 mg per day.  Though the neuro has never, until the infusions, gotten involved in the dosage, he will now be determining that because he can see in, around, and behind my eye.  Now I have some nerve pain involvement, but it is tolerable. I just want to see what I can see, and I'll be happy.  \nJuly/August/September 2024   My tremors became more severe, I had balance issues..but I attributed everything to being on 60 mg per day.  Then I couldn't seem to walk correctly,  legs so stiff, numb, urinated beyond measure.....Finally, I felt strongly that this was something other than 60mg daily.  I'd been up and down the pred scale for five years.  My neuro-ophthalmologist told me to see a neurologist, and on 9/24/24, I was diagnosed with Parkinson's disease.  Now, I'm searching for information and help, doing all that is in my power."
        },
        "Celtic": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2012-03-16",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with both PMR and GCA in 2007 after PMR had remained undiagnosed for the previous year during which I spent 3-4 months unable to get out of bed except to attend hospital rheumatology appointments by ambulance and wheelchair.\nCommenced on 40mg Prednisolone and now (June 2012) almost at zero. \nSet up the PMRGCAuk Surrey Support Group in July 2011.\nHospitalised with severe mitral regurgitation in late 2018 due to leaking valve suddenly moving from long-term  slight leak to severe.  Medicated and discharged after 5 days.  \nSole kidney since teens suddenly deteriorated in 2007. at present stable chronic kidney disease with between 38-44% function."
        },
        "Koalajane": {
            "tags": [
                "Diabetes",
                "Gliclazide",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Diabetic retinopathy",
                "Eylea",
                "healthyeating",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2017-03-28",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with PMR in March 2017. Three months after I was diagnosed with type 2diabetes. By the following January my diabetes went into remission and has stayed that way. I am off medication for the diabetes and on a LCHF diet and walk over 10,000 steps each day. I am still on prednisolone. I have also been diagnosed with macular oedema and have Lucentis injections every 6 weeks at the moment. My opthamologist tells me it is because I don’t control my sugars although my last hba1c was 35! I am not sure what else I can do other than try and drop my steroids as much as is possible. I am now on Eylea injections every 2 months and I am waiting to have laser treatment which I am told will mean I do not need so many injections,\nMy current dose of pred is 8.5mg, I got to 4mg and flared so went up and trying to go back down again. I tried taking my pred at 2 a.m. but it was detrimental to my diabetes. \nI am now on 6mg of prednisolone reducing slowly by .25mg each month"
        },
        "cycli": {
            "tags": [
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)",
                "healthyeating",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2021-07-29",
                "age": "N/A",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Conclusions up to the present. \nI think I am getting a handle on these two conditions and when it all started. These latter chronic symptoms have been present for nearly three years. Neck and shoulder stiffness, muscle contraction  numbness in feet, legs and joints and bad headaches mainly from the temples and across the top of the head. Up until recently I have managed them through a combination of aggressive cycling, general manual work on the farm, osteopath, sport massage and some pills. Conditions like broken bones, DVT, and PE in both lungs had to be medically treated. The earlier signs of cramping and badly contracted muscle and neck stiffness go back some ten years. The osteopath and masseuse were always perplexed at how tight my muscles seemed to be, so much so it slightly pulled my spine out of its proper alignment.\nIn September 2017 I had an horrific crash which left me with broken bones, some skin loss and a seriously broken body. Something like Chris Froomes’ crash but with head injuries. It would have been nice to have the medical help Ineos provided him, but us ordinary mortals just have to struggle by ourselves. Nothing I could have done to prevent it. Brazing on the front forks dropout failed and the front wheel separated from the bike at 35mph downhill. Instant black out and no memory of the impact thank goodness. Lucky to be alive as I was  cycling with a good buddy who called for help. A lesson for all of you lone cyclists. You never know when something might happen. By the way the Kask helmet was flattened on the impact side. I wouldn’t be writing this otherwise. Anything between your head and the ground is preferable to a smashed skull. A note to Chris. Boardman, helmets are essential. The head injury alone, long term concussion and damage to hearing, tinnitus, loss of balance and frightful headaches went on for the best part of a year. Any jarring motion made my brain hurt inside the skull, almost like it was swollen. It hurt to shout, sneeze or cough let alone shake it. My other physical injuries healed quickly as normal. Believe it or not I was back on the bike after 4 weeks but after a while the head pain and balance issues made me reconsider, opting for a few months recovery. I had two MRI head scans a year apart and they showed no bleeding or damage apart from age related deterioration. That was a relief. A recent scan has also come up clear apart from a small bleed which they indicate may have been a mild stroke undetected. I am due a full body MRI scan soon and hope that shows all clear. I suspect residual damage from the accident and want to check. Have had scan. All okay.\nIt took two years to get back to my level of cycling and fitness sufficient to ride for 6 continuous days from Pisa to Verona across the Dolomites in September 2019.  I averaged 13mph over 550 miles with 55,000ft of ascent. Now I can barely manage 10miles on the flat. What I think happened is that I focused on recovery and managed any side issues passing them off as the result of hard training and recovery. After the Dolomite ride I was seriously tired and in need of rest. I was down to 68kg and looking rather starved. I looked like death warmed up you could say, not a good picture.  It’s quite possible that I overdid the effort and weakened my body’s natural immunity. In March 2020 I stayed at a friends’ villa in Almeria, SE Spain, on my own and cycled through the mountains. I caught the last flight back in this pandemic on 16th March. I suspect I may have contracted Covid but showed no symptoms. If so the virus could have kicked off all the background conditions I had been ignoring as cycling aches and pains. If not that virus maybe another. \nIs it possible these two conditions could have triggered the PE? Is it possible the serious hit to my head could have skewed the chemical balance in the brain and triggered the release of the PMR and GCA? This is speculation, but unless I can work out how it started I could be on these drugs for ever. Basically I seriously overdid the strain on my body and drained my last resource of resistance making me prone to anything waiting to pounce.\nI started to get serious symptoms which were passed to specialists to diagnose. Everything muscular and internal seemed to be going wrong and no clear explanation as to why. It built to the recent time when my body basically was closing down. Like I said earlier, I was reduced to a foetal position out of bright light in order to get any release from the symptoms. That’s then to now and with the diagnosis I seem to be getting my body back. Nearly all the things going wrong are going right save for the residual symptoms which haven’t been fully suppressed. The leg muscles are almost functioning properly. I’m sure the strength is still there but they tire very quickly. Hopefully we’ll get there soon. Calves quite good. Glutes hurt worst but get better with use. Hams next but again recover well. Quads are next worst but improve. Worst are hip flexors. They are not used to striding. They need extra work. All improve as the drugs effect works for longer each day. It seems that the perfect balance is when there is just enough drug to last a full day suppressing the conditions whilst being fully used up just before the next days’ dose. Six weeks into treatment and I can confirm that nearly everything is working better.\t\n I’ve decided to save my money on massage and correction as the effects  are largely a consequence of the contracted muscle caused by PMR. Until the Prednisolone takes full control of the condition 24/7 there is no point in the palliative effect of massage relieving the pain. It only masks the recovery of proper function of the muscle. This is quite a relief because it now explains why whatever correction and massage I used always reverted in a few months to the need for more. I need to fully understand how this disease works at the neuromuscular level and how it interferes with the proper firing of nerve synapses to relieve the contraction. When the Prednisolone finally suppresses the disease it won’t be a cure. Without knowing the cause I will have to work to reduce the dose and work out an exercise regimen to regain my fitness. Only then can I determine to what level I can return.\n Despite everything I’ve endured it has been a blessing in a perverse sort of way. I have known for years my body is not working as it should. Whatever I did I couldn’t get a handle on what was wrong. I was hoping for a miracle drug that would put it all right. Now I know what’s happened, the drug is no miracle, only something trying to stop my body going wrong. It’s actually given me a real understanding and a massive challenge to try and get back to an even fitter and better physical condition. It’s going to be an interesting period probably over a couple of years to regain even my old top level if that’s possible. This diagnosis has given me something to aim for with hope. In trying to understand how I feel both physically and mentally I am more alive today than I have been in decades. \nMaybe it’s the relief from pain, or the belief that this unpleasant and worrying phase is under control. I genuinely feel better than I have ever felt for more years than I can reckon. After six weeks on the drug it’s almost fully suppressed the two conditions. My body is working better than it has in all areas, apart from stamina and being able to work all day not tiring. It may be a false euphoria caused by relief so I shouldn’t expect too much, but it is good to feel that there is real hope of a full recovery. The sad irony is this same drug that has saved my body destroyed my fathers from his condition 40 years ago. How times change with knowledge and insight. Someone of religious bent might be giving thanks to God. I cannot claim such blind faith. It seems like a miracle, but it is all down to observation, knowledge, understanding and sheer dogged determination to not let it win. I have been given a second chance to enjoy my health and fulfil the next however many years productively. A new start with a body that is working properly. What a gift at 70.     \n \n So, that’s it.         I have put this out there for consideration. \nI hope it may help someone who is in pain, depressed and confused not knowing why everything is going wrong and not being able to put a finger on the cause or the solution.   \n Hopefully you won’t have this, but if you do I hope this helps. \n    \nOver and out.   Happy cycling.  Good luck."
        },
        "scats": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2016-06-26",
                "age": "N/A",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed PMR Jan 2016, pains for some months before. Runs in the family, my father and brother both have it before me.\nI started on 15mg prednisolone and have had numerous flares over the years, taking 5 years to get below 10mg .\nCurrently taking 6 mg although I have reached 4.75 . I find 5 to 6mg necessary to maintain any quality of life. The last rheumatologist I saw was willing to support me at this level but I seldom see the same one twice and they all have different opinions"
        },
        "powerwalk": {
            "tags": [
                "Osteoporosis"
            ],
            "demographics": {
                "joined": "2017-09-05",
                "age": "N/A",
                "gender": "Female",
                "country": "Ireland",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed PMR April/May 2016"
        },
            "Rugger": {
            "tags": [
                "Osteoporosis",
                "Risedronate",
                "Atrial fibrillation",
                "Bisoprolol",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Temporal arteritis (giant cell arteritis)",
                "Methotrexate",
                "Tocilizumab",
                "healthyeating"
            ],
            "demographics": {
                "joined": "2016-12-14",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with PMR in May 2016, but in hindsight had symptoms that I couldn't make sense of for 6 months before that. The PMR 'relapsed' / flared over 3+ years, every time I reduced the prednisolone, however slow the taper. My CRP and ESR have always reflected periods of inflammation (See graphs in my posts). By November 2019 I felt the PMR might be in remission and I was symptom-free on 4mg, but the blood results were higher than ever. A PET-CT scan showed GCA-LVV, with aortitis and other large vessels involved. An increase in pred dealt with the inflammation, but my Rheumatologist predicted more relapses in future and I started on Tocilizumab in March 2020, just 10 days before the first Covid-19 'lockdown'! The TCZ seemed to tackle the inflammation, as I had more energy than at any  time in the previous 4 years. I was able to create a vegetable garden during 2020 & 2021, which would have been unheard of with PMR. During the pandemic I was given an extension of the NHS 52 week ration of TCZ, but this came to an end in March 2022. Even with TCZ I had a flare of the LVV and stayed on 5mg pred for almost 8 months in 2021, before starting to taper again. I reached 'Club Zero' for pred in April 2022!\nI was about to 'celebrate' a possible remission of the PMR & GCA-LVV, but my Rheumatologist feared the GCA-LVV could flare if I were to be on no medication, judging by the amount of inflammation seen on my PET-CT scan in November 2019, so I started Methotrexate in May 2022. She intended to keep me on MTX for a year or so - if it suited me, but I didn't feel as well on MTX as I did on TCZ, my CRP and ESR started to rise again and aches and pains returned. After 8 months on MTX, in January 2023 I went back on 5mg pred and the MTX was discontinued. Throughout 2023 and 2024 I tapered down very gradually, and up again, but get stuck around 3mg, so that's where I'll stay at the start of 2025 - in my 9th year since diagnosis.\nMy other hobby, apart from gardening,  is rag rug-making, hence my alias \"Rugger\"!  My avatar is a circular braided rug about 3 feet in diameter. Contrary to what some people have thought, I'm female and not a rugby player or fan! I live in West Yorkshire, UK and am retired from working in the NHS.\nIn 2017 I helped set up the Yorkshire support group of PMRGCAuk and continue as one of the present Group Organisers."
        },
        "Nextoneplease": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Temporal arteritis (giant cell arteritis)",
                "Ageing well",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2016-10-29",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi, I am based in the UK. I was diagnosed with PMR in March 2021, and  GCA in June of the same year. Started on 15mg of pred by GP, raised to 40mg by rheumatologist, and now (May 2023) down to 6.5mg a day. My most troubling symptoms currently (now that  pred is managing most of the pain), are muscle weakness and fatigue.\n\nI am retired - I worked as a probation officer, social worker and adult education tutor. I loved working and only retired at 64 to look after my mum who had vascular dementia. She passed away in November 2019 and very soon after that, of course, we were all hit by the COVID pandemic. \n\nMy life currently centres around my family (husband, daughters, grandchildren) and friends. Social life gradually expanding again😊 I manage a bit of cooking and gardening but am finding everyday tasks increasingly difficult.\n\nOther conditions include myasthenia gravis, osteoarthritis, osteoporosis, atrial fibrillation, high blood pressure, macular degeneration, knee replacement complicated by sceptic arthritis and bacterial endocarditis - and two open heart surgeries for mitral and tricuspid valve repair. Thank goodness for the NHS!\n\nUpdate May 2023. Currently on 6.5mg prednisone daily. Have had a DEXA scan and after 10 years of denosumab injections, now only have osteopenia rather than osteoporosis. Shoulder and wrist x rays have shown severe osteoarthritis and I’ve been referred to an orthopaedic surgeon for advice. Also, my optician feels that my previously early stage macular degeneration and glaucoma have got worse, such that she’s had no alternative but to refer me to the eye hospital. Watch this space….!"
        },
        "Rose54": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Medication monitoring",
                "Heart attack",
                "Parkinson's disease",
                "Polymyalgia rheumatica",
                "Steroids"
            ],
            "demographics": {
                "joined": "2015-09-04",
                "age": "N/A",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "In UK \nDiagnosed or should say self diagnosed in Aug 15 with PMR after months or year going to and from GP informed I had CFS .\nI have a underactive thyroid although I have had this for about 15 years \nUpdate Jan 17 down to 9.5 feeling well working full time \nReducing .5 at a time listening to how my body feels and enjoying life  \nUpdate Dec 17 flare in May 17 increased to 15 now going from 9 to 8.5 reduced hours at work but all ok March 18 flare so from8 to 10\n2022 may got down to 7mg had to increase to 15mh  come July 2022 present July 22 feeling not much better but trying to stay positive. \nNov 2024 recovering from hip op in July new things weren’t right .But was on waiting list to see Nerologist was told a year wait\nSymptoms \nTremors \nSlow walk\nBalance issues"
        },
        "Soraya_PMR": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-10-23",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "PMR diagnosis. Prednisolone 20mg started April 2017, now down to 12.5mg, but even this reduction has been a bit up and down.\nGP very reluctant to diagnose PMR  due to “normal” CRP (1) and ESR (11), despite a magnificent response to steroids within 4 hours. GP referred to rheumatologist due to my age (57) and normal bloods, which I think was entirely appropriate. Rheum has confirmed PMR and has taken over my care. Her reduction schedule has not been achievable, but she did say I might not achieve it . I’ll see her again Dec 2017.\nAA was pushed by GP (I WILL get osteoporosis according to him!) It was RECOMMENDED by rheumie, but I have declined unless OP is proven; therefore had dexa scan this week, results PERFECT! AA discussion dropped!\n\nI live in Kent (England)\n\nUpdate March 2019, several scans later to rule out other causes, still with a diagnosis of PMR. Got stuck at 8mg last summer/autumn, great frowns from rheumi 😒 now through 7 to 6 and failed at 5, so trying 5.5 using the second half of DSNS."
        },
        "PMRCanada": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisone"
            ],
            "demographics": {
                "joined": "2018-06-18",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I'm a 62 year old woman from Tillsonburg, Ontario, Canada who was diagnosed with PMR in May/18 by my gp. Prior to diagnosis I suffered progressively worse pain and stiffness in my knees (I have pre-existing OA), and later my shoulders and hamstring and quads.  \n\nI was put on 20mg of Prednisone by my GP on May 1/18 and within 1 day I experienced great improvement of my presenting stiffness and pain, as well as my knee pain. I remained under the care of my wonderful GP.\n\nI got \"stuck\" on 9mg for about 20 months and Jan/22 started Methotrexate as a steroid sparer under the supervision of a new (good) rheumatologist. Fingers crossed as I am heading in the right direction and have been able to lower my dose in .5mg increments. I am currently tapering down to 5 mg. \n\nI am learning that I do not have control of what is happening in my body physically, but I can control what I eat, how much I exercise, when I rest. who I share with and ask for support from.  This is not the retirement I worked hard to earn, and I miss all those things I was previously able to do without much effort and enjoyed.  I will say I am still able to walk, swim, garden and golf (with a cart. I even manage dancing time to time. \n\nIn an effort to connect further with other folks who have PMR/GCA, I've created an online support group with 3 others from Ontario which meets monthly via Zoom, and provides valuable connection with others who \"get it\".\n\nLeslie"
        },
        "GOOD_GRIEF": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-05-30",
                "age": "69",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm GOOD_GRIEF"
        },
        "Marijo1951": {
            "tags": [
                "Polymyalgia rheumatica",
                "Methotrexate",
                "Prednisolone",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2017-08-01",
                "age": "74",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was born on 4th March 1951. I live in north London, roughly midway between Archway and Crouch End. My last job before retirement was 15 years spent in Customer Services for Transport for London. I have 4 children, 3 daughters and a son, and 4 grandchildren - twins (boy and girl) aged 21, a boy of 17 and  a girl of 14. I'm divorced and live alone.  I was very rarely ill until I first felt the symptoms of GCA and PMR at the beginning of April 2017.  I was finally diagnosed on 31 July 2017 by Dr Pamela Mangat at the Royal Free Hospital. I had thought that I was suffering either from fibromyalgia or ME. When she diagnosed me, I had never heard of either condition despite extensive Googling. I'll never forget the relief of losing the terrible pain and stiffness within a couple of hours of my first dose of Pred. Of course there are plenty of other difficulties that don't go - above all the fatigue - and Pred brings its own side effects, but on balance I believe that being close to painfree and relatively mobile is worth everything else."
        },
        "yogabonnie": {
            "tags": [
                "Osteoporosis",
                "Calcium / Vitamin D3",
                "Polymyalgia rheumatica",
                "Prednisone",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2017-11-20",
                "age": "78",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "White"
            },
            "bio": "HI. I'm Bonnie West living in St Paul, Minnesota with my husband. My daughter lives in Sweden with her Swedish husband and two boys so we visit as often as possible and my son lives in St Paul also with wife and 4 year old son.  I have a book of short stories called Boyfriends published in the uk available on amazon.com and .co Also a bilingual children's book Hideki and Kenji Save the Day.  I teach yoga..fairly easy hatha yoga and lots of relaxation (I excel at lying around!) If you look at my post on PMR site called \"Relaxation\" a link to my CD tracks with yoga exercises  and relaxations you can do at home is there.  I cannot tell you how grateful I am for this site. I was diagnosed Nov 2017 started at 15mg.prednisone..and as of Nov 2022 at 1mg. trying to get to .5  I do triathlons..well I did .. last one right before PMR.  Here is my quote for the day from an Englishman.\n\"There are countless horrible things happening all over the world and horrible people prospering, but we must never allow them to disturb our equanimity or deflect us from our sacred duty to sabotage and annoy them whenever possible.\" - Auberon Waugh"
        },
        "bunnymom": {
            "tags": [
                "Osteoporosis",
                "Polymyalgia rheumatica"
            ],
            "demographics": {
                "joined": "2016-05-16",
                "age": "N/A",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "Hi everyone! I am a 68 year old female living in a small town in Illinois, USA, \n I was  diagnosed with PMR in February of 2016 after one month of symptoms, I have just retired after working with elementary children.  I could no longer do the job. I take uncoated prednisone and don't remember my starting dose 20 to 25? Currently at 5I did a lot of yoyoing the first year as I had a bulging disk in my neck that was causing shoulder pain."
        },
        "Rimmy": {
            "tags": [
                "Hiatus hernia",
                "Polymyalgia rheumatica",
                "Malignant melanoma"
            ],
            "demographics": {
                "joined": "2017-02-25",
                "age": "N/A",
                "gender": "Female",
                "country": "Australia",
                "ethnicity": "N/A"
            },
            "bio": "I am now (since April 2023) a 71 year old woman - diagnosed with PMR first at the beginning of 2017 - then a few weeks later also with GCA - but this was never confirmed with a biopsy. I live in a very appealing part of Western Australia - in the lower 'Great Southern' region - near a wonderful small regional city with a marvellous harbour and magnificent native flora & fauna.  My main interests are feminist philosophy, art history and promoting pacifism and and violence prevention . My partner and I also have a small permaculture oriented 'farm' with an old orchard in a nearby country town which we are reviving and developing further and which truly 'exhausts' us - but usually in a delightful way !!"
        },
        "Sophiestree": {
            "tags": [
                "Osteoporosis",
                "Zoledronic acid",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisolone",
                "RoActemra",
                "Parathyroid conditions",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2020-11-07",
                "age": "66",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with Large Vessel Vasculitis in October 2020.  It took over 3 months to get there as I was not typical to Temporal Arteritis in that it did not affect the top of my head, but more from my neck downwards also affecting all the major arteries from my aorta down my legs and arms.  It has affected my liver, lungs, intestines and possibly not related, parathyroid (I do have an existing underactive thyroid and poor osteoporosis that seems to have got a lot worse) but have now had that removed, not sure I have noticed much difference.  So I seem to be an anomaly in that I did not tick the usual boxes and it was only after a PET scan that the extensive (their words not mine) inflammation was discovered. \nI had 3 days of 1 gram steroid infusion followed by 40mg daily.\nThe consultant suggested reducing them by 5mg each week after a month but most of my symptoms returned and so I went back to 40mg\nit was then decided I should go onto Tocilizumab/Actemra which I started on 20th January, self injecting once a week along with reducing the steroids by 5mgs a week again until I get to 15mg, then revised.  The TCZ ended in August 2021 and within two months I was having a terrible flare.  \nHave a lot of side effects, dizziness, heart pounding and feeling like I'm on a permanent powerplate, all of which seem to have got worse on the Tocilizumab, but it is early days, so am thinking I need to ride it out at the moment.\nI think I got to the reality that maybe I won't be able to return to work for some time, when all along I have just been waiting to tell them I am ready now, hmmm not happening.  I finally fully retired in May 2023.\nI am a widow living in the East London/Essex borders in the UK and have one daughter who lived in Hong Kong with her two children but returned in March 2022 due to the strict covid restrictions.  I am still on 9mg in Jan 2024 and now reducing even slower than before and waiting for my new referral to come about, 6 months so far and no sign of an appointment but have enough pred to cover Essex so not too worried about it."
        },
        "Sharitone": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Omeprazole",
                "Denosumab",
                "Calcium / Vitamin D3",
                "Temporal arteritis (giant cell arteritis)",
                "Methotrexate",
                "Vitamin B12 / Folic acid"
            ],
            "demographics": {
                "joined": "2021-07-21",
                "age": "67",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Following a camel rodeo incident in Maqy2019, I was seeing a physio for some months for soft tissue damage. This was reasonably successful. I slightly pulled a muscle in my back on 1 January 2020 and when it got worse after 6 weeks, I went back to the physio, who kept hinting that I was suffering from stress, which was news to me. After another 6 weeks of increasingly agonising exercises,  I finally went to GP and had diagnosis of PMR - 15mg of pre, increase after a few days to 20mg, then to 25mg.\nI managed to go back to work that Summer (Lockdown had been a boon in the meantime). \nBy Christmas I was getting ridiculously tired and GP sent me to A&E with a growing headache in March. GCA/LVV variously diagnosed, 60 mg pred. Since then, I had Methotrexate for some months and said Goodbye to most of my hair. Could never get below 15mg Pred, so started on TCZ Dec 2021. Since Feb 2022 reducing very quickly o consultant's orders."
        },
        "Charlie1boy": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2015-01-02",
                "age": "85",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "My real name is Paddy Taylor, and I have had PMR since December 2014.  I was started at 20mg, then moved to 30mg after three days to get the pain under control. Have been tapering slowly without GP help from the beginning; this forum, particularly the \"aunties\" have been more than helpful. CRP and ESR have been normal after the initial diagnosis. \nThe only side effects from the prednisolone/PMR have been fatigue, lack of energy and strength.. I still manage a game each week of racquet ball, walk my dog daily, and go bell ringing twice or three times a week.\nI was also diagnosed with prostate cancer in July 2016, which hasn't helped. Mostly, it is the hot sweats caused by the hormone treatment injections. These finished in August 2019, but the sweats are still continuing!\nI first got to 5mg in April 2017,so it's been over three more years to get down to my current level, though I was at zero for 10 days at the beginning of October 2020, before going up again a bit.\nAt the beginning of May 2021, I have reduced to zero! Whether this will work out ok this time remains to be seen. It didn’t!\nAfter a further failed attempt at zero, I finally took my last (hopefully) pred on 30th Sept 2022, making it a total of seven years and nine months on this treatment.\nNow, as I write on 2nd May 2023, it is seven months on zero, so, I’m thinking I’m in remission.\nAs of today - 4th October 2023- I’ve been off prednisolone for one year and four days. Couldn’t say 100% that I’m in remission, as I still get the odd bad day, but certainly doing a lot better."
        },
        "Viv54": {
            "tags": [
                "Polymyalgia rheumatica",
                "Steroids",
                "High blood pressure (hypertension)",
                "Losartan",
                "Healthy eating",
                "weightloss",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2020-06-27",
                "age": "70",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Started with aches and pains , a couple of years ago.Went on for a long time before I finally went to a Dr, had no idea about PMR , now after my second flare im starting to get clued up .A strange and awful illness. But due to this fantastic site i now don't feel so alone with it !"
        },
        "Grants148": {
            "tags": [
                "Polymyalgia rheumatica",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "Women's health"
            ],
            "demographics": {
                "joined": "2017-09-06",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with PMR June 2016"
        },
        "Broseley": {
            "tags": [
                "Atrial fibrillation",
                "Bisoprolol",
                "Edoxaban",
                "Polymyalgia rheumatica",
                "Physiotherapy",
                "Prednisolone",
                "Omeprazole",
                "Osteopenia",
                "Calcium / Vitamin D3",
                "Temporal arteritis (giant cell arteritis)",
                "High cholesterol",
                "Atorvastatin",
                "High blood pressure (hypertension)",
                "Amlodipine"
            ],
            "demographics": {
                "joined": "2021-10-05",
                "age": "65",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Stiffness developed in June after severe hip inflammation from January. Locum GP prescribed diazepam and massage therapy. It didn't work. GP did a blood test which gave high ESR, CRP and platelets. Put on 15mg of prednisolone to almost immediate total loss of any stiffness. However my headache and jaw pain did not completely go away so my pred dose has been increased to 40mg. A temporal artery biopsy was negative but I've still been diagnosed with GCA. I am also on calcium and alendronate as I had already been diagnosed with osteopenia. I am a smoker and must stop. This is not easy. I'm now (July 2024) down to 1/2mg . Occasionally getting some soreness in ears, tendonitis pains and stiffness in both hips. Very occasional twinges in my right temple (biopsy site)."
        },
        "autumnlass": {
            "tags": [
                "Angina",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Glaucoma",
                "Dorzolamide / Timolol",
                "Weight loss"
            ],
            "demographics": {
                "joined": "2012-09-01",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "PMR diagnosed in July 2016. Dosage began at 15 mg.  Started MTX in October 2022.  Sine that time have been diagnosed with Exfoliation Glaucoma - and subsequently had vitrectomy in May 2023.  Awaiting another vitrectomy.\nDecember 2023 was diagnosed with Angina and had minor MI, and was hospitalised for 1 week. Two weeks later hospitalised again with pyelonephritis for 1 week, and received IV Amoxicillin for 7/7.  All satisfactory. Now convalescing!"
        },
        "Suffererc": {
            "tags": [
                "Hearing loss",
                "Hearing tests",
                "Polymyalgia rheumatica",
                "Prednisone",
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2018-05-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Suffererc"
        },
        "Missus835": {
            "tags": [
                "Fibromyalgia",
                "Gabapentin",
                "Osteoporosis",
                "Reclast",
                "Low fat diet",
                "Tylenol with Codeine #4",
                "Muscle pain",
                "Flexeril",
                "Hydromorphone",
                "Fractures",
                "Vertebroplasty",
                "Bed rest",
                "Gallstones",
                "Bursitis",
                "Cortisone",
                "Polymyalgia rheumatica",
                "Prednisone",
                "High cholesterol",
                "Ezetimibe",
                "Statins",
                "Gastro-oesophageal reflux disease",
                "Rabeprazole",
                "High blood pressure (hypertension)",
                "Metoprolol",
                "Perindopril",
                "Generalised anxiety disorder (GAD)",
                "Clonazepam",
                "Clorazepate",
                "healthyeating",
                "Ageing well",
                "Women's health"
            ],
            "demographics": {
                "joined": "2022-05-16",
                "age": "75",
                "gender": "Woman",
                "country": "Canada",
                "ethnicity": "White / Caucasian"
            },
            "bio": "I was diagnosed with PMR in January 2022. It's been a roller coaster ride but with Prednisone, it's been at least tolerable. \n\nI've had huge muscle spasms from my hip girdle right up to my ribs and now pulling on my stomach muscles. I can barely move and now barely eat because my stomach is so tight. Like a boa constrictor wrapped around your torso.\n\n\nOn just touching my back, I can feel the pain. It's hard to breathe because when I take a deeper breath, it pulls right from my hips right up through my torso.\n\nI have lost 20 lbs. over the 4 months I've been only able to eat about half portions. Under other circumstances...\n\nSince I was unable to tolerate Alendronic Acid tablets, opted for the Zolendronic Infusion last week. Done in the chemotherapy department of one of the hospitals here in Halifax, NS. Took about 15 minutes and then a half hour afterward to check vitals, etc. There can be side effects. Not going there. Fingers crossed it helps with the bones.\n\nUnable to take physio at this time because my spine is quite brittle and they don't want to risk more vertebral fractures (now at 6 plus two vertebroplasties). Exercise is walking with walker. I'm on the second floor, so getting outdoors is a real challenge as it takes two of us. Married to my heating pad. Currently awaiting MRI to determine which vertebrae are in need of vertebroplasties next.\n\nI am an abuse survivor (lifetime), which has actually enabled me to cope with what I'm going through currently. \n\nDon't let anyone tell you \"there are those worse off\". There indeed are, but this is your personal experience. Present moment living helps. Worrying changes nothing.\n\nUpdate Sept 18/24: \nCurrently living with 10 vertebral compression fractures. The majority have happened since July 2023. Had 2 vertebroplasties done Sept. 2023. Osteo Specialist says no more. I've had one Zoledronic Acid infusion in October 2023 and scheduled for the next one this November 2024. Miraculously, got in early to our Pain Management Clinic in Halifax after a 2 year wait. Could have been 5, but I was on a cancellation list. The doctor, after squeezing up and down my spine and neck and hitting many trigger points; also hips and sides of thighs, has concluded I also have \"fibromyalgia\", or the newer version thereof. Essentially all my nerves are on high alert and inflammed. He would give me nothing more for pain. No shots as pain is too widedpread and is referring me back to GP who sent me there in the first place, to have my pain addressed. So my list goes on. Very unsure about his diagnosis. He would not refer me to a Neurologist. Said the ball is back in GPs court. Here am I, the monkey in the middle...so that said...\nPMR, Osteoporosis, Fibro, Diverticular Disease, Cartaracts (surgeries done), Hypertesion, Cholesterol high, Generalized Anxiety, Gall Bladder shot.  At least I still am able to live alone and do all the things which that involves and grateful for it."
        },
        "Thelmarina": {
            "tags": [
                "Asthma",
                "Ventolin",
                "Seretide",
                "Osteoporosis",
                "Ibandronic acid",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Immunosuppressants",
                "Diverticular disease and diverticulitis",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2019-01-23",
                "age": "78",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I am female, 77 and live in the UK. I was diagnosed in June 2017 and put on 25mgs Pred. Currently I am on 7mgs and tapering slowly. I took Ibandronic acid once a month for three and a half years and after a six month break, a dexa  scan and a fractured hip I’m back on it. I am also now on Lamprazole and yoghurt to protect my stomach. I’ve had a couple of violent gastric episodes, landing up in hospital with one of them! Now I’ve been diagnosed with Diverticular disease which explains what happened. Can’t blame Pred for everything! I’m grateful for Pred because it’s given me back mobility, therefore my independence and my way of life.\nJune 2021. Wound up in hospital with bacterial pneumonia followed by pleurisy! Bolt from the blue and a reminder of how clinically vulnerable we are. Back again two weeks after coming out with an infected cyst. Ridiculous. However, I doubled my dosage again and received excellent treatment.\n June 2022 I had an unprovoked thrombosis in my left leg. All sorted now and I am on 2.5 mgs Apixoban twice  a day.  Anyway, hugely grateful for the care, the drugs and this amazing forum, all of which are preserving my quality of life. Onwards!"
        },
        "Suet3942": {
            "tags": [
                "Atrial fibrillation"
            ],
            "demographics": {
                "joined": "2018-01-11",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Suet3942"
        },
        "Hollyseden": {
            "tags": [
                "Polymyalgia rheumatica"
            ],
            "demographics": {
                "joined": "2017-08-05",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed June 17 with PMR after 6 months of pain. Started on 15mg with few weeks at 60mg while waiting for result of temporal biopsy. Negative so back to 15mg. Tapered slowly, now at 3mg"
        },
        "Marilyn1959": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2017-06-30",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "UK Female. Diagnosed PMR  June 2017. Starting dose 15mgs pred. Been on 6.5mgs for past two years.\nAtrial Fib, flutter with frequent supraventricular ectopics since Oct 2019.  Several tests later still no clue as to cause. Episodes more frequent and longer in duration. Several A&E admissions in recent months."
        },
        "Sandy1947": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-07-14",
                "age": "N/A",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "Received the gift of PMR June 12th 2017. it was brewing for a few months prior, but it was misdiagnosed as osteo-arthritis. I am petite and have osteoporosis as well. \n\nI live in NJ and have an apartment in New York City. I have 2 sons and 2 grandchildren.My profession is a financial advisor to urban school employees specializing in retirement. I also started a charity 15 years ago that distributes prom gowns and dressy dresses to people in need. We also give scholarships to students who do community service with the organization.\n\nI love Zumba, weight training, cooking, travel (especially to the Cotswalds), theatre and movies. Up until the visitation from my friend PMR, I couldn't sit still. Now I've discovered reading, Qigong, sitting in beautiful parks, studying famous quotes and managing a strict diet so I don't gain weight from Prednisone.\n\nI am staying very still and quiet to listen to G-d tell me the message from this journey. I love the forum and want to meet my new friends who are helping me learn how walk through this one step at a time!"
        },
        "karools16": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2016-07-01",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "13 years ago I was diagnosed with GCA. Started whilst working with a devastating headache. When I was on 2mg Pred and feeling quite well, a Synacthen test showed I have Addison's Disease. I am currently on 7mg and quite well."
        },
        "CT-5012": {
            "tags": [
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2017-06-10",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Live in York uk PMR diagnosed Feb 2016 GCA May 2016 also have Glaucoma, cataracts and Hypothiroid and too many allergies to list!"
        },
        "Highlandtiger": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Vitamin D3",
                "Alendronic acid",
                "Ranitidine",
                "Vitamin K2",
                "Adcal-D3"
            ],
            "demographics": {
                "joined": "2019-04-19",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed PMR in May 2018. I live in the Scottish Highlands. Before PMR I was extremely fit and active (hillwalking, scuba diving, curling, running, pilates etc). Sudden onset of symptoms in March 2018 following upon (with hindsight) a perfect storm of stressful events. Given naproxen at first which did not touch the pain. While waiting to see GP I saw a chiropractor who began taking a history then stopped, told me he thought I had PMR and to go to see my GP. Tests pointed to PMR. Started on 20mg pred on the Tuesday. By the Saturday I was pain free. Made the schoolgirl error of thinking I was cured so went up a few mountains that weekend! Initially I couldn't see my \"own\" GP. Was started on a quick reduction plan which caused a couple of flares. Saw my usual GP, sharp intake of breath.....\"rather faster than I would have recommended”, “GPs' biggest mistake is to try and get patients off steroids too quickly\". I've stuck with him since and adopted a much slower tapering approach and am now on 5mg (January 2020 - update still on 5mg January 2021...). GP had not heard of PMRGCA UK or this site but I printed off Dorset Lady's excel spread sheet to show him what I planned for future tapers. He was happy with that approach although he had not seen it before. I have obtained much more information and help on this site than anywhere else and am extremely glad I found it! Update: May 2021 4.5mg. July 2022 4mg trying to reduce to 3.5mg."
        },
        "herdysheep": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2020-03-23",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Past my 3 score years and 10.  Diagnosed pmr in 2012.  Yo yo since then - plenty of flares.  In for the long haul.  Gathering some side effects from pred. but not too bad.  Had cataracts done, have dry eye, and can add high cholesterol to the list, together with highish blood pressure.   Much slower taper taking me to 4mg. Still shoulder and neck pain and quite fatigued.\n\nEnjoy small village life high in the Pennines.  \n\nUpdate - got to 5mg successfully but since starting on statins -(coincidence?) have experienced muscle mass loss and weight loss generally.  Investigations ongoing.  Plan to stay at 5mg for a while to see if extreme fatigue eases"
        },
        "Mstiles": {
            "tags": [
                "Clinical depression",
                "Arthritis",
                "Graves' disease",
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisone",
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2017-07-11",
                "age": "81",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "Hello everyone,\n\n    I’m in Northern California.   Moved here after living in Atlanta for 45 years.  Female, age 80.  \n    In December 2017 I started having severe shoulder, neck pain and head pain in the occipital area at the back of my head. Nothing helped the pain.  A rheumatologist first  diagnosed me with PMR, then GCa in 2018 and put me on 40 mg of prednisone.  I didn’t have vision symptoms. \n   In three months he fired me from his practice because I didn’t taper fast enough.   I was on my third rheumy and had finally found one who listens and was happy for me to do a slow taper, DSNS plan.  I had gotten down to 8.5 mg when she left the practice in 2020 at the beginning of the pandemic.  I tried another rheumy but she didn’t known much about PMR/GCA.   After that I treated flares myself by increasing pred and then coming back down. \n      Because  of the pandemic, fires in Northern California, some flares, and constant family and financial turmoil, I basically stopped tapering and got my prednisone  from my GP.  She is so overwhelmed and unfamiliar with PMR/GCA that she or her assistant didn’t ever discuss my refills until January of this year, 2024.  She has Moab notified me she will not refill the prednisone any more and has referred me to another medical system’s rheumatology practice.  \n     I had cataract surgery for both eyes in 2022.  The process took almost a year to complete due to doctors leaving and appointments being cancelled.\n      I live with my son who helps me, but  who has health, (Crohns disease),  and emotional issues of his own.  \n       Five 1/2 years after diagnosis I’ve never been able to get below 8 1/2 mg. and pred is starting to show its effects. I’ve recently been having walking problems and shoulder pain.  Ive been seen by and orthopedist who diagnosed me with torn tendons in the left hip and both shoulders.  No surgery possible for the hip as an MRI showed there is muscle atrophy in the joint and nothing for the tendon to attach to.  The right knee is arthritic and not strong.  I must use a cane all the time and I’m afraid of falling. \n        In finally updating this bio,  I’m shocked to realize I’ve been on pred for so long.  I had been thinking it was only three years.   Seems I haven't plowed through the turmoil, stress, and unexpected problems of life well  enough to taper successfully. I’ve always suffered from anxiety and depression and fear of doctors, I have a therapist, but no strong support from anyone else. \n    More pain and problems in other places, getting to be a long list, discouraging."
        },
        "Blackcat1M": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2019-01-08",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I stared with pains in my shoulders ,arms and neck and one morning found it very difficult to get out of bed.\nWent to see my doctor who gave me a blood test she said I was borderline for PMR started me on 5mg pred  for two weeks.\nWhen I went back to see her I said what a difference the medication made and she said I had PMR ."
        },
        "maria40": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Supraventricular tachycardia (SVT)",
                "Bisoprolol",
                "Temporal arteritis (giant cell arteritis)",
                "healthyeating"
            ],
            "demographics": {
                "joined": "2014-05-17",
                "age": "84",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "PMR since 2000, GCA since 2010.  SVT  2014 dx but symptoms earlier."
        },
        "LemonZest11": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Tocilizumab",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2019-08-07",
                "age": "70",
                "gender": "Woman",
                "country": "Australia",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Australian woman interested in the PMR/LVV experiences and advice of others. I was diagnosed in December 2018 and have been struggling to taper ever since.  In 2020 I was diagnosed with large vessel vasculitis and, with the help of tocilizumab, managed to taper to 2mgs.  Have been battling ever since.\nIt is now June 2023 and I have managed to taper off prednisolone and have been pred free for 20 weeks now.  I am continuing with TCZ, and am attempting to taper my injections from 3 weekly to 3.5 weekly, and then to 4 weekly.  I am experiencing muscle and some joint stiffness but no pain.  Just waiting to see if I am OK, before extending the TCZ gap to 4 weeks. \nNov 2023 update ... I have been off pred for 40 weeks and have tapered the TCZ jabs to 4 weekly. I feel fragile and headachy in the 4th week before the jab, but otherwise doing well.\nJune 2024 update ... 69 weeks off pred and 12th round of 4 weekly tcz jabs and now the proverbial has hit the fan! Feeling well, I had a routine check up with my Rheumatologist, who is a new and young woman taking over some of my retiring Rheumy's patients. Bloods revealed hugely elevated inflammatory markers. But why, with no pain? A round of tests, PET-CT, CT-Angiogram, Dexa (just to \nbe sure) and numerous bloods suggested nothing sinister but a relapse of the LVV. So, 25mgs pred, weekly tcz, Bactrim x 3 weekly until I'm below 20mgs and a bone protector called Resprim Forte(sulphamethoxazole and trimethoprim) as I'm now oesteosporitic 😫. Doc is on the ball and despite the shock, I feel in good hands. I begin the taper after 2 weeks on 25mgs pred with weekly blood monitoring 🤞\n21/10/24 I have tapered to 5mgs pred but my neutrophils are soooo low we have decided to stall the TCZ for the time being.  Even after stretching to fortnightly jabs, the neutrophils have remained very low.  I’ll have a blood test in a couple of weeks to see what’s happening with inflammation.\n10/2/25\nSo the inflammation came racing back once TCZ was stopped.  After increasing pred to 15mgs, it’s taken a few weeks to get down to 10mgs pred, and inflammation is still not stable.  Rheumy has suggested I join her public clinic at Royal Perth Hospital in order to access either secukinumab or upadacitinib.  In the meantime, I am remaining on 10mgs until I see her at the end of March.  By then we’ll know if I have been given approval to join the clinic."
        },
        "Gimme": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2023-06-23",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed by GP as possible PMR Nov 2022.  Classic pattern of hip, buttocks, thighs stiffness and pain, sides of knees and extreme debilitating fatigue, plus muscles became very tired after little effort.  Inflammatory markers not raised.  RA, lupus and fibromyalgia excluded.  Then Jan 2023, caught flu and triggered shoulder, neck and upper arm pain, unable to turn my head so started pred 15 mg Feb 2023 with miraculous results, completely free from pain and stiffness within hours.  After 15mg for 2 weeks, reduction to 10mg due to psych effects and then again after a week to 7.5 mg. In May reduced to 5mg as still suffering side effects.  Pain and stiffness did not start to return until 5 mg, but still 80-90% effective.  Extreme fatigue returned after dropping to 5 mg.  Vit D at 4,000 IU helped fatigue noticeably.\n\nI blame my PMR on years of work stress and personal trauma.  Became so ill May 2021, forced to stop work and take early retirement.  Now starting to suspect that viral infections trigger a flare in PMR symptoms and also possible strong dietary correlation.  Also learned, Do whatever makes you happy (if I had enough energy).\n\nWas always athletic and fit, ran, walked, cycled, swam, I had walked to 18,000 ft in the Himalaya when all this started.  Classic atopic family with asthma, eczema and hayfever allergies.  Have always had problems with my muscles, which I put down to sporting injuries and pattern of physio, osteopathic treatments. \n\nHard to say when my symptoms first started, possibly as long ago as 2003.  I can’t pinpoint first flare, but stiffness and tiredness started in my early 40s, physio advised seeing a rheumatologist, but GP did not take very seriously.  Prescribed diclofenac, as effective as pred is now, but effectiveness only lasted a few weeks, so did not persist.  Since then, every few months, I have had a flare of same symptoms, stiffness, pain, fatigue, which lasts a few months and then disappears, although stiffness persisted.  I have an idea that the flares correlate to viral infections, but too long ago to be sure, or possibly stress.  Many visits to GP, but nothing done until GP in Nov 22.\n\nFirst really bad attack happened around 2007, could hardly walk due to stiffness and pain, coinciding with flare of eczema on my arms and severe GI symptoms.  GI symptoms investigated and nothing found so labelled IBS.  I suspected diet and tried FODMAPs diet, which helped GI symptoms.  Then eliminated wheat and the pain, stiffness, brain fog, palpitations, fatigue vanished within 48 hrs.  Have been gluten free since.  Though continued to get flares of PMR type symptoms; hip girdle and rotator cuff type pain.  Stopped work May 2021, at the time, I thought due to stress and mental health, but now know that there is an underlying physical reason.  Summer 22 was hell for me, for months could not get up stairs, classic PMR Donald Duck waddle, toddler stomp down the stairs and old person groaning noises to get me out of a chair.  Saw GP in Nov 22 as wondered why I was not recovering from what I thought was a stress burnout and that is when I got a tentative diagnosis.  New GP and first one to take it all seriously.  The flare was tapering off at the end of the year without treatment by the time I saw the GP, but I got flu in Jan 2023 and all the symptoms kicked off again.  The worst it has ever been.  This time, my neck, trapezoid and shoulders, upper arms affected aswell as the hip girdle, lower back and legs etc.  I was a complete mess and could hardly move, so finally gave in and went on the pred.  \n\nI can’t say that the pred is wonderful for me, or that my quality of life is better.  The control of pain and stiffness is slightly better than taking ibuprofen, but I hate the way that pred makes me feel.  If I could stop the pred tomorrow, I would, in a heart beat.\n\nDiet seems to be majorly important for me.  I was prediabetic last year and when I was on the prediabetes diet, my symptoms were significantly better during that time.  When I went on pred, I went back to eating foods with low Glycaemic Index and my weight has been stable.  When I lapse, I have discovered that I am extremely sensitive to added sugar, alcohol less so, very reactive to fried high carb snacks like crisps and tortilla crisps with loads of additives.  I really suffer the next day and a day or so after lapsing.\n\nFor now, I am continuing with the pred and trying to taper, and at the same time continue to explore the diet.  I am certain that I have PMR, but I also suspect that my dietary intolerance might have worsened, exacerbating the PMR symptoms.  Lastly, many PMR sufferers are anaemic, so I plan to try some iron to see if that helps the debilitating tiredness.\n\nIn case you wonder about the screen nick, I tried about 20 names when I joined and each one I tried was already taken. I finally tried gimmestrength in frustration, which was also taken 😃, so this is what I ended up with.  It would seem that finding an acceptable user name to join the site is more difficult than finding a cure for PMR.\n\nUpdated 05 July 2023.\n\nBlood results from 5 Sept 2023:\nCRP less than 5 mg/l\nERS 14 mm/h\nRheumatoid factor less than 10 iu/ml\nAnti-nuclear factor negative (less than 1/100)\nIron, B12, folate and Vit D levels OK.\nT4 and TSH normal\nHb a1c 39 mmol/mol - so 9 months pred hasn't put me back in the pre-diabetes zone yet. \nWeight fairly stable but put on 2 or 3 lbs.\nFBC all within acceptable range.\nNeutrophils 7.84 (normal range 1.5-7.2) - slightly raised due to pred?\n\nSo on the face of it, I look pretty healthy.  So why do I feel so crap then?  I made a list of my symptoms and they covered 2 sides of A4.  Saw the nice lady GP today and she still thinks that my symptoms sound like PMR, but there is still some random stuff going on (dryness, worsening asthma and thyroid) that doesn't fully fit.  She is going to speak to rheumatology about possibility of Sjogrens and is also sending me for a neck scan to look at my thyroid.  Thyroid function was normal, but I have an enlarged painful thyroid gland, it seems.\n\nUpdated 27 Sept 2023."
        },
        "Purplecrow": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisone",
                "Degenerative disc disease",
                "Neurological conditions"
            ],
            "demographics": {
                "joined": "2018-04-27",
                "age": "N/A",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "Age 76,   PMR diagnosed 2013, live in Washington State, USA . PMR started after two  surgeries in a short period of time.  Using prednisone since 2013.  No diabetes, bone loss, or other complications associated with Pred.  Recently had spinal cord stimulator implant for chronic back pain management."
        },
        "whitefishbay": {
            "tags": [
                "Asthma",
                "Salbutamol",
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Vasculitis",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Acoustic neuroma",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2016-08-16",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Came down with PMR in Oct 2015 and GP thought it was rotator cuff injury.  I was seen, xrayed, assessed, blood tested and finally got a script for Prednislone in March 2016 after much gnashing, wailing and grinding of teeth and changing rheumatologist. \nI am down to 1 mg Prednisone and have a vestibular schwannoma since August 2021 (with 60% deafness in right ear)."
        },
        "Bridge31": {
            "tags": [
                "Bronchiectasis",
                "Antibiotics",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Steroid injections",
                "healthyeating",
                "Ageing well",
                "weightloss"
            ],
            "demographics": {
                "joined": "2019-07-16",
                "age": "78",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Diagnosed July 2019\n120mg slow release injection 19th July . After about 10 to 12 days the pain started to return. Pain worse alternate days but now worse than before I was diagnosed. A fair amount of disorientation and balance issues. \nSee the consultant tomorrow 16th August.\nAll came on very suddenly over two days.\nCurrently down to 4mg. \nHad a flare at 3.5 and went back to 7.\nJuly 2022…Currently tapering to 5 over 7 weeks. \nDec 2022 .Still on 5mg and staying there until early January when I will try and reduce to 4.5. Actually stayed on 5 for several months. \nApril 2024. Down to 3.5 where I flared before. Not feeling too good but will stick with it over the next few weeks then try a 7 week taper to 3. Fingers crossed this time ."
        },
        "arvine": {
            "tags": [
                "Pain",
                "Prednisone",
                "Joint pain",
                "Leg pain",
                "Tylenol",
                "Psoriasis",
                "Excessive vomiting in pregnancy"
            ],
            "demographics": {
                "joined": "2016-11-06",
                "age": "N/A",
                "gender": "Woman",
                "country": "Canada",
                "ethnicity": "N/A"
            },
            "bio": "arvine in reply to jinasc\n47 minutes ago\noh boy, well diagnosed Oct 2016, started on 40 mg, tapered every couple weeks until down to 15 mg, which stayed on for a long time, family health problems, stressed, so rheumy kept me on same dose for months, gradually got down to 5 mgs, summer of 2020, stayed there until November 2020 started to taper to 4 mgs, but by Dec, had bowel issues, diverticulosis, IBS d changed to IBSc, have had a fewb catscans, ultrasounds etc, last person to person with rheumy was in Feb 2021 I believe, at that time she said, pain not pmr but aging, and arthritis, but stay at 5 mgs, but at that dose up until Nov 2020, seemed to feel not too bad, re pain, as time went on thru tests, antibiotics for bowel problems, settled down, so started to taper again to 4 mgs, but then on appt by phone, she said not to continue taper, until some issues re bowels, re cortisol blood work done, at that point, early 2021 was down to 4 mgs for 4 days and 5 for 3 days, where she said to stay, and so since 2021 have been at that dose, but have been hurting so much for many mos now, worse mornings, but some days till end of day, had RA test , negative was told, even my markers are not showing inflammation, wbc flagged hi, and neutrophils, flagged also, just getting depressed with this over 5 years now, am anxious to see new rheumy, so far have to wait until apr 13th, think that,s most of my history, may have missed some stuff, been for so long now\n\nReport"
        },
        "suzy1959": {
            "tags": [
                "Arthritis",
                "Osteoarthritis",
                "Joint replacement",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Amitriptyline"
            ],
            "demographics": {
                "joined": "2012-08-24",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "PMR at age 52 in 2012. Have been on Pred. for over 6 years and mainly been at 11mgs. Have had multiple flares every time I have reduced. Developed very painful OA in both knees and then a hip since 2014. Hip replacement in 2018, knee replacement in March 2019, then the other hip needs to be replaced in September 2019 and, I finally had the other knee replaced in February 2020, giving me the full set! \nI am now in much less pain and hoping that that, plus improved mobility will affect my PMR in a good way and let me reduce the Pred\nI have been through 4 Rheumatologists, looking for one who knew something about PMR! Have had to give up my work as a counsellor due to my health."
        },
        "polkadotcom": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2013-02-08",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm polkadotcom"
        },
        "YuliK": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-09-23",
                "age": "N/A",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "July,2019\n\nI'm 78 years young. \nLost my beloved husband 8 years ago. After caring for him over 5 years through cancer. 😢\n\nThree  adult children\n7 grandchildren, great friend with all of them. ..Spoil them soft.  \n\nI love writing poetry\nLove reading\nTraveling\nSailing and the sea\nLove people with sense of humour\n \nGlobal politics interest me. \n\nDealing with a number of health issues which take up far too much time.  \n\nCatching up on history, via the internet. 👍\n\n3/4/21"
        },
        "Estellemac": {
            "tags": [
                "Arthritis",
                "Pain management",
                "Epidural Anesthesia",
                "Back pain",
                "Steroid injections",
                "Obesity",
                "Low carbohydrate diet",
                "Osteoarthritis",
                "Hip Replacement",
                "Co-codamol",
                "Medication monitoring",
                "Atrial fibrillation",
                "Electrocardiogram (ECG)",
                "Bisoprolol / Hydrochlorothiazide",
                "Colitis",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Steroids",
                "Ulcerative colitis",
                "Slipped disc",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2017-06-19",
                "age": "70",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I am  69 and  have had PMR for 8 years.  I can not get  the steroids any lower than 4mg  but am working with my GP to do this. I have osteoarthritis and wear and tear in the sacroiliac joints. I had a left hip replacement in 2017 the right one may be on the way out now. I have had a caudal epidural for the sacroiliac facet joint, that hasn't worked this time.  Loosing weight would make a massive difference to my load bearing joints."
        },
        "alvertta": {
            "tags": [
                "Temporal arteritis (giant cell arteritis)",
                "Prednisone",
                "Actemra"
            ],
            "demographics": {
                "joined": "2018-10-27",
                "age": "N/A",
                "gender": "N/A",
                "country": "Canada",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed with CGA in October 2018.  Locked jaw. Left eye..severe flashing lights.  Top of the head sore.  Age 71Always healthy, active, skier, swimmer.  Emerg Doctor figured it out fast.  Started on 1000mg for three days, then 60mg prednisone and tapering down.  At 9 in July 2020. Flare. Lost 1/3 of right eye sight.  1000 for three days then Back to 50.  Started Actemra in October 2020. Off Actemra two months October November 2021.  Flared. Back on Actemra. Now on way to 5 mg.  Ontario Canada.  This journey just is too long."
        },
        "S4ndy": {
            "tags": [
                "Polymyalgia rheumatica",
                "Spinal stenosis",
                "Amitriptyline",
                "Diclofenac",
                "Tapentadol"
            ],
            "demographics": {
                "joined": "2016-03-21",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm S4ndy"
        },
        "Megams": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Synthroid",
                "Atrial fibrillation",
                "Heart surgery",
                "Polymyalgia rheumatica",
                "Hydrocortisone",
                "Pregnancy",
                "Men's health",
                "Quit smoking",
                "parenting"
            ],
            "demographics": {
                "joined": "2015-01-24",
                "age": "N/A",
                "gender": "Female",
                "country": "New Zealand",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Diagnosed PMR Jan 2015.  \nPred initially ulcerated stomach, can't tolerate PPI's.\nOpted to use more natural alternatives if possible & still do.  \nPrx'd hydrocortisone (in acid resistant capsule) @ cost to me but worth every cent as leaves stomach alone.    Sensitivities to most medications making q.o.l bothersome (understatement indeed).\nDeal with torn tendons + ligaments (ankles/elbows).   \nHad surgery to repair peroneal ankle tendon + autologous blood treatment - great success.  \nStill  do daily exercises due to scar tissue.    \nSteroid dose increases in winter & lowers in summer. \nCataract surgery R eye March 2021 & L eye June 2021 (steroid induced).   \nPractice Mindfulness meditation (almost daily).\nDiagnosed with mild/moderate sleep apnea 2017 - had most of adult life & always thought heart related as born with genetic ASD.  Use CPAP.   \nOpen heart surgery 1988 - electrical circuitry faults unable to be corrected then.\nNon smoker, non drinker & weight OK - \nOn Betaloc 47.50mg Xarelto 20mg + Losartan 50mg.   \nHad cryo- ablation  8 Feb 2022 - in NSR & healing well.   \nStill on hydrocortisone for PMR after 8.5 years altho now question mark as we unravel new diagnosis  of myositis. \nMy PMR possibly may have morphed? as raised PL7 but negative ANA.......\nResigned as Hospital Chaplain due to PMR ~"
        },
        "MamaBeagle": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2018-05-25",
                "age": "75",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm MamaBeagle"
        },
        "Mary63": {
            "tags": [
                "Coronary heart disease",
                "Bisoprolol",
                "Apixaban",
                "Ramipril",
                "Atorvastatin",
                "Atrial fibrillation",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "weightloss",
                "fitness",
                "Low carb high fat (LCHF) diet"
            ],
            "demographics": {
                "joined": "2016-01-14",
                "age": "72",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Diagnosed with Polymyalgia Rheumatica in Jan 2016 after 10 weeks of severe symptoms. Retired because of associated fatigue in July 2017. Now back to working very part time on my own terms. Maximum four hours a week.  Self employed nurse in field of food intolerance detection and advice. Total knee replacement end of Feb 2019. Complicated recovery because of two areas of tendonitis (seems fairly common with PMR)  Fatigue much improved following several acupuncture sessions. Eating low carb diet.  Unstable angina and two stents in October 2020.  Atrial fibrillation diagnosed in spring 2021. Now 69 years old (Jan 2022) Jan 2022 on 3mg prednisolone. Adrenals seem to have woken up as deathly fatigue has  more or less gone. Have a feeling that PMR is no longer around. Fingers crossed."
        },
        "nuigini": {
            "tags": [
                "Coeliac disease",
                "Gluten-free diet",
                "Kidney disease",
                "Polymyalgia rheumatica",
                "Prednisone"
            ],
            "demographics": {
                "joined": "2014-08-06",
                "age": "N/A",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed with PMR March 2014; determined to be in remission through PET scan August 2024; now dealing with steroid induced adrenal insufficiency."
        },
        "2013mayo": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Vasculitis",
                "Osteoarthritis",
                "Hip Replacement",
                "H.P. Acthar gel",
                "Fractures",
                "Lung disease",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Diverticular disease and diverticulitis",
                "Temporal arteritis (giant cell arteritis)",
                "Bowel obstruction",
                "Intestinal and stomach conditions"
            ],
            "demographics": {
                "joined": "2020-11-28",
                "age": "71",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm 2013mayo"
        },
        "Daffodilia": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Gallstones",
                "Low fat diet",
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2019-01-27",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed and getting better on meds"
        },
        "Hindags": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-01-23",
                "age": "N/A",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "I was born and raised in NYC but lived in Chicago for 17 years and am now in CA for the last 25+ years. I was diagnosed with PMR  in 12/2016 at the age of 75.  I am married with one daughter. Our daughter, her husband  and our three grandkids live down the block.  Lucky!  \nUntil ten years ago I worked for Kaiser Permanente as a Clinical Psychologist.  I also had a part time private practice. I still see patients  about three days a week.\nI am so grateful for all the knowledge and care in this community. I don't know how I would have been able to live as full a life as I've had with PMR without the information and support I have received here.\nMy avatar was a picture taken about a month before I was diagnosed with PMR on a trip with my husband to Scotland."
        },
        "TheMoaningViolet": {
            "tags": [
                "Psoriasis",
                "Polymyalgia rheumatica",
                "Steroids",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-12-05",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with PMR (polymyalgia rheumatica) at the beginning of December 2019, and I took my last 0.5 mg tablet of Prednisolone on the last day of September 2023. Since then, I have developed a skin condition that resembles psoriasis, although the doctors are somewhat puzzled by it and believe that some of it may be eczema. Currently, I am using a mild steroid cream that seems to be helpful, and I am looking into long-term management options for the condition."
        },
        "Seacat30": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2021-06-06",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Woke up with neck pain 5 days after AstraZeneca Covid vaccination (March 2021). Progressed to hips 1 week later, then shoulders. Tried simple exercises and yoga. This seemed to make matters worse.  Then also pain and stiffness in thighs and buttocks.  By late April could not stand from seated position. \n\nCRP 10, ESR 45 on 23.06.21. Starting on 15mg prednisolone, lansoprazole, vitamin d and calcium on 25.06.21.\n\n Reduced to 12.5mg on 16.07.21. Reduced to 10mg on 06.08.21. Trying 9mg from 03.09.21. 01.10.21 struggling with 8mg but too painful so 14.10.21 back up to 9mg. 20.10.21 GP agreed to increase to 10mg for 2 months. \n\n24.12.21 9.5mg. 30.12.21 9mg. 21.01.22 8.5mg. 11.02.22 8mg. Waiting for results of recent MRI. 04.03.22 7.5mg. 25.03.22 7mg. \n\nMRI results showed 2 torn tendons in right shoulder and mild tendonitis in both shoulders. Tendonitis in left gluteus minimus and medius. Seeing NHS physio.\n\n22.04.22 6.5mg, 13.05.22 6mg, 04.06.22 5.5mg. Feel worse after vaccine jab 4 Moderna on 08.06.22? 5mg 25.06.22. 4.5mg on 22.07.22. Possibly signs of muscle recovery starting?\n\n15.08.22 4mg. 09.09.22 3.5mg. 07.10.22 3mg and think I should stop reducing for a while?\n\n31.10.22 Pfizer Bivalent vaccine. 04.11.22 2.5mg. 02.12.22 2mg.  Think pain worse but freezing cold and wet windy weather may also be unhelpful.\n\nManaged Christmas 2022 far better than 2021. Kept going longer, sat on floor with kids, went to park on Boxing Day.\n\n28.12.22 met Consultant Rheumatologist. Told that I don't have PMR or any rheumatological disorder. Based on ability to move and blood test results in January and June 2022. Instructed to reduce pred by 0.5mg every 3 weeks. \n\nWants to refer me to MSK Physio again. Possibly spinal specialist. X-ray of thoracic spine - looking at my scoliosis - no results yet.\n\n29.12.22 blood tests. CRP 3 (range 0-5). ESR 13 (range 0-15). \n\nStarted reduction towards 1.5mg 30.12.23. 1mg from 20.01.23.  Xray report 31.01.23 confirms scoliosis and states bones osteopenic in appearance. \n\nApprox 0.75mg from 09.02.23. 0.5mg from 17.02.23. 0.25mg from 24.02.23. Zero 03.03.23."
        },
        "Theziggy": {
            "tags": [
                "Pain",
                "Diabetes",
                "Frozen shoulder",
                "Type 2 diabetes",
                "Polymyalgia rheumatica",
                "Prednisone",
                "Barrett's oesophagus"
            ],
            "demographics": {
                "joined": "2014-02-01",
                "age": "N/A",
                "gender": "Male",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I added my story when I joined the forum but it seems to have been wiped. Suffice to says that I have Palindromic Rheumatism (no forum for it on HU but the PMR forum is close symptom and treatment wise) and diabetes type 2"
        },
        "York54": {
            "tags": [
                "Rheumatoid arthritis",
                "Polymyalgia rheumatica",
                "Steroids",
                "Ulcerative colitis"
            ],
            "demographics": {
                "joined": "2016-09-02",
                "age": "N/A",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm York54"
        },
        "Noosat": {
            "tags": [
                "Polymyalgia rheumatica"
            ],
            "demographics": {
                "joined": "2019-01-22",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "have managed to decrease prednisone to 4.5 mg. still suffer fatigue and rusty legs and poor balance.  O course some issues could be due to age and osteoporosis"
        },
        "Linny3": {
            "tags": [
                "Fibromyalgia",
                "Osteoporosis",
                "Strontium-89",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Prednisone",
                "Steroids",
                "Rayos",
                "Arthritis pain",
                "healthyeating",
                "Ageing well",
                "weightloss"
            ],
            "demographics": {
                "joined": "2018-06-17",
                "age": "76",
                "gender": "Woman",
                "country": "United States",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm Linny3"
        },
        "EdithWales": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Atrial fibrillation",
                "Rivaroxaban",
                "Polymyalgia rheumatica",
                "Levothyroxine",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2014-05-04",
                "age": "84",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Retired professional. Government Adviser and Executive Director of an NHS Trust \nStill works overseeing the Mental Health Act. Keeps up to date with most medical matters.\nI was diagnosed with GCA in April 2013 and had a positive Temporal Artery Biopsy\nIn June 2023 I discovered I had Atrial Fibrillation \nI live in Wales"
        },
        "diana1998": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Low carbohydrate diet",
                "fitness"
            ],
            "demographics": {
                "joined": "2020-01-25",
                "age": "81",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Started on 30mg pred Christmas 2015.  April 2023 now on 2mg. \nBeen a very slow journey for me. I drop by 0.5mg and stay on a dose for 3 months to avoid any pain.  Patience.....is a virtue.... Onward and upward."
        },
        "Doraflora": {
            "tags": [
                "Pain",
                "Polymyalgia rheumatica",
                "Neomycin / Prednisolone",
                "High blood pressure (hypertension)",
                "Lercanidipine",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2020-04-23",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "My GP diagnosed PMR over the phone last month (due to the surgery just doing phone consultations unless an emergency). She diagnosed 15mg of prednisolone and within the first 24 hours my symptoms had improved. Nearly a month later I’ve hardly got any symptoms😁 and this week she’s reduced the amount to 12.5 mg.\n\nAfter having one try at tapering earlier this year, this second (slower attempt) is so far going well and I’m now down to 3mg.\n\nI don’t really suffer with any PMR symptoms, although I do have more general aches & pains, but I’m thinking this is just part of getting old! \n\nFitness is key to me and I go into withdrawal if I miss a day.\n\nEveryone’s journey is so different and I find it interesting reading other people’s stories on here.  Onwards and upwards folks."
        },
        "Angelsmummy": {
            "tags": [
                "Sciatica",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Temporal arteritis (giant cell arteritis)",
                "Men's health",
                "Healthy eating",
                "Ageing well",
                "weightloss",
                "Women's health",
                "parenting"
            ],
            "demographics": {
                "joined": "2024-04-26",
                "age": "72",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hello,I have GCA with sight loss in one eye.Had 2 flares one probable GCA and the latest one PMR.Believe I had PMR for months before diagnosis of GCA.Currently awaiting to start TCZ after having bad reactions to MTX and Leflunomide.Am currently on 7 mg of pred a very quick taper because of increased eye pressure."
        },
        "Zebedee44": {
            "tags": [
                "Anaemia",
                "Polymyalgia rheumatica",
                "Pituitary tumour",
                "healthyeating",
                "Ageing well",
                "Women's health"
            ],
            "demographics": {
                "joined": "2017-02-10",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi, my name is Chrissie,  I’m living in East Sussex and have two grown up children living in Wales. As yet no grandchildren but ever hopeful. \nIt’s over six years  years since I learned about this strange condition which affects every aspect of my life and I don’t feel as if I am getting any closer to the end of this journey.  I was pretty much stuck at 8mg of prednisolone for four years and finally saw a Rheumatologist who prescribed leflunomide but after waiting to have my flu jab and Covid booster before starting it, posts on this forum made me reluctant to start it. \nSince diagnosis of PMR I have had a lot of pain in my jaw and feared some extra cranial GCA issues but in 2023 a referral to Maxillofacial finally indicated mechanical problems in the joint. So I persevered in tapering my prednisolone and was quite proud of myself for getting down to 5mg. \nIt wasn’t long before my body demanded more of the wonder drug that makes my life good and struggled with the nausea, fatigue and general flakiness of adrenal insufficiency. And the old aches and pains of osteoarthritis in my thumbs, hands, and wrist started making daily life very uncomfortable.  Acid reflux had caused a constant sore throat and I was referred for an MRI and gastroscopy which confirmed non cancerous polyps throughout my digestive system. \nThe MRI showed an enlargement of my pituitary gland and I have had multiple blood tests and eye examinations and waiting to see the Neurosurgeons in August 2024. I am now under Endocrinology as well and waiting for a short synacthen test in August.\nEarly in 2024 I developed what I thought was sciatica. This has continued to get worse despite exercise and has settled in my right hip and calf. X ray shows cam impingement but I have been referred for phsiotherapy as a start point.\nIn July 2024 The GP ran some blood tests and these indicate anaemia which might result from a blood protein disorder called MGUS, another thing I had never heard of.  I will know more when the results are released next month. It’s been a tough year."
        },
        "Lonsdalelass": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-10-11",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi, I am a 56 (soon to be 57) year old wife, mother and grandmother; I work part time now thank goodness, and have always been active and relatively fit before PMR struck although I was diagnosed last year with CKD. I live with my wonderful hubby and adorable collie, and our three offspring have all left home, one living across the pond in sunny Florida. Our daughter lives just down the road with our beautiful granddaughter who we see every week, and help out with childminding at times. I love it! I like walking and keeping fit when I can, also baking when the mood takes me. Its great to be in touch with so many people on this site.  UPDATE.... Aug 2022..i. now at zero pred!! Been here since May, so still early doors.  No major flares since diagnosis, unlike many on the forum sadly, so feel very lucky. Had 'blips' when I've needed to increase slightly  and taper back down, but finally got here to zero pred. Taking things slowly, and nothing for granted. Still pacing myself whilst trying to increase strength and stamina with walking a little more,  but no cycling or swimming or fitness classes yet. Have two beautiful grandchildren now."
        },
        "Polywotsit": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2011-11-24",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "A founder member of PMRGCAuk, and former Chair of Trustees, back in the day when we started this forum.   I have had PMR, but I haven't had GCA. I fell ill when I was 54 and was on steroids for three and a half years.  There were times when I almost lost hope that I would ever get better, but I remember that the day I stood up in the kitchen without having to crawl over to a chair to haul myself up - that was the turning point!  It's several years since I stopped taking the steroids and gradually I have regained 'normality', whatever that is.  PMRGCAuk doesn't have all the answers - but this community means we learn from each other, and support one another."
        },
        "Louisepenygraig": {
            "tags": [
                "Fibromyalgia",
                "Amitriptyline",
                "Pregabalin",
                "Migraine",
                "Osteoporosis",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Cluster headaches"
            ],
            "demographics": {
                "joined": "2017-10-29",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Live on a smallholding in the Conwy Valley in North Wales with my husband, daughter, son in law and three grandsons. Its a beautiful place to live and neither myself nor my husband want to move. However its not the easiest place to live, that's why we invited our younger daughter and her family to move in - she never really wanted to move out anyway! Our other daughter lives in the US  I have probably suffered from chronic fatigue for many years. I have suspected that I have Fibromyalgia for about 5 years now but wasn't diagnosed until August 2018 . Was diagnosed with polymyalgia rheumatica in April 17. Started on 20mg then down to 15 after 2 weeks. Have struggled to get lower but now (June 19) am eventually on 10mg. Now Feb 22 am on 5.5"
        },
        "Sandradsn": {
            "tags": [
                "Polymyalgia rheumatica"
            ],
            "demographics": {
                "joined": "2016-01-22",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I've been on the PMR journey for 5. 1/2 years.I am now on 0 mg of Pred having very gradually dropped to zero on 1/6/21.I started at 15mg.PMR started after a very very stressful 2 years at work,a nasty fall into Lake Garda in Italy,bad diet,bad sleep,root canal treatment??What a journey!Not sure who I am anymore😄.I'm married  and live in Sussex.We have 3 children and 3 grandchildren.I used to work full time as a dental nurse in a crazy busy NHS practice ,some weeks were 60 hours+!I gave up working Christmas 2017 as it was way too stressful there and making me feel very ill..I am now happily retired.I feel more relaxed,rested(most of the time) and try to pace myself doing things I enjoy!!"
        },
        "prunus": {
            "tags": [
                "Cataracts",
                "Temporal arteritis (giant cell arteritis)",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2018-09-11",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with GCA in November 2012.  At this point my CRP was 452. I was 75.  I had a relapse in January 2017. I have been off predisolone since the 9th March 2019.  Went back on predisolone in October 2019 and came off again at the end of January 2020. Had another relapse in December 2020. I am currently on 3mg of predisolone (since December 2020)"
        },
        "Rachmaninov2": {
            "tags": [
                "Pain",
                "Rheumatoid arthritis",
                "Irritable bowel syndrome (IBS)",
                "Heart attack",
                "Health anxiety",
                "Osteoarthritis",
                "Chronic kidney disease (CKD)",
                "Polymyalgia rheumatica",
                "Spinal stenosis",
                "High cholesterol",
                "High blood pressure (hypertension)",
                "Amlodipine",
                "Felodipine / Ramipril",
                "healthyeating",
                "Ageing well",
                "Women's health"
            ],
            "demographics": {
                "joined": "2020-08-09",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed some years ago with high cholesterol and then high blood pressure, I improved my diet including starting to use Benecol spread, but didn’t take any medication for the high blood pressure.\nAbout three years ago I felt very unwell one evening, symptoms were numb hands and arms, numb mouth and problems with my vision.\nI went to A and E where they found that my blood pressure was dangerously high, was kept in for that night and the next day when they carried out lots of tests. I was given Ramipril and Amlodipine to bring the blood pressure down and stayed on these, having bouts of excruciating migraines until approx. 5 months ago when my feet and right leg swelled up. When I saw a GP it was suggested that when I went to A and E I may have had a mini stroke.\n\nMarch 2020  I was very concerned as I couldn’t walk properly or get any shoes on. Soon after, the aches and pains began! Plus all the usual, not being able to turn over in bed etc. etc. I was prescribed various medications to address the problems but didn’t take them as I felt that the Ramipril and Amlodipine may have been responsible for the aches and pains as well as the swollen legs and foot.\nEven though I realised that you should not stop taking blood pressure medication without discussing it with your GP I did stop, and bought a blood pressure monitor. My blood pressure had stayed at a reasonable level until about three weeks ago when I realised that there was something very wrong with me and I stopped monitoring it because I was just concentrating on trying to find out what is wrong with me (I know that I need to start again)\nNow I also have burst blood vessels in a finger on one hand and also swellings on the palm of my hand, and also a claw like other hand with  pain going up the arm and swellings on the palm.\n\n\n\nDiagnosed with Rheumatoid Disease and PMR 2020 which are not under control . Some uncertainty about definite diagnosis.\n\nTold by Optician that I have blepharitis approx. 2021.\n\nDiagnosed with Scoliosis and Spinal Stenosis /Compressed Cauda Equina/Fractured Vertebrae 2022, had consultation with neurosurgeon in December 2022, operation on my spine recommended. \nStill waiting for letter and information about the operation following the consultation. Still waiting for result of DEXA scan. March 2023.\nDiagnosed with Osteoporosis. \n\nTaking 5mg Amlodipine for high blood pressure, 7mg Prednisolone for PMR, and 7  1/2 mg Methotrexate Metoject for inflammatory arthritis .\n\nDiagnosed with Benign Essential Tremor.\n\nDiagnosed with low functioning kidneys (Stage 3a CKD) in December 2022, no information, dietary advice or referral to a nephrologist. \n\nDiagnosed with anxiety and depression January 2023, awaiting CBT. \n\nMethotrexate paused due to a viral infection, February.\n\nDiagnosed with high cholesterol February GP recommended statins, no dietary advice.  Decided to decline for now.\n\nHave requested my GP to refer me for physio (for back and feet) currently being assessed March.\n\nPhysio is going to refer me to a podiatrist. \n\nStopped Amlodipine, hoping problems with feet/legs may improve a little. Started Losartan 50 mg a day instead. March.\n\nIncreased Prednisolone to 7 1/2 mg a day. Increased to 9mg a day March.\n\nMigraines, Amitriptyline 10mg 1 or 2 at night. \n\n24 March Heart attack.\n\n27 March Angioplasty.\n\nStopped Losartan.\n\nNeurological symptoms, trouble spelling words. \n\nNew medication regime, many new medications. Lansoprazole 30mg 1 a day, Bisoprolol 2.5mg 1 a day, Dispersible Asprin 75mg 1 a day, Ticagrelor 90mg 1 twice a day, Ramipril 2.5mg 1 a day, Atorvastatin 80mg 1 a day, Nitrolingual pump spray when needed. \n\nApril Cardiac Rehabilitation (Other health conditions preventing me from having Rehabilitation).\n\nMay First Homehelp visit. \n\nMay Post MI Clinic\n\nMay Physio Review/Starting exercises for spinal stenosis. \n\nEnd of May First session of CBT.\n\nBeginning of May Increasing Oedema, feet particularly badly affected. Finding it difficult to walk.\n\nJune 5 6 monthly Rheumatology appointment.  \n\nJune 5  Admitted to hospital with dangerously high blood pressure. In A and E for 17 hours, No sleep, very little food etc. plus heated ‘discussions’ with doctors and nurses re my medication not helping to lower blood pressure, in fact the opposite!\n\nJune 13  Medication review with GP pharmacist.\n\nJune  Assessed and approved for eligibility for pre filled Dosset Box. Hopefully beginning July 7. \n\nJuly  New medication regime.  \n20mg Pantoprazole 1 a day, 10mg Prednisolone a day, 75mg Dispersible Aspirin 1 a day, 7.5mg Ramipril a day,  2.5mg Bisoprolol  1 a day,  90mg  Ticagrelor 1 twice a day, 80mg Atorvastatin 1 a day, Nitrolingual pump spray when needed, 7.5mg sub cut Methotrexate a week, \n\nJuly 4  Follow up Rheumatology appointment. Hope to find out about the possibility of being prescribed a biologic. \nMy Rheumatologist has decided that I should start taking 7.5mg sub cut Methotrexate again alongside tapering Prednisolone. He also wants me to take Alendronic Acid (something I have tried to avoid) as I have osteoporosis. Will have another appointment with him in December.\n\nSeptember Podiatry appointment for assessment.\n\nSeptember 21 Pain Management appointment, referred for MRI.\n\nOctober 4 MRI scan.\n\nOctober 16 Telephone consultation with Neurosurgeon re possible laminectomy to help with spinal stenosis pain.\n\nOctober 19 Appointment with Pain Management consultant to discuss results of MRI.  Scan shows 2 ‘slipped discs’, Options would have been a laminectomy or a steroid injection but heart meds prevent either of these, so discharged back to rheumatologist’s care. If I am able to stop taking the blood thinner in March 2024 the operation may be a possibility. Disappointed as I feel that I am back to square one. \n\nOctober 25  A and E with high blood pressure, breathlessness and dull ache in chest. Diagnosed with Angina. \n\nNovember 16  Appointment for Cardiac Dobutamine Stress Echo test. Cancelled due to staff training day. No notification!\n\nNovember 21 Resumed taking Methotrexate after 4 week break. \n\nNovember 29 Podiatry appointment. Have cancelled and rebooked.\n\nDecember 7 Rescheduled Cardiac Dobutamine Stress Echo test. Have cancelled, awaiting new appointment.\n\nDecember 9 Increased Prednisolone from 10mg a day to 11mg a day. Finding pain difficult to deal with. \n\nDecember 12 Appointment with Rheumatology Consultant. Have been told to stop taking Methotrexate for good as yesterdays blood test showed abnormalities again. The Consultant has now prescribed Gabapentine for pain relief and is considering prescribing Leflunomide in a few months time depending on the results of ongoing fortnightly blood tests. He now thinks a lot of my pain is due to Osteoarthritis."
        },
        "Slowdown": {
            "tags": [
                "Stroke",
                "Type 2 diabetes",
                "High blood pressure (hypertension)",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2015-11-05",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "23rd September 2023\nPMR since 2015.  Current pred dose 9mg slowly reducing to 8.5mg over a month.  On Metformin since June for Type 2 steroid induced diabetes.  I lost heart over last winter,  my body became a riot of sun damage, SCCs, BCCs which all meant 'procedures' with stitches galore and Efudix, which I have used without problems on actinic keratoses.  One specialist prescribed this for a stubborn non-healing lesion on my eyelid - result was  an allergic reaction and several weeks of excruciating rawness and pain until I saw another consultant who stopped it immediately and prescribed Hydrocortisone.   Utter relief.      My biggest regret is not being able to swim in the river/sea due to healing wounds.  At least I can walk daily to gaze longingly at the waves.   And a little companion in the shape of a robin who flies to my hand to feed - well, he gets organic cheese and just can't say no. I've had 2 generations of robins, and blackbirds keeping me company.  Think it saved my sanity.\n\nMy GP finally referred me to a Rheumatologist last January - disasterous meeting.  His first words were 'I see no signs of PMR,  no inflammation indicators. Can you do this? (rising from chair; raising hands above head; etc.)  ' Yes, and surely the steroids are just doing their job at managing inflammation ...??' It got worse, he wasn't the consultant but a registrar with an agenda. ' We want you on Leflunomide, here's a leaflet, oh sorry we've run out, will send you one and make an appointment in another 6 months'.   'I'm reluctant to sign up to a drug I have very little information on and if I haven't got PMR can you suggest any other possibilities. RA?  '  but he ignored my obvious wish for a discussion and went off to see the Consultant for 10 minutes.  Icy politeness was all I could manage by then.    Still waiting for leaflet and appointment.  \n\nTwo strokes 2020, 2021, TIA March this year - wonderful Hospital doctor who linked these to possibly being migraine induced as MRI scans have never shown damage.  I haven't had migraines until the last couple of years, but they certainly became a very upsetting, if extremely colourful,  experience - optician called them the Prisoners Cinema type where the visions continue for around 20 minutes even with closed eyes.  Five consecutive  \n evenings of these last year at a time of stress, resulting in confusion and inability to use computer.  More research into this, ongoing.    I can only hope for a less, shall we say, 'eventful' and discombobulating winter ahead."
        },
        "agingfeminist": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisone",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2020-01-31",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Having eaten well and exercised forever, I suddenly developed severe PMR and then suspected GCA. I am now tapering after taking 60mg for a month.\nI would like to share experience with others who are tapering.  \nWhen did you encounter withdrawal symptoms and what were they?\nI still work about 5 hours a day (online) but collapse in afternoons and evenings with zero energy."
        },
        "Insight329": {
            "tags": [
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2017-07-11",
                "age": "N/A",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "My name is Joy.  I am in the Midwest, USA.  I’m 64 years old  and female.  I was diagnosed with GCA in May, 2017 by a Psychiatrist.  Yes, you read that right.  I was sitting in my best friend’s office, who happens to be a Psychiatrist.  She asked me how my headache was and I told her it was a BEAST and that I could not get rid of it.  I then pulled back my hair and said “And, what is this?” showing her the beaded vein by my temple.  Her eyes bugged out like a cartoon characters, she took a piece of paper, wrote on it, passed it to me and said “Go call your GP now and tell them that Dr. (her name) would like you to get Joy in today for possible G.C.A”.  I secured an afternoon appointment, my GP apologized for missing the diagnosis when I was there 2 weeks prior for the headache (and showed her the vein).  She explained that she had never seen G.C.A.  Although she did not feel qualified to treat it, she started me on 40 mg of Prednisone, and secured an appointment the next day with a Rheumatologist.  That was on a Monday and by that Thursday I had the biopsy, which was positive.  (Diagnosed with PMR February, 2018.) Previous medical history: low grade ovarian cancer (1990), Nissen Fundoplication for bleeding ulcer/hiatal hernia (10+ years ago).  I’m grateful to have found this forum!!!"
        },
        "Uglow": {
            "tags": [
                "Irritable bowel syndrome (IBS)",
                "Osteoporosis",
                "Magnesium",
                "Calcium",
                "Prednisolone",
                "Paracetamol",
                "Vitamin K2",
                "Shortec",
                "Accrete D3 tablets",
                "Polymyalgia rheumatica"
            ],
            "demographics": {
                "joined": "2021-02-25",
                "age": "71",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Previous lung cancer 6 years ago. Chemo. \nPmr 2021 osteoporosis have had a fragile fracture l. Hip pain undiagnosed. Lots of ups n downs. Currently on 8.5 mg Prednisolone decreasing to 8 mg I only go down 1/2 mg a time for 4/5 weeks depending on how I’m coping. \nI’m an no longer on blood thinners and pre diabetes is treated by diet as is cholesterol. Hardest thing to deal with is back pain osteoporosis I assume."
        },
        "Poshdog": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Ageing well",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2021-02-08",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Entering year 6 of pred for Pmr. Started at 15mg now on 4mg. Some ache in neck and shoulders  but am trading that against adrenal function. GP a bit cavalier, no blood test since November 2019 and being a coward and managing quite well have not wanted to raise the hair of the dog! Due to move so await attitude of new GP. Have had two AstraZeneca , and two Phizore arm sore but anti body test showed anti bodies  present. Live in hope that 'normal' life for all is just around the corner - but which corner?\nNow moved and split 3 generational household into 3 separate ones. Remained on 4mg throughout. One flare after covid 5 moderna jab. OH spent four months in hospital with endocarditis and failed heart surgery. Now home and things are calming....long may it last so am venturing down to 3.5 DSNS method. GP v hard to contact so DIY reduction with support of wonderful site."
        },
        "Karenjaninaz": {
            "tags": [
                "Asthma",
                "Irritable bowel syndrome (IBS)",
                "Atrial fibrillation",
                "Pulsed radiofrequency treatment",
                "Shingles",
                "Antiviral treatment",
                "Polymyalgia rheumatica",
                "Prednisone"
            ],
            "demographics": {
                "joined": "2019-03-09",
                "age": "82",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with PMR in November  2015 at 73. Got good relief from 15 mgm Prednisone within about 3 hours.\nIntervening illnesses - including shingles- caused modest interference with tapering save Oct 2021 when I had an asthma exacerbation , after allergy to the neomycin in the flu shot requiring mega steroids/ hospitalization. (Had been down to 5mgm pred with no PMR symptoms) Had to start slow tapering all over again. Still on O2 24/7 because of asthma and moderate restrictive lung disease from scoliosis.  Successfully completed pulmonary rehab and did get stronger. Continuing to exercise at home. \nDeveloped mild  psoriasis on legs and sore scalp(psoriatic).\nDeveloped rapid heart rate- atrial flutter with atrial fibrillation. Had a cardiac ablation April 15.  On 7 mg prednisone while recovering from that. Hope to resume taper soon. I started mild cardio. \nI live in NJ, USA and I am a retired nurse-anesthetist, nurse- practitioner. \nAge 82"
        },
        "Maisie1958": {
            "tags": [
                "Arthritis",
                "Methotrexate",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Weight loss",
                "fitness"
            ],
            "demographics": {
                "joined": "2015-06-21",
                "age": "N/A",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Diagnosed with PMR \nin May 2015 and living in the Midlands-  hopefully getting close to joining club zero now. \nEdited to say just diagnosed with seronegative Inflammatory arthritis May 2021. On methotrexate tablets 15mg  once weekly and around  4mg prednisolone daily as from July 2021-so far so good -decreasing Pred nicely again -3mg end October 21, now on 2.5mg Prednisolone \nLate February 2022, on 1mg or 0.5mg Prednisolone daily and 15mg MTX weekly and feeling good🤞 -proof will be when I try zero prednisolone- never managed it for any length of time previously. \nEdited mid July 22,  still in 15mg MTX and feeling fine. Last 0.5mg of Pred taken 10/05/22 ….almost 7 years from start to the day. Hopefully going on ok.  \nJune 23  still zero prednisolone and now on 10mg MTX each week and 5mg folic acid six days in the week.  Feeling fine -again fingers crossed."
        },
        "HappyDiamonds": {
            "tags": [
                "Osteoporosis",
                "Temporal arteritis (giant cell arteritis)",
                "High blood pressure (hypertension)"
            ],
            "demographics": {
                "joined": "2020-07-06",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm HappyDiamonds"
        },
        "Slosh": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Polymyalgia rheumatica"
            ],
            "demographics": {
                "joined": "2016-12-18",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Slosh"
        },
        "Greensleeves": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2012-12-09",
                "age": "63",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Diagnosed with PMR in September 2012 , \naged 50, …..started 15mg Prednisilone  in January 2013 ……\n, resisted until the pain and stiffness became unbearable.\n \nSuccessfully tapered off over 2 years, as advised by GP, but became very ill , as so often happens I still had PMR. \nRestarted at 30mg this time. \nSaw a rheumatologist, had all relevant tests , asymptomatic, no raised inflammatory markers . \nTapered to 5mg and stayed there for 3 years on advice of rheumatologist as a maintenance dose possibly forever. \n Still hoped  the PMR would burn itself out and adrenals would wake up. \nManaged to decrease further to 3mg , then 2mg myself. \nStayed at 2 mg for a long while, it was hard but I managed to care for unwell close family and my grandson. \nEverything went haywire when I caught Covid  in December 2020 and had to increase sick days Pred to 10mg , also had the fallout of 10 days of Dexamethasone in hospital after I was admitted with adrenal crisis. \nDeveloped Long Covid . \nTrying to stabilise again, currently doing an 7.5/7  taper . \nPMR has returned,  back at 10mg , haven’t been right since Covid. \nCan’t get below 7.5 without feeling like flu and the early days of PMR. \nHad a devastating bereavement, many health issues accompanying the grief . \n\nCovid infection again , requiring 20mg Pred October 2023.\n Completely wiped out, have to start tapering again once stable. \nExtremely disappointed. \nCan’t get below 7.5 without a flare or the feeling of the warning signs of adrenal crisis. \n10mg seems to be the lowest I can manage with all the stress , ill health and grief. \n\nI managed to stabilise at 7 but tapering to 6.5 was awful, 7 mg isn’t quite cutting it now. \nHave stayed at 7.5mg for several months after having a TIA in early September, finding it impossible to lower the dosage. Hardening of the arteries seen on head MRI . \nPain I can cope with to a degree , but have developed hip pain and irrational anxiety when on anything any lower than 7.5mg , which in turn creates more anxiety. Any stress results in nausea and feeling ill like flu . Pred , both a life saver and a demon."
        },
        "fmkkm": {
            "tags": [
                "Temporal arteritis (giant cell arteritis)",
                "Prednisone",
                "healthyeating",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2018-08-24",
                "age": "N/A",
                "gender": "N/A",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with GCA January, 2016. My symptoms started in October, 2015.\nI was under a lot of stress and not eating well at the time. My symptoms were a never ending bad headache, scalp tenderness, neck pain and extreme fatigue.\nI have never had success getting below 2.5 mg and I am currently at 3 mg prednisone."
        },
        "Viveka": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2021-04-24",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Hi! I'm Viveka"
        },
        "Smokygirl": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2019-07-02",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I am a very active 77 years young housewife living in N of England.   Husband has Parkinson’s.  PMR started fairly suddenly after two very long train journeys.  I diagnosed myself as my Mum had polymyositis  so I recognised the similarity and also the difference.  My GP said no, as my CRP was only 6.  I  Slowly became very  ill and incapacitated as my CRP rose steadily and finally both GP and myself gave in and started the Magic  Prednisalone on 27th July 2019.   Feel my old self now but know I am only at the beginning of my journey.  Photo  taken at Remembrance Parade   November 2019\n   Four years later—- can’t  believe I am now 81 years old!!"
        },
        "Louisa1840": {
            "tags": [
                "Polymyalgia rheumatica",
                "Methotrexate",
                "Bone health",
                "Prolia",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2017-11-19",
                "age": "N/A",
                "gender": "Female",
                "country": "Australia",
                "ethnicity": "N/A"
            },
            "bio": "Had PMR since May 2017.  Struggling with tapering below ten.  Started methotrexate a week ago. \n\nGave up on MTX.  Tried leflunomide but discontinued after losing feeling in my feet.\n\nCurrently on four mgs pred and staying there for now."
        },
        "Janann25": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2017-05-13",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was diagnosed with PMR on 8th May 2017 but now realise I have suffered with this for a long time. It was almost a relief to get the diagnosis. I also realise that I now start a long journey but I know the advice on this forum will help me get there.\nUpdate:\nA year after being diagnosed with PMR, I was also diagnosed with COPD but, because it was classed as MILD and just one inhaler kept symptoms under control, I never thought to mention it.  Anyway, in the last year, my symptoms have become worse but, because of COVID, Ive not been able to have a lung function test since I was first diagnosed.  But, Ive just had a telephone consultation over the phone with a respiratory nurse and she now informs me that my COPD is MODERATE. I still can’t get my head around how lung function tests can be diagnosed by phone!!!  Anyway, just to let you know that you will now find me on both forums."
        },
        "Coffeebeans": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2020-01-11",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Confirmed PMR March  2020 via PET-CT and taking Prednisolone. Symptoms started in October 2019 and  recognised in January 2020. Low carbing and open water swimming very helpful.  \n\nSecond opinion December 2020 confirmed PMR after further investigations.\n\nCurrently on 7mg Prednisolone."
        },
        "Rache": {
            "tags": [
                "Breast cancer",
                "Radiotherapy",
                "Lumpectomy",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2013-03-06",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "73 yr old female diagnosed with PMR in April 2019 and started on 15mg Pred.  Have had several health scares and worrying events about myself and close relatives over the past few years. Presently on 2mg.  Have moved into the osteoporosis range and have reluctantly accepted that I need an infusion or similar."
        },
        "Tiggy70": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2020-10-28",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with PMR in August 2020.  I had the classic symptoms of pain in my shoulders and then my hips which developed quickly in just over three weeks until I could barely dress myself.  I had chest and hip X-rays which were normal and blood tests which revealed an ESR of 44.  My Gp immediately put me on a dose of 15mg of Prednisolone.  After about 4 days I felt much better but had difficulty sleeping as I was told to take the Pred at night.   I changed this to a breakfast dose and my sleep improved.   My first Pred reduction was after 3 weeks to 12.5 mg.  Looking back I definitely had a flare on this dose but was told to persevere by the Rheumatology consultant.   After another three weeks I was told to reduce to 10mg.  Again another flare and back up to 12.5.  This has been the way my Pred journey has been.  I quickly realized from the posts on health unlocked that slow and steady is the way to go.  I struggled badly to get below 10mg of Pred but using the DSNS method I made it to 8.5 mg.  My Rheumatologist is insisting I reduce now by .5 mg per month.  I’ve tried twice to get down to 8 but the pain returns.  I am currently on 8mg but experiencing the worst pain since diagnosed in August 2020.  The consultant now wants me to take Methotrexate.  I am really against taking this drug yet.  I have type 2 diabetes and I’m currently on 9 prescription medications including Risedronate which the consultant insists I take and won’t refer me for a Dexascan.  I’m currently in a bad place with this illness and will write a post to hopefully get some advice.  I have read posts every day since Joining the forum in October 2020 and this site has been invaluable to me."
        },
        "lesley2015": {
            "tags": [
                "Fibromyalgia",
                "Amitriptyline",
                "Tinnitus",
                "Hearing tests",
                "Osteoarthritis",
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)",
                "healthyeating",
                "weightloss",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2015-08-02",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "pmr gca\nFibro\nTinnitus\nOsteoarthritis"
        },
        "Singr": {
            "tags": [
                "Polymyalgia rheumatica",
                "Temporal arteritis (giant cell arteritis)"
            ],
            "demographics": {
                "joined": "2017-12-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Singr"
        },
        "Bluey-1": {
            "tags": [
                "Transient ischaemic attack (TIA)",
                "Osteoporosis",
                "Atrial fibrillation",
                "Temporal arteritis (giant cell arteritis)",
                "healthyeating",
                "fitness",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2022-07-30",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Treatment started for GCA 29/6/22. Was ill with a cough, sore throat, headache 2 weeks prior to diagnosis, jaw pain when eating and weight loss. GP requested bloods; referred for MRI scan. Six hours later vision in both eyes disturbed intermittently. Twenty minutes later in eye casualty. CRP 171; ESR 129. Given aspirin / 60 mg steroids; contact made with stroke team, rheumatology. \n30/6 - 4/7, vascular scans, ECG, MRI. Stroke/TIA ruled out 2/4. GCA confirmed 5th July. Gradual tapering of pred  plus regular blood tests for CRP/ESR.\nAugust 2023 - TIA due to atrial fibrillation. Blood thinners (Edoxaban) and beta blockers added to the mix.\nJune 2024 - Increasing breathlessness, saw GP, bloods indicated heart failure! Echocardiagram, heart monitor showed atrial flutter and paroxysmal atrial fibrillation.\nSeptember 2024 - ablation, beta blockers changed .\nFebruary 2025. Currently on 6.5mg pred."
        },
        "Miserere": {
            "tags": [
                "Irritable bowel syndrome (IBS)",
                "Laxido",
                "Osteoarthritis",
                "Pain Killer",
                "Steroid injections",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2021-06-06",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I have not suffered any long term illness until now, so I have always been reasonably healthy, always a walker and I follow a healthy diet.  I began to notice some stiffness in my hips during my daily walk in February - after I had the first Pfizer vaccine.  This worsened to include shoulders and occasionally eased.  After the second jab it got worse and I reported it as a side effect of the vaccine to my dr who suggested blood tests and then suggested it could be PMR.  A second blood test taken and I am now on 15mg Prednisolone - started a week ago.  Symptoms 70% improved - I force myself out to walk every morning and I do a couple of yoga/somatic sessions each day.  Hoping to learn from others' experience and share any experience I have along the way.\nMarch 2023 - Referral to an orthopaedic surgeon raised regarding osteoarthritis in the knee and awaiting appointment.  Physiotherapy - 3 sessions so far - some exercises have strained ligaments.  \nNovember 2023 - aortic valve regurgitation following echocardiogram.\nI have suffered IBS-C for most of my life - I remember being taken to hospital with a 'stoppage' when I was pre-school age.  After that fed with castor oil, ex-lax chocolate, syrup of figs, senokot - anything mother could think of.  I have always suffered from constipation which GP eventually put down to IBS-C.  Improved somewhat following paleo/keto diet (very low carb) but after trying carnivore diet for a few days which improved things, I reintroduced other foods (mainly vegetables) and it has got much worse - hard, dry stools which are painful.  May have to return to Laxido."
        },
        "Amkoffee": {
            "tags": [
                "Arthritis",
                "Laparoscopy",
                "Chronic pain",
                "Pain management",
                "Osteoporosis",
                "Bronchiectasis",
                "Sleep apnoea",
                "Restless legs syndrome",
                "Polymyalgia rheumatica",
                "Alopecia",
                "Adrenal conditions",
                "Steroids",
                "Sjogren's syndrome",
                "Ageing well",
                "Women's health"
            ],
            "demographics": {
                "joined": "2017-04-10",
                "age": "N/A",
                "gender": "Female",
                "country": "United States",
                "ethnicity": "N/A"
            },
            "bio": "I first joined this site because the UK is so much more advanced and knowledgeable (then most US doctors) on the condition that I have called polymyalgia rheumatica. And I have found that some of my other conditions are being helped with the advice from other groups such as the Pain Group. And more recently the arthritis group."
        },
        "Exflex": {
            "tags": [
                "Coronary heart disease",
                "Percutaneous coronary intervention (PCI)",
                "Lung disease",
                "Polymyalgia rheumatica",
                "Prednisolone",
                "Idiopathic pulmonary fibrosis (IPF)",
                "Cardiovascular disease (CVD)",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2020-11-09",
                "age": "73",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "In my 4th year of PMR, starting dose of 15mg tapering in accordance with rheumatology guidance. Flared around 10mg with ups and downs and hospitalised due to adrenal insufficiency after playing football, but now down to 0.5mg as of Aug ‘23. My plan is to keep on tapering at 0.25mg every 5 weeks using the Dorset Lady slow taper."
        },
        "IdasMum": {
            "tags": [
                "Rheumatoid arthritis",
                "Steroids",
                "Metoject",
                "Polymyalgia rheumatica",
                "Methotrexate",
                "Prednisolone",
                "healthyeating"
            ],
            "demographics": {
                "joined": "2016-07-04",
                "age": "N/A",
                "gender": "Woman",
                "country": "France",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm IdasMum"
        },
        "Meggsy": {
            "tags": [
                "Polymyalgia rheumatica",
                "Prednisolone",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Meditation"
            ],
            "demographics": {
                "joined": "2018-08-04",
                "age": "80",
                "gender": "Female",
                "country": "Australia",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Diagnosed with PMR late Feb 2018 after 5 months of symptoms which began after a virus infection. Began 15mg Prednisolone,and upped to 25mg in April. It took three attempts to get past 10 mg. .5 mg tapers from then.  Presently on 7.5mg pred August 2019.\nRemained on 5mg for 4 to 5 months.\nBegan slow taper to 3mg 6 Sept. 2020. \nUpdate: Getting pains in hand, wrists and upper arms for a week so upped pred to 4mg on 17/11/20. \n\nHave developed histamine intolerance so avoiding high histamine foods as much as possible.\nIncreased to 5mg prednisolone 3rd Feb 21.\n\nUPDATE - 3rd Feb 23\nFrom 2.5mg I had to start tapering by 0.25mg.\nPresently doing slow taper from .75 to 0.5mg. \nIt has been a slow trip (5 years ) with only a few minor glitches - nothing major. Still waiting for return of hair.\n\nUPDATE - 20th June 24\nI took my last 0.25mg Prednisone on May 20.  April 2018 25mg to May 2024, 6 years 1 month..\n\nUpdate - 24th November 24\n6 months since my last Pred dose and all’s well so far. Feeling stronger as time passes."
        },
        "Gaijin": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-04-30",
                "age": "74",
                "gender": "N/A",
                "country": "Spain",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Gaijin"
        },
        "stellafmdm": {
            "tags": [
                "Chronic obstructive pulmonary disease (COPD)",
                "Polymyalgia rheumatica",
                "Prednisolone"
            ],
            "demographics": {
                "joined": "2017-12-14",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Predjunkie"
        }
    },
    "/bhf": {
        "MichaelJH": {
            "tags": [
                "Pain",
                "Diabetes",
                "Tinnitus",
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2017-11-04",
                "age": "N/A",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Quadruple bypass in June 2018 after a year of delays, severe angina and breathlessness. Now limited by arthritis!\n\nUpdate July 2020. BKA (below knee amputation) to the left as a result of complications of PAD (Peripheral Arterial Disease). Sadly those who should be helping me most are hoping me least to get back on my feet (intentional cynical pun)!"
        },
        "Milkfairy": {
            "tags": [
                "Migraine",
                "Botox",
                "Raynaud's phenomenon",
                "Myocarditis",
                "Acute coronary syndrome",
                "Morphine",
                "Heparin",
                "Glyceryl Trinitrate",
                "Coronary vasospastic disease",
                "Transcutaneous electrical nerve stimulation (TENS)",
                "Lansoprazole",
                "Diltiazem",
                "Clopidogrel",
                "Oxygen Therapy",
                "Pravastatin",
                "Isosorbide mononitrate",
                "Rosuvastatin",
                "Nebivolol",
                "Nicorandil",
                "Ranolazine"
            ],
            "demographics": {
                "joined": "2018-01-18",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I have lived with vasospastic angina since 2012. \nMicrovascular and coronary artery spasms. \nMigraine and Raynaud's Phenomenon.\n\nMy vasospastic angina doesn't respond well to medication. I am admitted to hospital about twice a year with unstable vasospastic angina ( acute coronary syndrome).\n\nI am treated with IV GTN and morphine for 10 to 12 days.\n\nI am a co author with cardiologists & researchers of several published medical papers about, microvascular and vasospastic angina & women living with heart disease. \n\nA co applicant & expert by experience to research studies,  patient representative to the BHF, NHS, British Cardiovascular Society, Biomedical Research Council & NIHR Research Champion. \n\n\n\nhttps://internationalheartspasmsalliance.org/"
        },
        "Qualipop": {
            "tags": [
                "Fibromyalgia",
                "Opioids",
                "Peripheral neuropathy",
                "Opiates",
                "Lymph node removal",
                "Diverticular disease and diverticulitis",
                "Pain Killer",
                "Spinal stenosis",
                "Steroid injections",
                "Degenerative disc disease",
                "Pelvic adhesions",
                "Neurological conditions"
            ],
            "demographics": {
                "joined": "2018-08-21",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Qualipop"
        },
        "Lezzers": {
            "tags": [
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2017-11-18",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Lezzers"
        },
        "BeKind28-": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2023-06-04",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm BeKind28-"
        },
        "Sunnie2day": {
            "tags": [
                "Angina",
                "Bisoprolol",
                "Nitrolingual pumpspray",
                "Pericarditis",
                "Diuretic",
                "Rheumatic heart disease",
                "Cardiovascular disease (CVD)",
                "Aortic valve disease",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-05-09",
                "age": "68",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Retired lady aged mid-60s, half American (born there to ex-pat parents, worked entire career there as well), whole British (Scottish) retired permanently to NE Scotland. \n\nHave: Angina with normal coronaries (confirmed November 2019 by angiogram and right heart study, the cardiologist now suspects microvascular angina), recurrent pericarditis, pericardial effusion and scarring, Aortic valve scarring ('trivial for now' says the cardiologist), and Rheumatic Heart Syndrome (RHS) from a childhood rheumatic fever (early 1960s). \n\nI also have Essential Tremor (now moving to my voice, blast it) and what my consultant calls the mildest case ever of rheumatoid arthritis both thanks to the RHS, plus Thoracic Outlet Syndrome (car wreck 1973 related nerve damage), and finally, PCOS.\n\nA MedicAlert bracelet with the engraving as doctor suggested (Angina With Normal Coronaries, Recurrent Pericarditis) has been a huge boost to confidence knowing 'if something happens' a First Responder will be able to read the bracelet and access my health record. I never take it off and have a spare in the jewellery box."
        },
        "080311": {
            "tags": [
                "Heart Health",
                "Aspirin",
                "Bisoprolol",
                "Heart surgery",
                "Furosemide",
                "Candesartan"
            ],
            "demographics": {
                "joined": "2019-12-30",
                "age": "77",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Had open heart surgery in August 2016 aortic valve replaced also bypass done. Feel ok get tired but that could be my age! Try to power walk a couple times a week but we live in Scotland so some days have to do a walk in the house! 5 weeks after my op my husband had a big stroke lost his left side and part of his sight, so I became his full time career. The last 3 years have been challenging but a sense of humour goes along way. The treatment I received was incredible the hard working team who took such good care of me can’t thank them enough. NHS you are fantastic. Also received a lot of reading material and video to watch from BHF, which I found really helpful."
        },
        "Prada47": {
            "tags": [
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2017-06-13",
                "age": "67",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm Prada47"
        },
        "Yumz199725": {
            "tags": [
                "Anxiety",
                "Mirtazapine",
                "Asthma",
                "Clenil modulite",
                "Tinnitus",
                "Lung disease",
                "Salbutamol",
                "Cardiovascular disease (CVD)",
                "Acid Reflux",
                "Omeprazole",
                "Coarctation of the aorta",
                "Heart surgery",
                "Verapamil",
                "weightloss",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2022-11-16",
                "age": "27",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was born with congenital heart disease which caused coarctation of the aorta which I had repaired when I was a day old and bicuspid aortic valve with moderate to severe AS, moderate to severe AR and small restrictive perimembranous ventricular septal defect .I'm 25 now I have had heart surgery  ( coarctation repair : resection and extended end to end anastomosis) when I was day old  and a heart procedure in 2011 with a( 16mm Tyshak balloon) when I was 13. I was being seen at Great Ormond Street till I was 17 and have been with St barts for bout 8 years I have a yearly check up and I have one coming up it's by telephone appointment on 28th. My condition is stable and I'm currently taking verapamil 40mg for my palpitations. I'm a carer for my brother aswell 😁.\n\nMarch 2020 after being in hospital for 2 weeks my anxiety rose to a whole new level so I spoke with a phycaitrist over the phone who told me to take up a hobby and get out more, then fast forward to April I literally couldn't sleep my anxiety was keeping me awake it was like my mind was working at a 100 miles an hour while I was trying to sleep so  made the descion to go to the GP and was prescribed mirtazapine 15mg, still have anxiety attacks and days where its better then others.\n\nI had the worst abdominal pain and bloating I've ever experienced in my life, my acid reflux was affecting me so much was pushing my ribs out and causing so much discomfort! It was affecting my breathing so much. I had to go to the doctors and was prescribed omeprozole 20mg but still wasn't helping so few months later was put on 40mg and that's helped calm down alot."
        },
        "Handel": {
            "tags": [
                "Diabetes",
                "Insulin",
                "Atrial fibrillation",
                "Lung disease",
                "Type 1 diabetes",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2018-06-26",
                "age": "72",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm Handel"
        },
        "Heather1957": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-06-23",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Started having chest pains in 2016 which even I diagnosed as angina. however the first GP I saw decided it was acid reflux! I waited a week or 2 and saw a more switched on GP who had some knowledge of cardiology and he decided I should be referred to a cardiologist. Anyway, in January 2017 I had an angiogram (followed by a stroke 4 days late but 98% recovered) and there was a blockage in my LAD and it was decided that due to the position of this blockage I would need a bypass.\nIn June 2017 I had a single bypass using my mammary artery and was discharged after only 4 days.\nRecovery went very well and all was fine until September last year (2021) when I started having some 'twinges', in October they became worse and I realised I had angina pain again and after a phone conversation with my GP was told to go straight to A & E which I did.\nI appreciate that A & E doctors cannot be experts in everything but from 2 pm Monday until about 9 am Tuesday I kept being told that I had acid reflux (deja vu). I stuck to my guns and was eventually admitted to a ward later that Tuesday.\nI was seen by a cardiologist on the Wednesday who told me I would be transferred to another hospital for an angiogram which I was on the 22nd October (Friday)\nThe angiogram revealed a blockage of the RCA which to their surprise was badly calcified so I had to have the artery drilled out to fit 2 stents.\nI was kept in overnight and discharged on the Saturday.\n3 full months later I am feeling good but very aware that things can change.\nMy motto is listen to your body as you know it better than anyone else and stick to your guns if you know something to be true even if the doctors tell you it isn't."
        },
        "Tos92": {
            "tags": [
                "Microvascular angina",
                "Coronary vasospastic disease",
                "Diltiazem",
                "Glyceryl Trinitrate"
            ],
            "demographics": {
                "joined": "2023-01-30",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed with vasospastic angina after a coronary artery spasm triggered a MINOCA (myocardial infarction in non-obstructed coronary arteries) in January 2022 whilst on holiday. \n\nAlso diagnosed with having a myocardial bridge, a congenital heart defect which is thought to be the cause of the coronary artery spasms. \n\nRecent diagnosis of microvascular angina (MVA) in Jan 2024, in addition to the CAS."
        },
        "SpiritoftheFloyd": {
            "tags": [
                "Heart failure",
                "Cardiovascular disease (CVD)",
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2019-05-20",
                "age": "70",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm SpiritoftheFloyd"
        },
        "Chappychap": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "fitness"
            ],
            "demographics": {
                "joined": "2018-11-08",
                "age": "N/A",
                "gender": "Male",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Chappychap"
        },
        "Kristin1812": {
            "tags": [
                "Irritable bowel syndrome (IBS)",
                "Heart attack",
                "Coronary heart disease",
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2017-06-26",
                "age": "N/A",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "In 2012 I was still working and noticed I was getting a little forgetful, and breathless. In that year I had three heart attacks, and many emergency admissions, angiograms , and  9 Stents fitted. Started rehab three times. It then took many changes of meds to now have both stable and unstable angina more under control.  I have leaky valves, being monitored, and recently some emergency Atrial Fibrillation events.\nNow I’m retired and exercise at classes three times a week, and walk most other days, \nThis year has been the most stable for me, heart wise.\nI am most interested in our psychological adjustment to serious health problems."
        },
        "Alison_L": {
            "tags": [
                "Acoustic neuroma"
            ],
            "demographics": {
                "joined": "2018-07-24",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I had a silent heart attack in 2018 (age 56), which was picked up by my GP when I saw her after 3 weeks of \"gastro problems\". I spent most of the next month in hospital, coming out with a shiny stent and a shinier ICD. In 2019 I had a second angioplasty with a balloon inserted. Current (2023) meds: Eplerenone, Lansoprazole, Aspirin, Candesartin, Isosorbide, Carvedilol, Rosuvastatin, Empagliflozin, Vitamin D. Also Furosemide as & when.\n\nSince the heart attack in 2018 I have piled on the weight, despite going to the gym and regular cycling (2022 did London-Brighton) and other exercise, and am now Type II Diabetic, with Diabetic Peripheral Neuropathy in my feet and lower legs. GP not interested. The Empagliflozin is both a heart and diabetes drug, so not on any other drugs.\n\nSuddenly went deaf in right ear Nov/Dec 2020. Had MRI Feb 2022, and diagnosed with small/medium sized Acoustic Neuroma. This had grown from 1cm to 1.5cm (mainly a cyst that was growing on the tumour) in the 6 months to Sept 2022, so was offered translab surgery which I turned down (partly because I couldn't afford the recovery time), so was offered Fractionated Stereotactic Radiotherapy (FSRT) instead. 5 weeks of short daily blasts Mon-Fri. Completed Feb 2023. Now awaiting follow-up MRI in May to see if that's worked. UPDATE: MRI showed the cyst  had shrunk. Neuro-oncologist very happy and will see me after a repeat MRI Feb 2024 (a year after radiotherapy). Woop woop! 2024 UPDATE: MRI showed continued shrinkage, and neuro-oncologist still very happy. Next repeat MRI early 2025."
        },
        "Thanksnhs": {
            "tags": [
                "Arthritis",
                "Co-codamol",
                "Osteoporosis",
                "Accrete D3 tablets",
                "Osteoarthritis",
                "Psoriasis",
                "Dovobet",
                "healthyeating",
                "Women's health"
            ],
            "demographics": {
                "joined": "2020-07-14",
                "age": "66",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi all, I had arrhythmogenic cardiomyopathy caused by a faulty gene and severe heart failure, I received a transplant on 26th July 2020 which totally changed my life, it was a bit of a long haul getting over the operation and getting used to the regime with the immunosuppressants but now it's just part of life, all is fine with my heart at moment. I can't thank all the teams at the golden jubilee in Glasgow, enough for all the care and attention I received, they were amazing.\nAfter everything I went through with my heart in December 2023 I was diagnosed with bowel cancer it was picked up in the routine test that everyone of a certain age gets. Once again NHS Scotland sprung into action within a couple of weeks tests and scans were done and I was booked in for surgery, where the tumour was situated they had to take away the whole right side of the bowel, the lymph nodes and then join it back up. The operation was a success and they have said that the cancer hasn't spread and I am now recovering slowly 🙄 it was difficult for the surgeon and anaesthetist because of previous hysterectomy surgery and of course my transplant they tried keyhole but had to switch to open surgery as they encountered some problems. \nI also have osteoporosis arthritis and peripheral neuralgia. I think of myself as being a little bit unlucky 🙄 Char"
        },
        "MountainGoat52": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Aspirin",
                "Bisoprolol",
                "Omeprazole",
                "Lansoprazole",
                "Ramipril",
                "Atorvastatin",
                "Diltiazem",
                "Simvastatin",
                "Losartan",
                "Amlodipine",
                "Nifedipine",
                "Furosemide",
                "Heart bypass",
                "Bendroflumethiazide",
                "Pravastatin",
                "Doxazosin",
                "Vitamin B9",
                "Rosuvastatin",
                "Indapamide",
                "Ezetimibe",
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2019-09-29",
                "age": "73",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Blood clot, heart attack, stents 2017. Elective triple bypass 2018."
        },
        "RufusScamp": {
            "tags": [
                "Heart failure",
                "Bisoprolol",
                "Pacemaker",
                "Eplerenone",
                "Sacubitril / Valsartan",
                "Cardiovascular disease (CVD)",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2020-11-01",
                "age": "73",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Retired science and maths teacher, usually active and healthy until heart failure diagnosed in 2019 with a chest infection. Coping reasonably well, but experiencing muscle weakness. I have good and bad days, and often feel very tired, but I don't sleep well."
        },
        "Lowerfield_no_more": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2023-06-02",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Lowerfield_no_more"
        },
        "devonian186": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2022-04-20",
                "age": "N/A",
                "gender": "Male",
                "country": "N/A",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Hi! I'm devonian186"
        },
        "skid112": {
            "tags": [
                "Heart attack",
                "Medication monitoring",
                "Cardiovascular disease (CVD)",
                "Bisoprolol",
                "Candesartan",
                "Coronary artery bypass graft (CABG)"
            ],
            "demographics": {
                "joined": "2017-06-14",
                "age": "N/A",
                "gender": "Male",
                "country": "Spain",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Mark, 61 heart attack and quad bypass survivor from October 2016. Full of mostly useless information with the occasional nugget"
        },
        "fishonabike": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2022-08-30",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm fishonabike"
        },
        "Ianc2": {
            "tags": [
                "Lactose intolerance"
            ],
            "demographics": {
                "joined": "2017-02-01",
                "age": "N/A",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "At age 55 I suffered breathlessness, followed by inability to exercise driven by an erratic heartbeat, followed by open heart surgery to repair valves, remove atrial appendage and carry out a mini maze procedure may 2014 age 69.   followed  by  Recovery  with A. flutter re-establishing itself, leading to an ablation in the following year.  Still have afib but my cardiologist tells me that I tolerate it remarkably well.  I exercise regularly, drink very little (it is a trigger for me) and try and keep my weight within my BMI. I avoid gluten and have recently stopped eating lactose products, in order to very effectively stop belching. I am 73, retired and enjoying life, touch wood."
        },
        "laura_dropstitch": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-06-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi, I'm Laura and I was diagnosed with heart failure when I was 31 years old and 31 weeks pregnant.  My condition was managed very well with medication and a CRT-D device for ten years before my health deteriorated and I had to have a heart transplant in November 2021. That experience has been much tougher than I'd imagined and I still haven't fully recovered. When I'm not signed off sick (!) I'm working on a PhD, researching fictional/creative representations of chronic heart conditions and how those relate (or don't relate) to patient experience. I can often be found asking other users of this forum to share their experiences in the form of a haiku :)"
        },
        "jimmyq": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-03-13",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "In 1995 I had a virus that shattered my health. I had quadruple by-pass surgery in 1997. Spring 2016 I had a virus that left me with a cough and soaring blood pressure. That was treated with drugs. At Christmas 2017 I had Australian flu. This was immediately followed up with a mini-stroke in my left eye, leaving me blind in that eye. Tests showed that while my right carotid artery is clear my left one is blocked. \nI read the book \"How Not To Die\" and embarked on a new diet: no animal products, no salt, nothing with added sugars, no fried food. The only oils are from nuts and seeds. It is working: my weight is dropping as is my BP and cholesterol level."
        },
        "gilreid1": {
            "tags": [
                "Heart attack",
                "Angioplasty",
                "High cholesterol",
                "Statins",
                "Men's health",
                "fitness"
            ],
            "demographics": {
                "joined": "2020-01-20",
                "age": "67",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "October 2019 had a triple bypass operation now on the road back to near normal life. \nThanks NHS and cardio team at ARI"
        },
        "Ageingfast": {
            "tags": [
                "Aortic stenosis",
                "Valve replacement",
                "Low carbohydrate diet"
            ],
            "demographics": {
                "joined": "2020-06-13",
                "age": "77",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Paid for surgery to replace aortic valve, op was 2nd May 2020.\nNo follow up in respect of rehab etc as everything is closed.\nMarried, retired."
        },
        "Heyjude31": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2021-10-01",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Experienced heart attack resulting in heart bypass surgery . I was discharged from hospital a few days ago, September 2021"
        },
        "Fluffybee": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2020-05-26",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I am a very happy, bubbly, outgoing sort of person.\nLove helping people, also an \nanimal  lover especially dogs.\nFrom the end of last year I started having chest pain and breathlessness, few trips to A&E clear angiogram, echo showed heart not pumping effectively few abnormalities on the ECG. \nHaving a steep learning curve for micro vascular angina and coronary artery spasms. 😢"
        },
        "Shoshov": {
            "tags": [
                "Type 2 diabetes",
                "Dapagliflozin",
                "healthyeating",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2018-06-12",
                "age": "66",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "hi guys. back after a prolonged absence. since we last spoke i now have 5 stents. most recent angio showed all major arteries are looking great and they were able to clear a smaller artery with the ballon ehich was great as i believe thats the one that has been causing si much pain for the last few years. fingers crossed no angina since proceedure in august. still fighting to keep weight off. trying to keep up my walking but havent bounced back the same this time and am struggling. hope your all doing well♥️shiona"
        },
        "Happyrosie": {
            "tags": [
                "Pain",
                "Pain Killer",
                "Arthritis",
                "Breast cancer",
                "Radical mastectomy",
                "Tinnitus",
                "Osteoarthritis",
                "High blood pressure (hypertension)",
                "Lacidipine"
            ],
            "demographics": {
                "joined": "2016-10-06",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I’m a happy lady in my late seventies"
        },
        "Cee-Cee1": {
            "tags": [
                "Heart attack",
                "Medication monitoring",
                "Bypass surgery",
                "Cardiovascular disease (CVD)",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2022-05-28",
                "age": "65",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "NStemi January 2022, triple bypass February 2022"
        },
        "Anon2023": {
            "tags": [
                "Stroke",
                "Thrombectomy",
                "Post-traumatic stress disorder (PTSD)",
                "Psychotherapy",
                "Medication monitoring",
                "Atrial fibrillation",
                "Cardioversion",
                "Heart failure",
                "Bisoprolol",
                "Spironolactone",
                "Entresto",
                "Dapagliflozin",
                "Sleep apnoea",
                "Continuous positive airway pressure (CPAP)",
                "Sepsis",
                "Antibiotics",
                "Clostridium difficile infections",
                "Cardiovascular disease (CVD)",
                "Endocarditis",
                "Surgery",
                "Flucloxacillin",
                "Mitral valve disease",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2022-03-04",
                "age": "53",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was fit and well until April 21 then it all went downhill. Two OHS (for mitral valve replacements), a stroke, sepsis, endocarditis, cdiff and now heart failure and PTSD to boot."
        },
        "Heythrop51": {
            "tags": [
                "High blood pressure (hypertension)"
            ],
            "demographics": {
                "joined": "2019-09-29",
                "age": "N/A",
                "gender": "Male",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Recently found to have raised cholesterol and HbA1c in pre-diabetic range. Also being overweight I have decided to take myself in hand and joined the forum."
        },
        "Calliope153": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-08-06",
                "age": "N/A",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Calliope153"
        },
        "stevejb1810": {
            "tags": [
                "Coronary heart disease",
                "Bisoprolol",
                "Ramipril",
                "Atorvastatin"
            ],
            "demographics": {
                "joined": "2017-10-28",
                "age": "67",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi.  \n\nMy name is Steve.  At the end of April 2017, I retired from full time employment after 42 years spent working in the Pharmaceutical industry.  Six months into my retirement, in the middle of October, I had an angiogram and 8 days later, one day after my 60th birthday, I had a triple CABG at the excellent Basildon Cardiothoracic Centre.  \n\nLike just about everyone else, I didn't see my triple CABG coming.  I was in denial right up to the point the cardiologist told me I needed a triple bypass and that they were going to admit me immediately, and even then it took a bit of 'digesting'!  I have some family history but thought I was reasonably 'healthy'.  Like many, I was moderately active,  a little overweight, liked an occasional beer or glass of wine but I probably sat in front of one screen or another a little too much.  Even so, my blood pressure was in the normal range and I was taking a low dose statin for raised cholesterol, but nothing to write home about, at least so I thought.\n\nSo, now I'm something of a new man.  I exercise 5 days in 7, eat very healthily (and dropped out the cakes and biscuits), I've lost 8kg in weight and I'm fitter now than I have been in years.  After just 4 months (I'm writing this in February 2018), I'm back working (for myself), I've travelled long haul and life is beginning to feel 'normal'. I try not to take anything, certainly not my health, for granted.  I have to guard against trying to do too much and being some sort of superman.  I'm a work in progress and expect to be that for a very long time to come."
        },
        "buddy2blue": {
            "tags": [
                "Atrial fibrillation",
                "Sotalol",
                "Heart failure",
                "Pacemaker",
                "Heart surgery",
                "Percutaneous coronary intervention (PCI)",
                "Congenital heart disease",
                "Clopidogrel",
                "Cardiovascular disease (CVD)",
                "weightloss"
            ],
            "demographics": {
                "joined": "2020-01-16",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I was born with tricuspid atresia and pulmonary stenosis.  I’m 36 and have had meany ops. My first was my shunt at 6 months old. I then had a fontan op when I was 7 years old. I Unfortunately suffered a cardiac arrest shortly after and was 20 minutes without oxygen. I was left very badly brain-damaged at the time and had to learn to do everything all over again. I also have a duel pacemaker and two stents in my Pulmonary archery. I’m now starting the long and difficult transplant Road. I am now also in Permanent AFIB"
        },
        "Deejay62": {
            "tags": [
                "Atrial fibrillation",
                "Edoxaban",
                "Heart failure",
                "Spironolactone",
                "Ezetimibe",
                "Entresto",
                "Dapagliflozin",
                "Bumetanide",
                "Arrhythmia",
                "Bisoprolol",
                "Pulmonary hypertension",
                "Dilated cardiomyopathy",
                "healthyeating",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2023-02-03",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi my name is Diane and I am a 63 yr old lady. I have dilated cardiomyopathy and now I’m in stage 3 heart failure. \nI also have various arrhythmias such as AFib, Atrial and Ventricular Tachycardia.\nI have a CRT-D fitted and I’m on Entresto heart failure medication along with other heart failure cocktail of medications.  I had an AVnode ablation. \n I have been diagnosed with severe pulmonary hypertension. \nMy heart function is currently 23%. It went to EF43%  20yrs ago to 10% 5 yrs and now it’s 23% after being put on various medications."
        },
        "Maisie2014": {
            "tags": [
                "Heart attack",
                "Coronary angioplasty and stent insertion",
                "Arthritis pain",
                "Physiotherapy",
                "High cholesterol",
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2019-04-03",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm Maisie2014"
        },
        "Valentina98": {
            "tags": [
                "Anxiety",
                "Medication monitoring",
                "Clinical depression",
                "Underactive thyroid (hypothyroidism)",
                "Blood tests",
                "Heart attack",
                "Percutaneous coronary intervention (PCI)",
                "Pneumonia",
                "Antibiotics",
                "Attention deficit hyperactivity disorder (ADHD)",
                "Atrial fibrillation",
                "Electrocardiogram (ECG)",
                "Angina",
                "Trangina XL",
                "Carpal tunnel syndrome",
                "Myocarditis",
                "High blood pressure (hypertension)",
                "Ramipril",
                "healthyeating",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2022-10-03",
                "age": "26",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I'm a 25 year old history teacher. I've recently had a heart attack and discovered a few other health conditions. \n\nI love running and regularly did 5k's  before my heart attack I'm hoping to do a 10k this year"
        },
        "Blearyeyed": {
            "tags": [
                "Pain",
                "Physiotherapy",
                "Paracetamol",
                "Tramadol",
                "Gabapentin",
                "Hydrotherapy",
                "Cetirizine",
                "Cyclizine",
                "Musculoskeletal manipulations",
                "Indomethacin",
                "Midodrine",
                "Fibromyalgia",
                "Amitriptyline",
                "Pregabalin",
                "Cognitive behavioural therapy (CBT)",
                "Irritable bowel syndrome (IBS)",
                "Buscopan",
                "Lactulose",
                "Turmeric extract",
                "Migraine",
                "Tachycardia",
                "Propranolol",
                "Sumatriptan",
                "Ivabradine",
                "Trigeminal neuralgia",
                "Magnesium",
                "Uveitis",
                "Prednisone",
                "Fluorometholone",
                "VitA-POS eye",
                "Skin or nail infections",
                "Fucidin cream",
                "Ehlers-Danlos syndromes",
                "Naproxen",
                "Occupational therapy",
                "Vitamin K2",
                "Collagen",
                "Postural Orthostatic Tachycardia Syndrome (PoTS)",
                "Chronic migraine",
                "Men's health",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2018-04-20",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Years of struggle for a diagnosis for all of my symptoms and flare ups meant I didn't have a full picture of my chronic health issues until my 50th year.\nI am now trying to walk the medical minefield of discovering how to get the best treatment I can for the varied and uncommon conditions I have while coping with the lack of knowledge in the Healthcare System for my conditions.\nTwenty five years on from my conditions impacting on daily life .... Time is ticking ,  I have now been diagnosed with Ehlers Danlos Syndrome (Classic Like), Chronic Dysautonomia (in the form of SNRT and POTs ) , Tachycardia, Atrial Fibrillation, Recurrent cardiac and cerebral vasospasms have decided to develop off the back of this Autonomic Dysfunction , Fibromyalgia, IBS -C and gastrointestinal dysmotility, Functional Vitamin B12 Deficiency Anaemia and Folate Deficiency with Neurological complications came next  which provoked checks and diagnosis of Pancreatic Enzyme Insufficiency and Familial HyperCholesteroleimia, Chronic Pain , Fatigue , Full Chronic Migraine Spectrum and Cluster Headaches and Eye issues along with a syndrome for every letter of the alphabet triggered by the above ( if you will let me have queasy for Q) and as an artist I cannot afford to be Blearyeyed.\n\nOpen for all the advice and support I can get , and willing to give any help I can to fellow sufferers on the long and stressful road to diagnosis and coping with getting the best out of each day with the ,\"New Normal\" of Chronic illness.\nGood luck to all and let's laugh , cry and work together for a better way to good health. Love Auntie Bee"
        },
        "lettingoffsteam": {
            "tags": [
                "Arrhythmia",
                "Propranolol",
                "Ramipril",
                "Amlodipine",
                "Cardiovascular disease (CVD)",
                "High blood pressure (hypertension)",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-03-23",
                "age": "60",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Diagnosed with very high blood pressure and left ventricular hypertrophy 2019"
        },
        "cowparsley": {
            "tags": [
                "Chronic obstructive pulmonary disease (COPD)",
                "Inhalers",
                "Atrial fibrillation",
                "Heart failure",
                "Pacemaker",
                "Candesartan",
                "Bisoprolol / Hydrochlorothiazide",
                "Small cell lung cancer",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-05-03",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I’m fighting it. Excercising, diet mental positivity"
        },
        "Wooodsie": {
            "tags": [
                "Rheumatoid arthritis",
                "Pain Killer",
                "Coronary heart disease",
                "Aspirin",
                "Bisoprolol",
                "Statins",
                "Angina",
                "Glyceryl Trinitrate",
                "Men's health",
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2019-10-04",
                "age": "68",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi, I'm Steve and my photo is in support of Sljp0000. I'm living the brighter side of life 😀"
        },
        "10gingercats": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2015-06-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm 10gingercats"
        },
        "DWizza": {
            "tags": [
                "Heart attack",
                "Heart bypass",
                "Coronary artery bypass graft (CABG)",
                "Men's health",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2023-07-15",
                "age": "62",
                "gender": "Man",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Nstemi heart attack and quadruple bypass July 2023"
        },
        "Fredders": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-07-21",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Fredders"
        },
        "NorthantsSteve": {
            "tags": [
                "Heart attack",
                "Aspirin",
                "Bisoprolol",
                "Lansoprazole",
                "Ramipril",
                "Atorvastatin",
                "Glyceryl Trinitrate",
                "Percutaneous coronary intervention (PCI)"
            ],
            "demographics": {
                "joined": "2018-10-22",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I had a heart attack out of the blue in November 2016 followed by a stent age 55.  None of the usual indicators that I was going to have one. Returned to work after 6 weeks. I’m a great supporter of cardio rehab and the NHS."
        },
        "HHH2017": {
            "tags": [
                "Pain",
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2018-02-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Acute Myopericarditis"
        },
        "Bingo88": {
            "tags": [
                "Men's health",
                "healthyeating",
                "Ageing well",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2019-08-07",
                "age": "69",
                "gender": "Man",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hello everyone. My names Brian. Age 67.Had CKD for 20 plus yrs. Due to small kidney when born, 3 weeks ago.went to docs with shortness of breath, following a cough. To find i now need a pacemaker.soon to be done. Then after spiro test. Told i have a severe obstruction. As my doc put it. By all accounts COPD can just creep up on you. My heart was also ok prior to my cough. Due to me checking B/P. I live in Shropshire"
        },
        "MummaSoap": {
            "tags": [
                "Heart failure",
                "Metoprolol",
                "Enalapril",
                "Dapagliflozin",
                "Supraventricular tachycardia (SVT)",
                "Dilated cardiomyopathy",
                "Furosemide",
                "healthyeating",
                "Ageing well",
                "fitness",
                "Women's health",
                "parenting",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2022-06-02",
                "age": "35",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I experienced symptoms during my last trimester with my first child but due to a hot summer and never experiencing pregnancy before, I didn’t realise. After the birth of my son the swelling in my feet and ankles slowly left me but it was a further 2/3 months before I could fit my feet into my own shoes again!\n\nBetween September 2018 and January 2021 (when I was diagnosed) I had a second child in March 2020 but continued to experience tiredness and feeling weak and occasions of my heart racing or feeling more prominent in my chest. I also had to have emergency surgery for a hiatus hernia in December 2020 but about 10 days after surgery when I was still experiencing palpitations I was sent for a chest X-ray and CT scan. My CT scan showed a dilation of my heart and I was referred for an echocardiogram. The day after this appointment I returned to A&E with shortness of breath and palpitations again after paramedics were called and my heart readings were showing that I was becoming tachycardic every time I readjusted my position, stood up or moved around. Later that evening I was admitted to CCU and the next morning my diagnosis was explained to me. My EF was 37% and I was told I had borderline severe heart failure and probable dilated cardiomyopathy. I was also told that I couldn’t have any more children. I began medication and regular monitoring and my heart started to show signs of recovery and my EF increased to 58% which was fantastic news!!\n\nIn May 2021, 4 months later, I received the shocking news that I was in fact 20 weeks pregnant! In August 2021, my symptoms were rapidly getting worse and a repeat echocardiogram showed that I had lost 6% of my heart function in 1 week so the decision was made and my miracle made her way into the world at 32 weeks. \n\nIn November 2021 I had another repeat echocardiogram and it showed my EF had increased to 48%. I’ve had a repeat echocardiogram in June 2022 and my EF was at 45% but I’ve had a recent change to my medication (November 2022) so I’m hopeful that things will improve soon and hopefully with less side effects."
        },
        "Zena166": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-02-20",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "I had a heart attack in June 2017 whilst on holiday in this country. It was a traumatic time! I pushed to get back home (Newcastle Upon Tyne and the Freeman hospital). I had a stent put in and have worked on my health and well-being since.  I cannot change my past but can control my future!"
        },
        "Silvertail": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Medication monitoring",
                "Bundle branch block",
                "Microvascular angina",
                "Takotsubo cardiomyopathy"
            ],
            "demographics": {
                "joined": "2022-04-05",
                "age": "N/A",
                "gender": "Female",
                "country": "Australia",
                "ethnicity": "N/A"
            },
            "bio": "Takotsubo Cardiopathy (Four diagnosed episodes, Diastolic dysfunction, LBBB with Left Axis deviation, AV Block, Mitral regurgitation, Patent Foramen Ovale and Atrial Septal Aneurysm"
        },
        "Cat04": {
            "tags": [
                "Atrial fibrillation",
                "Cardiac ablation",
                "Arrhythmia",
                "Atrial flutter",
                "Aortic valve disease",
                "Valve replacement",
                "Aortic stenosis"
            ],
            "demographics": {
                "joined": "2017-11-11",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "I'm in my mid 60s, 4 years post ablation for PAF after which I had pericarditis and oesophagitis. \nHave congenital BAV with severe aortic stenosis, with aortic dilitation.  Have been in atypical atrial flutter & atrial fibrillation since April 2022. AVR scheduled for Jan 2023 together with LAA clamp, pvi ablation & possible ascending aorta replacement/reduction aortoplasty (borderline measurements) \nUpdate Jan 2023 - OHS for AVR, division of ligament of marshall, insertion of left atrial appendage exclusion clip and pulmonary vein isolation. Aorta repair/replacement not carried out.\nUpdate Oct 2024 - Follow up echo June 2024 as my symptoms returned 6 months post AVR - I now have increased dilatation of aorta, LVH, moderate tricuspid regurgitation, moderate mitral regurgitation (neither of these two prior to AVR) and possible  patient-prosthesis-mismatch (PPM) causing turbulence and resistance of flow through the new aortic valve."
        },
        "Pollypuss": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Ageing well",
                "Women's health"
            ],
            "demographics": {
                "joined": "2020-05-04",
                "age": "82",
                "gender": "Female",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Pollypuss"
        },
        "LaceyLady": {
            "tags": [
                "Diabetes",
                "Empagliflozin",
                "Haemochromatosis",
                "Venesection",
                "Ageing well",
                "weightloss",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-08-21",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Had SVT for around 6 years I think. Developed PAF May 2019 bank holiday, which has changed my equilibrium 😳\n\nI’ve been a Complementary Therapist for 25 years, always interested in health and people. Crafty, Lace maker, photographer any crafts I fancy. Love my garden, wildlife of all sorts. Love discussions.\n\nLove travelling, sadly had to cancel our trip to South America due to the AF and health insurance 😳 Hopefully will be able to go in the near future.\nSince 2019 my health issues increased! T2D also now 😳"
        },
        "Smitty1956": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Aspirin",
                "Atorvastatin",
                "Healthy eating"
            ],
            "demographics": {
                "joined": "2022-04-16",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Smitty1956"
        },
        "Janma123": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Stroke",
                "Type 2 diabetes",
                "Metformin",
                "Gliclazide",
                "Cardiovascular disease (CVD)",
                "Ramipril",
                "Atorvastatin",
                "Furosemide",
                "Edoxaban",
                "Coronary artery bypass graft (CABG)",
                "Atenolol / Nifedipine",
                "Vitamin B12 deficiency"
            ],
            "demographics": {
                "joined": "2018-12-18",
                "age": "73",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm Janma123"
        },
        "Captain_Birdseye": {
            "tags": [
                "Anxiety",
                "Pericarditis",
                "Myocarditis",
                "Aspirin",
                "Bisoprolol",
                "Nonsteroidal anti-inflammatory drugs (NSAIDs)",
                "weightloss",
                "fitness",
                "Women's health",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2022-07-19",
                "age": "37",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with Myocarditis July 2022 and have since looked both for support and to offer support to those I can.\n\nI'm not a medical professional, however have training in medicinal chemistry and pharmacology and have worked in pharma/biotech for over 12 years so I do know drugs!\n\nAnxiety was no stranger, but has plagued me steadily since my diagnosis. Symptoms are ongoing, however life was getting back to \"normal\" until about a month ago when I started getting symtoms of Heart Failure/ Pericarditis... and the struggle to be seen by the cardiologists is very real (through no fault of their own).\n\nFully support our NHS and all their personnel!"
        },
        "Dolphin14": {
            "tags": [
                "Post-traumatic stress disorder (PTSD)"
            ],
            "demographics": {
                "joined": "2019-05-21",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "🇺🇸 🦅"
        },
        "Shar28": {
            "tags": [
                "High cholesterol"
            ],
            "demographics": {
                "joined": "2017-09-10",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Shar28"
        },
        "Cavalierrubie": {
            "tags": [
                "Anxiety",
                "Osteoporosis",
                "Atrial fibrillation",
                "Warfarin",
                "Low blood pressure (hypotension)",
                "Pain Killer",
                "Gastro-oesophageal reflux disease",
                "healthyeating"
            ],
            "demographics": {
                "joined": "2019-06-01",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Have been living with AF for  7 years, although l think l was undiagnosed and had symptoms couple of years before, thinking it was indigestion.   I am currently on medication to control this, but in the process of deciding whether or not to have an ablation.  It’s a difficult decision."
        },
        "stillaboveground": {
            "tags": [
                "Heart attack",
                "Coeliac disease",
                "Gluten-free diet",
                "Eczema and dermatitis",
                "Betnovate",
                "healthyeating",
                "weightloss",
                "fitness",
                "Sleep hygiene"
            ],
            "demographics": {
                "joined": "2019-08-06",
                "age": "80",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I had heart attack while on holiday in Spain on May 25th 2019, due to having been taken ill with gall stones and pancreatitis.\nHad my gall bladder out on March 17th 2020. Need to get fit again."
        },
        "GrannyE": {
            "tags": [
                "Back pain",
                "Osteopathy",
                "Chronic fatigue syndrome (CFS)",
                "Healthy living",
                "Atrial fibrillation",
                "Catheter ablation",
                "Eliquis",
                "Cardiovascular disease (CVD)",
                "Candesartan",
                "High blood pressure (hypertension)",
                "healthyeating",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2017-10-26",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Prescribed omeprazole.  That lowered stomach acid. That gave me anaemia. That affected my heart badly.  Gave me horrible afib and ectopics   Was in dreadful state. Breathless etc. Eventually saw cardiologist and was taken into the Royal Brompton. Had ablation October 23 2017. Discharged too early.  Immediately taken to local hospital as an emergency and sent back to Royal Brompton for a further week.  On apixaban 5mg daily x 2.  Much better.\nAF back more or less all the time now but strong ectopics only rarely but heart v irregular.  I can live with it but it does restrict what I do"
        },
        "Rob6868": {
            "tags": [
                "Coronary heart disease"
            ],
            "demographics": {
                "joined": "2018-04-03",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Diagnosed with coronary heart disease may 2018\n90% Blockage in LAD stent done and now diagnosed with Microvascular angina 2019"
        },
        "Healthyheart1": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Teva levothyroxine",
                "Fibromyalgia",
                "Gabapentin",
                "Irritable bowel syndrome (IBS)",
                "Angina",
                "Isosorbide mononitrate",
                "Nicorandil",
                "Ranexa",
                "Chronic kidney disease (CKD)",
                "Varicose veins",
                "High compression bandage",
                "Cardiovascular disease (CVD)",
                "Aspirin",
                "Clopidogrel"
            ],
            "demographics": {
                "joined": "2018-11-02",
                "age": "66",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with angina in October 2018. It was a shock to me. I couldn't understand how I could have the pain so bad and the spray wouldn't work. As time passed I was diagnosed with vasospastic angina. The pain made more sense to me although it didn't change it. I was given the usual meds aspirin , nicorandil, a statin that I couldn't tolerate, isosorbide in steps up from 10mg I have now settled on 30mg twice daily, diltiazem 240xl, and ranolozine 500mg twice daily. It took 18 months of going to a&e in and out of hospital various times with no end in site. I am now coping a  lot better,  I know my triggers, cold, windy days, hot days, I could be stood in a  draught. In the early days I was so tired and if I was woken up out of a deep sleep I would be in really bad pain that wouldn't be eased with my gtn spray. I still get pain at rest and when I wake up but since having the drug ranolozine it has allowed me to get on with my life with some normality."
        },
        "seasider18": {
            "tags": [
                "Atrial fibrillation",
                "Sleep disorders"
            ],
            "demographics": {
                "joined": "2015-07-02",
                "age": "90",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "87 and wanting to make 102"
        },
        "Nathan53": {
            "tags": [
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2018-06-13",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Nathan53"
        },
        "shopman": {
            "tags": [
                "Heart block",
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2018-05-13",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm shopman"
        },
        "Sljp0000": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Bisoprolol",
                "Rosuvastatin",
                "weightloss",
                "Women's health"
            ],
            "demographics": {
                "joined": "2022-07-06",
                "age": "58",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Been getting a few pains on exertion. Nothing major. Had a CT heart scan which came back with severe calcification in 3 vessels. Score 958. Awaiting Angiogram. Scared stiff, has all come out of the blue. Only found out last night 6/7/22.  No real discussion with gp or cardiac nurse, just an email dropped in my inbox. \n\nUpdate: now had Angiogram which showed severe narrowing in 3 arteries and some veins. Being urgently referred to Glenfield hospital, Leicester for Triple/Quadruple bypass surgery. Feeling scared but grateful it's been found. God is my comfort.\n\nPush forward 5 months. After surgery I had a saddle pulmonary embolism, a thrombus in my heart and clots in both lungs.\n\n Recently found out my diaphragm isn't working due to nerve damage during surgery.\n\nFeb 23 had angiogram to be told none of my grafts have worked. Heartbroken. All that for nothing. Back to square one. Except now I have heart damage, messed up diaphragm, numbness from scars and sternum pain. \n\nWaiting to discuss the way forward. Feeling sad.\n\nNow had 4 stents in 3 arteries. Praying they stay tissue/clot free unlike my grafts. Got to stay positive.\n\nUpdate. Tests show Phrenic nerve was severed during surgery. Will always have a paralysed left sided diaphragm which means my breathing is compromised. \nSternum not healed."
        },
        "Larneybuds": {
            "tags": [
                "healthyeating",
                "fitness"
            ],
            "demographics": {
                "joined": "2022-02-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Previously fit, healthy, very active and young at heart 66 year old. Was newly retired 2021 from education but haven't been able to enjoy the time due to shock heart diagnosis. ...mitral and tricuspid valve....severe regurgitation.\n2 cancellations with a final op to repair valves which resulted in severe hospital infection, 4 week stay in hospital and ongoing problems since plus another 3 week hospital stay before Xmas.....  administered new and different medication. Fingers crossed for an eventual good recovery"
        },
        "gal4God": {
            "tags": [
                "Asthma"
            ],
            "demographics": {
                "joined": "2017-10-02",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm gal4God"
        },
        "Ticktock61": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-07-30",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Ticktock61"
        },
        "wischo": {
            "tags": [
                "Atrial fibrillation",
                "Bisoprolol",
                "Catheter ablation",
                "Cardiovascular disease (CVD)",
                "Percutaneous coronary intervention (PCI)",
                "Coronary angioplasty",
                "High blood pressure (hypertension)",
                "Ramipril",
                "Atorvastatin",
                "Men's health",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2021-10-15",
                "age": "74",
                "gender": "Man",
                "country": "Ireland",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Father died from DCM at 83 yrs old although he was ill from his mid 70s. My younger brother was diagnosed with DCM in 2011 and I was advised to have a check. Was dignosed with DCM in 2012 and EF 45/50%. Put on Ramipril for BP and fine until 2017 and started feeling tired. Angiogram in 2017 and again in 2019 and left artery stent fitted as some narrowing. Walk 5 miles a day and feel good at the moment with occasional SVTs and Bradycardia. Routine check in 2023 showed further blockage and another stent fitted February 2023. This blockage was noted in 2019 but was not deemed serious enough to fit stent until angiogram showed further narrowing and stent fitted 2023. Atrial Fibrillation august 2023."
        },
        "Manhattan1": {
            "tags": [
                "Asthma",
                "Inhalers",
                "Hashimoto's disease",
                "Type 2 diabetes",
                "Linagliptin",
                "Coronary heart disease",
                "Aspirin",
                "Simvastatin",
                "Chronic kidney disease (CKD)",
                "Kidney stones",
                "Diverticulosis",
                "Cardiovascular disease (CVD)",
                "High blood pressure (hypertension)",
                "Bendroflumethiazide",
                "Perindopril",
                "Non-alcoholic fatty liver disease (NAFLD)"
            ],
            "demographics": {
                "joined": "2018-03-21",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "retired.. enjoy reading books and going for walks (when able lol).. been a few cruises.. hopefully eastern seaboard of Canada next year👏.. had a CT angio April 2020 and i now know i have coronary plaque disease .. also\nangina and ischaemic heart disease.. .. oh and i live in Central Scotland!."
        },
        "Yasyass": {
            "tags": [
                "healthyeating",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-11-19",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Had heart attack felt fine and doing everything normal until I asked to do a rchigram showed 35%ef since then I feel ill  just thoughts of it"
        },
        "scentedgardener": {
            "tags": [
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2021-08-23",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm scentedgardener"
        },
        "Hrty": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Blood tests",
                "Vitamin D3",
                "Men's health",
                "healthyeating",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2022-11-29",
                "age": "N/A",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Felt some pain in left forearm whilst swimming on 23 Nov 2022. Shrugged it off as muscle strain. Felt very sick in changing room. Once that eased walked home and nodded off on sofa.\nFelt worse in afternoon. Rang 111 who called ambulance. Taken to A&E where told I was having HA. Pumped full of pain killers and, after a long night in A&E, was admitted to CCU. Had angiograph later that day. No stents inserted but given cocktail of drugs. Bisoprolol, clopidigrel, dispersible aspirin and Atorvastatin plus existing BP meds Felodipine and Telmisartan. A bit later on given lansaprozole to help stomach.\nNow getting used to meds and dealing with emotional impact."
        },
        "dunestar": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Atrial fibrillation",
                "Angina",
                "Aspirin",
                "Bisoprolol",
                "Ramipril",
                "Atorvastatin",
                "Clopidogrel",
                "Isosorbide mononitrate",
                "Cardiovascular disease (CVD)",
                "Microvascular angina",
                "healthyeating",
                "weightloss",
                "fitness"
            ],
            "demographics": {
                "joined": "2018-09-16",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "My family has a strong history of thyroid problems.  I have had subclinical hypothyroidism for many years but I've never been medicated.  I have microvascular angina but this is well controlled with medication.  An angiogram revealed I also have mild blockage of the LAD.  I have also developed paroxysmal Atrial Fibrillation which I can keep largely under control by avoiding the factors which trigger it."
        },
        "Helly75": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Overactive thyroid (hyperthyroidism)"
            ],
            "demographics": {
                "joined": "2021-05-23",
                "age": "49",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I was diagnosed with myocarditis in 2018 , 2021 & 2024 . I had a stemi & cardiac arrest in 2024"
        },
        "Digger0": {
            "tags": [
                "Graves' disease",
                "Radioactive iodine",
                "Overactive thyroid (hyperthyroidism)",
                "Levothyroxine",
                "Bronchiectasis",
                "Carbocisteine",
                "Azythromycin",
                "Lung disease",
                "Heart murmur",
                "Catheterisation",
                "Echocardiogram",
                "Birth defects",
                "Congenital heart disease",
                "Gastro-oesophageal reflux disease",
                "Omeprazole"
            ],
            "demographics": {
                "joined": "2021-06-16",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Hi! I'm Digger0"
        },
        "PadThaiNoodles": {
            "tags": [
                "Anxiety",
                "Escitalopram",
                "Cognitive behavioural therapy (CBT)",
                "Heart valve diseases",
                "Warfarin",
                "Heart surgery",
                "Major depressive disorder (MDD)",
                "Lamotrigine"
            ],
            "demographics": {
                "joined": "2024-10-14",
                "age": "61",
                "gender": "Man",
                "country": "Ireland",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Currently recovering from open heart surgery for mitral valve repair and aortic valve replacement (mechanical)."
        },
        "Rose54": {
            "tags": [
                "Underactive thyroid (hypothyroidism)",
                "Levothyroxine",
                "Medication monitoring",
                "Heart attack",
                "Parkinson's disease",
                "Polymyalgia rheumatica",
                "Steroids"
            ],
            "demographics": {
                "joined": "2015-09-04",
                "age": "N/A",
                "gender": "Woman",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "In UK \nDiagnosed or should say self diagnosed in Aug 15 with PMR after months or year going to and from GP informed I had CFS .\nI have a underactive thyroid although I have had this for about 15 years \nUpdate Jan 17 down to 9.5 feeling well working full time \nReducing .5 at a time listening to how my body feels and enjoying life  \nUpdate Dec 17 flare in May 17 increased to 15 now going from 9 to 8.5 reduced hours at work but all ok March 18 flare so from8 to 10\n2022 may got down to 7mg had to increase to 15mh  come July 2022 present July 22 feeling not much better but trying to stay positive. \nNov 2024 recovering from hip op in July new things weren’t right .But was on waiting list to see Nerologist was told a year wait\nSymptoms \nTremors \nSlow walk\nBalance issues"
        },
        "VelvetSky": {
            "tags": [
                "Heart attack",
                "Diabetes diet",
                "Type 2 diabetes",
                "Sjogren's syndrome",
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2019-02-21",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm VelvetSky"
        },
        "Smileyian": {
            "tags": [
                "Ageing well",
                "weightloss"
            ],
            "demographics": {
                "joined": "2020-05-01",
                "age": "N/A",
                "gender": "Male",
                "country": "Singapore",
                "ethnicity": "White / Caucasian"
            },
            "bio": "Hi I am a 78  year old man just rejoining after 2 year absence."
        },
        "benjijen": {
            "tags": [
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2013-12-27",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm benjijen"
        },
        "Jetcat": {
            "tags": [
                "Atrial fibrillation",
                "Cardiac ablation",
                "Men's health",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2021-01-22",
                "age": "57",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "53 years old male. Diagnosed AFIB 2015, undergone 3 PVI ablations. Work full time, bit of a worrier, had anxiety and anger issues in past."
        },
        "Palpman": {
            "tags": [
                "Atrial fibrillation",
                "Arrhythmia",
                "Catheter ablation",
                "Atrial flutter",
                "Flecainide",
                "healthyeating",
                "weightloss",
                "quitsmoking"
            ],
            "demographics": {
                "joined": "2019-08-11",
                "age": "70",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Ex South Africa gold mines Telemetry and control systems engineering."
        },
        "ChoochSiesta": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Percutaneous coronary intervention (PCI)",
                "fitness"
            ],
            "demographics": {
                "joined": "2021-11-17",
                "age": "N/A",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "2014 Heart attack, single stent still doing its job. 2021 MRI showed 2 different blocked arteries, double CABG recommended in Oct. 2021 and was done Feb. 2022, a 3rd artery was bypassed whilst he was in there. \nThe worst thing was feeling nauseous from the drugs after coming round."
        },
        "Snowdrops_17": {
            "tags": [
                "Osteoarthritis",
                "Coronary heart disease",
                "Aspirin",
                "Bisoprolol",
                "Ramipril",
                "Atorvastatin",
                "Peripheral artery disease",
                "Cardiovascular disease (CVD)",
                "Ticagrelor",
                "High blood pressure (hypertension)",
                "healthyeating",
                "weightloss",
                "fitness",
                "Women's health"
            ],
            "demographics": {
                "joined": "2019-03-03",
                "age": "68",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "I had a heart attack February 2019,  2 Angioplasties and 3 stents!\nIn June 2019 had an MRI to confirm peripheral artery disease in both legs and a blockage, 13 cm, in my left leg! \n\nI still tire much easier since then and still experiencing symptoms in my legs which can become painful especially in my calves!  Going for walks, house work or gardening is more a chore now then relaxing! But I don't give up and bat on! \nOsteoarthritis in my hands, fingers and feet doesn't help but glad it's not severe! But I do feel my hands aching a lot after pruning shrubs or washing-up which I did in my previous job as kitchen porter!\nBut I have a big family, we are 14 members altogether and I have 5 grandchildren 🥰 \nI moved from Germany to England with my husband, to North Yorkshire, January 1993 but since 2009 I am living on my own! I can't believe it's over 30 years now! I still have close family in Germany as well, which is wonderful  and I call them as often as I can! \nLast year December 2022 we suddenly lost my only older sister Conny! That was a massive blow to all of my family and me and after I retired from work I finally had proper time to grief and reflect after 8 months of her death! \nLife is mixed with happiness and loss, achievements and rewards good or not so good jobs afterwards! \nBut we are alive and whilst we are alive lets give thanks to God for every new day he is giving to us!"
        },
        "momander": {
            "tags": [
                "Arthritis",
                "Hip Replacement"
            ],
            "demographics": {
                "joined": "2021-11-01",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "i had a hip replacement in 2013 and suspect the other one needs replaced now. I suffered a heart attack in may 2021 and had a stent fitted, quit smoking and hardly drink now. trying hard to exercise but in such a lot of pain as i have a hereditory back condition called hyperlordosis. i also have a herniated disc and sciatica. anti inflammatories were wonderful but cant take them now i have had a heart attack."
        },
        "richard_jw": {
            "tags": [
                "Heart attack",
                "Angioplasty",
                "Epilepsy",
                "Phenytoin",
                "Atrial fibrillation",
                "Apixaban",
                "Cardiovascular disease (CVD)",
                "Bisoprolol",
                "Atorvastatin",
                "Famotidine",
                "Coronary angioplasty",
                "Echocardiogram"
            ],
            "demographics": {
                "joined": "2021-02-11",
                "age": "80",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Had a STEMI which came with no prior warning. Angioplasty did not clear clots in the Right Coronary artery completely, neither could they insert a stent  because the artery is ectatic. \nA nightmare trying to get meds right. Bisoprolol in particular had V bad side effects, and no longer take it because STEMI damage is not too bad, and angiogram showed arteries clear.\nAwful side effects from Ranolazine only took it for a week, and GP said stop.\nWent to a good private cardiologist who looked at angiogram and discussed symptoms and made significant changes to meds. Feel much better"
        },
        "cappachina": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Aortic stenosis",
                "Medication monitoring"
            ],
            "demographics": {
                "joined": "2022-08-22",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi Everyone\nI have had mitral incompetence since I was a child when I had bad bouts of Rheumatic fever This has never bothered me  but now at 74 when I had a routine echocardiogra it showed up aortic stensosis  in the severe stage though I had no symptoms   I a unfortunately allergic to the iodine dye they use in ops and was wondering if anyone on the forum had the same problem."
        },
        "Sina-6491": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-07-17",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Sina-6491"
        },
        "Fortepiano": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2017-08-02",
                "age": "N/A",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Fortepiano"
        },
        "kefalonia1": {
            "tags": [
                "Heart block",
                "Warfarin",
                "Aortic valve replacement",
                "Pacemaker",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2017-07-25",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "contracted severe sepsis, then infective endocarditis which led to my healthy heart being destroyed. Had emergency repairs to root and mechanical aortic valve replacement twice as first one failed and heart repaired. Total heart block and pacemaker. Hardest part was three months in hospital mentally. All good now, only medication is lifelong warfarin"
        },
        "Nic25": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-08-11",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "At age 50 in December 2018 I had an aortic valve replacement (tissue Edwards Inspiris Resilia) and ascending aneurysm repair. All good."
        },
        "isobelhannah18": {
            "tags": [
                "N/A"
            ],
            "demographics": {
                "joined": "2018-10-20",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm isobelhannah18"
        },
        "JennyRx": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Amlodipine"
            ],
            "demographics": {
                "joined": "2020-07-24",
                "age": "69",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "Mixed / Multiple ethnic groups"
            },
            "bio": "I’m a pharmacist by profession and never expected to be a patient. Nov 2018 I was diagnosed with triple positive breast cancer and had surgery, chemo, rads and targeted therapy for a year. Before I’d even finished oncology I found myself breathless when on my daily run. Eliminating the possibility of side effects of treatment, then exertion asthma I was found to have angina. Finally ended up with having CTO PCI and two stents. Also found to have high levels of lp(a) which can affect other close members of my family. It increases risk of heart disease."
        },
        "Nettekin": {
            "tags": [
                "Pain",
                "Diabetes",
                "High cholesterol",
                "Cardiovascular disease (CVD)",
                "High blood pressure (hypertension)"
            ],
            "demographics": {
                "joined": "2019-07-14",
                "age": "N/A",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "N/A"
            },
            "bio": "Hi! I'm Nettekin"
        },
        "uzininemm": {
            "tags": [
                "Heart failure",
                "Exercise",
                "healthyeating",
                "parenting"
            ],
            "demographics": {
                "joined": "2021-07-07",
                "age": "57",
                "gender": "N/A",
                "country": "N/A",
                "ethnicity": "Prefer not to say"
            },
            "bio": "Not been ill for 40 years, (except flu and colds), taken into hospital and during 5 days of tests found I had sepsis and following treatment for this found I had also suffered heart failure. (In hospital for 14 days).\n\nWasn't high risk as never smoked, weight within BMI, only drunk moderately for years (and very or little or nothing in the last 18 months). Moderate exercise and very aware of the impact of salt so for many years tried to have a low salt diet.\n\nWhy? they couldn't tell me! (mind you I have nothing but praise respect for the hospital as everyone from the support staff to the consultant were brillant).\n\nOn meds, (too many to mention), a improved diet (wasn't doing a lot wrong beforehand), and exercise (which are all doing me good (well I think so)."
        },
        "WardijaWardija": {
            "tags": [
                "Arthritis",
                "Meditation",
                "Transient ischaemic attack (TIA)",
                "Warfarin",
                "Isosorbide mononitrate",
                "Statins",
                "Coronary heart disease",
                "Aspirin",
                "Clopidogrel",
                "Medication monitoring",
                "Disopyramide",
                "Coronary artery bypass graft (CABG)",
                "Chronic kidney disease (CKD)",
                "Low sodium diet",
                "Kidney disease",
                "Lymphoedema",
                "High compression bandage",
                "Insulin resistance",
                "Insulin glargine",
                "Regular insulin",
                "Diethylpropion",
                "Congenital heart disease",
                "Cardiovascular disease (CVD)",
                "Hypertrophic cardiomyopathy",
                "Ageing well"
            ],
            "demographics": {
                "joined": "2019-05-17",
                "age": "N/A",
                "gender": "Female",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "TIA 2018   \nBLOCKED ARTERY DISEASE  &  AFIB.\n HA 2019  》  3 STENTS & ALL THE USUAL MEDS.\nHYPERTROPHIC CARDIOMYOPATHY (GENETIC) DIAGNOSED 2020 》 \n\nLYMPHOEDEMA- TRAUMA AQUIRED  2020\n\nDIABETES  -  INSULIN DEPENDENT    1990"
        },
        "Mentdent": {
            "tags": [
                "Cardiovascular disease (CVD)"
            ],
            "demographics": {
                "joined": "2020-11-25",
                "age": "72",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "NSTMI 03/21. Severe psoriatic arthritis plus associated medication"
        },
        "Cliff_G": {
            "tags": [
                "Aortic dissection",
                "Surgery"
            ],
            "demographics": {
                "joined": "2019-05-16",
                "age": "70",
                "gender": "N/A",
                "country": "United Kingdom",
                "ethnicity": "N/A"
            },
            "bio": "Survivor of an acute Type A Aortic Dissection and member of the Frozen Elephant Trunk Club.  \n\nMember of and past Scotland Representative for Aortic Dissection Awareness UK & Ireland and member of the Facebook group \"Aortic Dissection UK Buddies\".  \n\nSee also https://aorticdissectionawareness.org/  \nand https://thinkaorta.net  \n\nEditor of Aortic Dissection - the Patient Guide\n- see https://aorticdissectionawareness.org/resources.\n\nAlso experienced (!) A- fibber."
        },
        "Survivor1952": {
            "tags": [
                "Cardiovascular disease (CVD)",
                "Losartan",
                "Heart valve diseases",
                "Angioplasty",
                "Valve replacement",
                "Coronary artery bypass graft (CABG)",
                "Men's health",
                "healthyeating",
                "Ageing well",
                "fitness"
            ],
            "demographics": {
                "joined": "2023-08-08",
                "age": "72",
                "gender": "Male",
                "country": "United Kingdom",
                "ethnicity": "White"
            },
            "bio": "Recovered from PCI (2 stents), AVR and CABG which were done in June ‘23."
        }
    }
}